<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\TestType;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class TestThreeSeeder extends Seeder
{
  /**
   * Run the database seeds.
   */
  public function run(): void
  {
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 1,
      'introduction' => 'უნივერსიტეტის სენატის ოთხი წევრიდან - გიორგი, ეკა, ბექა და ნინო - თითოეულმა სენატის ხელმძღვანელად
      დაასახელა დანარჩენი სამიდან ერთ-ერთი. ცნობილია შემდეგი:',

      'conditions' => json_encode([
        'ნინომ დაასახელა გიორგი.',
        'ბექა სენატის ხელმძღვანელად ორმა წევრმა დაასახელა.',

      ]),
      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია შეუძლებელი?',
      'answers' => json_encode(
        [
          'ა' => 'ეკამ დაასახელა ბექა',
          'ბ' => 'ბექამ დაასახელა გიორგი',
          'გ' => 'გიორგიმ დაასახელა ბექა',
          'დ' => 'ბექამ დაასახელა ნინო',
          'ე' => 'გიორგიმ დაასახელა ეკა',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 2,

      'introduction' => 'ბაღში ერთ მწკრივად ოთხი სხვადასხვა ჯიშის ხეა დარგული: ატმის, ვაშლის, ქლიავისა და ალუბლის (არა
      აუცილებლად ამ თანმიმდევრობით)',

      'conditions' => json_encode([
        'ატმის ხე არ არის მწკრივის განაპირას.',
        'ყველაზე მაღალი ხე უშუალოდ ალუბლის ხის მარჯვნივ არის დარგული.',
        'ვაშლისა და ატმის ხეებს შორის ერთი ხეა დარგული.',

      ]),
      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია შესაძლებელი?',
      'answers' => json_encode(
        [
          'ა' => 'ატმის ხე ალუბლის ხის გვერდით არ არის დარგული',
          'ბ' => 'ალუბლის ხე უშუალოდ ქლიავის ხის გვერდითაა',
          'გ' => 'ვაშლის ხე არ არის მწკრივის განაპირას',
          'დ' => 'ატმის ხე ყველაზე მაღალია',
          'ე' => 'ქლიავის ხე ყველაზე მაღალია',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 3,

      'introduction' => 'მოცემულია სამი დებულება:',

      'conditions' => json_encode([
        'ყველა მუსიკოსი სრულწლოვანია.',
        'ყველა მოქანდაკე სრულწლოვანია.',
        'არც ერთი მუსიკოსი არ არის მოქანდაკე.',

      ]),
      'question' => 'თუ ეს დებულებები ჭეშმარიტია, მაშინ ქვემოთ ჩამოთვლილთაგან რომელი არ შეიძლება იყოს ჭეშმარიტი?',
      'answers' => json_encode(
        [
          'ა' => 'ზოგიერთი არამოქანდაკე მუსიკოსია',
          'ბ' => 'ზოგიერთი არასრულწლოვანი მოქანდაკეა',
          'გ' => 'ზოგიერთი არასრულწლოვანი არ არის მუსიკოსი',
          'დ' => 'ზოგიერთი არამუსიკოსი არ არის მოქანდაკე',
          'ე' => 'ზოგიერთი არასრულწლოვანი არ არის მოქანდაკე',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 4,

      'introduction' => 'მოცემულია:',

      'conditions' => json_encode([
        'ამ კლუბის ზოგიერთი წევრი პროფესიონალი მოჭადრაკეა.',
        'გიორგიმ დაასკვნა: მაშასადამე, ამ კლუბის ზოგიერთი წევრი გონიერია.',
      ]),


      'question' => 'ქვემოთ ჩამოთვლილთაგან კიდევ რომელი წანამძღვარია საჭირო ამ დასკვნის გამოსატანად?',
      'answers' => json_encode(
        [
          'ა' => 'არსებობენ მოჭადრაკეები, რომლებიც გონიერები არიან',
          'ბ' => 'ზოგიერთი პროფესიონალი მოჭადრაკე გონიერია',
          'გ' => 'ყველა პროფესიონალი მოჭადრაკე გონიერია',
          'დ' => 'ზოგიერთი გონიერი ადამიანი არ არის მოჭადრაკე',
          'ე' => 'ზოგიერთი პროფესიონალი მოჭადრაკე არ არის გონიერი',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 5,

      'introduction' => 'მეცნიერებმა დაადგინეს, რომ როცა მცენარეებს საფრთხე ემუქრებათ, ისინი იყენებენ ერთგვარ „ენას“, რომლითაც
      სახიფათო მტაცებლის შესახებ სხვა მცენარეებსაც აფრთხილებენ.',
      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განამტკიცებს ყველაზე მეტად მეცნიერთა ამ დასკვნას?',
      'answers' => json_encode(
        [
          'ა' => 'ზოგიერთი მცენარე მასზე მავნებლების თავდასხმისას გამოყოფს სურნელოვან ნივთიერებას. ეს ნივთიერება იზიდავს იმ
          მწერებს, რომლებიც ამ მცენარის ფოთლებზე არსებული პარაზიტებით იკვებებიან',
          'ბ' => 'ყვავილოვანი მცენარეები მწერების როგორც მისაზიდად, ისე დასაფრთხობად გამოყოფენ ქიმიურ ნივთიერებებს, იმავე
          ნივთიერებებს გამოყოფენ მწერებიც. ამ ნივთიერებებს მწერებში სასიგნალო ფუნქციაც აქვს',
          'გ' => 'ცხოველების ორგანიზმში ტკივილის შესახებ ინფორმაცია იმავე ნივთიერებებით ვრცელდება, რომლებიც მცენარის
          დაზიანების შემთხვევაში მის დაუზიანებელ ნაწილში თავდაცვითი რეაქციების გააქტიურებას უზრუნველყოფს',
          'დ' => 'ზოგიერთი მცენარის ფოთლის დაზიანებისას გამოიყოფა ნივთიერება გლუტამატი, რომელიც უზრუნველყოფს
          მცენარის დანარჩენ დაუზიანებელ ნაწილებში თავდაცვითი რეაქციების გააქტიურებას',
          'ე' => 'ზოგიერთ მცენარეში პერიოდულად აქტიურდება ნივთიერებები, რომლებიც მავნებლებს უზღუდავს მონელების უნარს.
          ეს განსაკუთრებით მაშინ ხდება, როცა ახლომდებარე მცენარეს პარაზიტები შემოესევიან',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 6,

      'introduction' => 'სიმამაცე, ------ ნიშნავს შიშის არქონას. ------ სიმამაცე ------ , რომ ------ შიშზე მეტად მნიშვნელოვანი.',
      'answers' => json_encode(
        [
          'ა' => 'უპირველეს ყოვლისა, / თუმცა, / არ უნდა ავურიოთ იმის შეგნების უნარში / არაფერია',
          'ბ' => 'რასაკვირველია, არ / მაგრამ / მხოლოდ მას ახასიათებს, ვინც ფიქრობს / არაფერია',
          'გ' => 'რასაკვირველია, არ / სინამდვილეში / იმის შეგნების უნარია / არსებობს რაღაც',
          'დ' => 'უპირველეს ყოვლისა, / შესაბამისად, / მხოლოდ მას ახასიათებს, ვინც არ იცის / არსებობს რაღაც',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 7,

      'introduction' => 'სოციალ-ევოლუციონისტები ამტკიცებენ, რომ სოციალური ევოლუცია ბიოლოგიური ------ მათ შორის ------ ხედავენ:
      ბიოლოგიური ევოლუცია, რომლისთვისაც არსებითია ინდივიდის შეგუებულობა, ------ სოციალური ევოლუცია,
      რომელიც საზოგადოების შეგუებულობას გულისხმობს, მიმდინარეობს ------ .',
      'answers' => json_encode(
        [
          'ა' => 'ევოლუციისგან აშკარად განსხვავდება, თუმცა / ანალოგიასაც / ნელი და შემთხვევითია, ზუსტად ასევე / როგორც
          დაუგეგმავად, ისე განსაზღვრული გეგმის მიხედვით',
          'ბ' => 'ევოლუციის ანალოგიურია, თუმცა / სხვაობებსაც / ნელი და შემთხვევითია, ხოლო / როგორც დაუგეგმავად, ისე
          განსაზღვრული გეგმის მიხედვით და მისი შედეგებიც შედარებით სწრაფია',
          'გ' => 'ევოლუციისგან დიდად არ განსხვავდება, ამიტომ / ბევრ პარალელს / მოიცავს მთლიანად საზოგადოებებს და არა
          ინდივიდებს, მსგავსად ამისა / სტრუქტურული ცვლილებებისა და გადარჩევის პროცესის სახით',
          'დ' => 'ევოლუციის ანალოგიური სულაც არ არის, რადგან / მნიშვნელოვან განსხვავებას ვერ / საზოგადოებრივი
          ტენდენციების ცვალებადობას განაპირობებს, მაშინ, როცა / საზოგადოების და არა ინდივიდის ადაპტაციის
          პროცესის სახით',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 8,

      'introduction' => 'პასუხისმგებლობის მაღალი დონე ------ გულისხმობს მაღალ ანაზღაურებას. ------ , საპასუხისმგებლო პროფესია
      ანაზღაურების ------ ხდება ხოლმე მამოტივირებელი ადამიანებისათვის. ეს აიხსნება იმ ფაქტით, რომ პასუხისმგებლობის
      აღება იმთავითვე ------',
      'answers' => json_encode(
        [
          'ა' => 'ყოველთვის / მიუხედავად ამისა / გათვალისწინებით / მაღალ თვითშეფასებასთან, პატივისცემასა და მიღწევის
          განცდასთან ასოცირდება',
          'ბ' => 'ყოველთვის როდი / როგორც წესი / მიუხედავად / მაღალ თვითშეფასებასთან, პატივისცემასა და მიღწევის
          განცდასთან ასოცირდება',
          'გ' => 'ყოველთვის როდი / სწორედ ამიტომ / გათვალისწინების გარეშე / მაღალ რისკთან და საფრთხის განცდასთან
          ასოცირდება',
          'დ' => 'ყოველთვის / შესაბამისად / მიუხედავად / მაღალ რისკთან და საფრთხის განცდასთან ასოცირდება',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 9,

      'introduction' => '------- პოლიტიკოსებს, რომლებიც ეროვნული ღირებულებების ------- გვპირდებიან. ეს ღირებულებები ფაქტად -------
      აღვიქვათ, -------. ქცევების სწრაფი ცვლილებების მიუხედავად, საზოგადოების ბაზისური ღირებულებები ------- ',
      'answers' => json_encode(
        [
          'ა' => 'არასდროს ენდოთ / შეცვლას / უნდა / ისევე, როგორც, მაგალითად, ქვეყნის გეოგრაფიული მდებარეობა / სტაბილურია',
          'ბ' => 'გონივრულია, ვენდოთ / შეცვლას / არ უნდა / განსხვავებით ქვეყნის გეოგრაფიული მდებარეობისგან / სტაბილურია',
          'გ' => 'გონივრულია, ვენდოთ / შენარჩუნებას / უნდა / ისევე, როგორც, მაგალითად, ქვეყნის გეოგრაფიული მდებარეობა /
          შეიძლება შეიცვალოს',
          'დ' => 'არასდროს ენდოთ / შენარჩუნებას / არ უნდა / განსხვავებით ქვეყნის გეოგრაფიული მდებარეობისგან / სტაბილურია',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 10,
      'introduction' => 'XVI-XVII საუკუნეების ვენეციის მკვიდრნი რესპუბლიკაში არსებულ პოლიტიკურ და სოციალურ სტაბილურობას
      ხსნიდნენ კონსტიტუციით',
      'answers' => json_encode(
        [
          'ა' => 'რომელიც ორიენტირებული იყო დემოკრატიული პრინციპების დაცვაზე',
          'ბ' => 'რომელიც მიზნად ისახავდა საზოგადოების ყოველი წევრის ინტერესების დაცვას',
          'გ' => 'რომელიც თითქოსდა ითვალისწინებდა სხვადასხვა სოციალური ფენის ინტერესებს',
          'დ' => 'რომელშიც წარმოდგენილი იყო როგორც წარჩინებულთა, ისე მდაბიოთა ინტერესები',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 11,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელს ვერ გამოვიყენებთ სოციალური კავშირების შენარჩუნების მაგალითად?',
      'answers' => json_encode(
        [
          'ა' => 'წვრილი არისტოკრატები მოქმედებდნენ პატრონაჟის ინტერესების დაცვით, ეს ინტერესები კი თითოეულ მათგანს
          რომელიმე „გრანდისთან“ აკავშირებდა',
          'ბ' => 'დიდი საბჭოს გარეთ დარჩენილი ე. წ. მოქალაქეები (2000-3000 მამაკაცი) იკავებდნენ ადმინისტრაციულ
          თანამდებობებს, მათ ქალიშვილებს კი ცოლად ირთავდნენ წარჩინებულები',
          'გ' => 'დიდებულებს, რომლებიც პრაქტიკულად მართავდნენ ვენეციას და რომელთაც ემორჩილებოდნენ წვრილი
          არისტოკრატები, ხელთ ეპყრათ უმთავრესი პოლიტიკური დაწესებულებების გასაღებები',
          'დ' => 'გარკვეული პრივილეგიები, მაგ., ადმინისტრაციული თანამდებობები, აგრძნობინებდა მოქალაქეებს, რომ ისინი
          წარჩინებულთაგან დიდად არ განსხვავდებოდნენ',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 12,
      'introduction' => 'გაგაცნობთ ინფორმაციას ძველ ბერძნულ დღესასწაულზე – ელევსინიებზე :
      გაზაფხულზე ქალაქ ელევსინში იმართებოდა დღესასწაული მიწათმოქმედების ქალღმერთ დემეტრას სადიდებელად.
      ბუნების კვლავ ამწვანებამ და ხმელი თესლიდან ცოცხალი მცენარის აღმოცენებამ ძველ ბერძნებს შეუქმნა წარმოდგენა
      მკვდრეთით აღდგომის შესახებ. ელევსინის მისტერიებში (საიდუმლო რიტუალებში) მონაწილეობის უფლება ჰქონდათ
      მხოლოდ უდანაშაულო ადამიანებს. დღესასწაულის მონაწილენი განასახიერებდნენ მგლოვიარე დემეტრას, რომელიც
      შვილს ეძებდა. სცენაზე თამაშდებოდა სპექტაკლი: შვილის დაკარგვით დამწუხრებული დემეტრას გლოვა იცვლებოდა
      სიხარულით, როდესაც სცენაზე სიბნელიდან გამოჩნდებოდა პერსეფონე (დემეტრას შვილი). სიბნელე იცვლებოდა
      სინათლით და ქორო აღავლენდა ჰიმნს ღვთაების სადიდებლად.',
      'question' => 'ელევსინიებისა და ვენეციური კარნავალის შედარების საფუძველზე შეიძლება დავასკვნათ:',
      'answers' => json_encode(
        [
          'ა' => 'ელევსინიების ძირითადი ფუნქცია ღმერთთან ადამიანის კავშირის გაცნობიერება იყო, ვენეციის კარნავალს კი თითქმის
          დაკარგული აქვს რელიგიური შინაარსი, მიუხედავად იმისა, რომ მისი წარმოშობა დიდმარხვას უკავშირდება',
          'ბ' => 'ელევსინიებში მონაწილეობის უფლება ნებისმიერ ადამიანს შეეძლო, ისევე როგორც ვენეციის კარნავალში – აქ
          დამნაშავეთა სამყაროს ერთგვარი რომანტიზება ხდებოდა',
          'გ' => 'ელევსინიებში მთავარი სპექტაკლი ერთსა და იმავე სიუჟეტს იმეორებდა – ღმერთის მკვდრეთით აღდგომას, ისევე
          როგორც ვენეციის კარნავალში, რომლის თითოეული მონაწილის როლი მკაცრად იყო განსაზღვრული',
          'დ' => 'ელევსინიები იყო მისტერიები – საიდუმლო რიტუალები, ვენეციის კარნავალში კი საკრალურობა შეცვალა ღია
          დაპირისპირებამ საერო თუ სასულიერო ხელისუფალთან',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 13,
      'introduction' => 'რა ფუნქცია აქვს ტექსტისთვის მეთევზეთა დოჟისა და ჩრდილო იტალიის ქალაქების ეპიზოდებს? (IV აბზაცი)',
      'question' => 'ორივე ეპიზოდი ამყარებს იმ მოსაზრებას, რომ:',
      'answers' => json_encode(
        [
          'ა' => 'ენეციისა და მის დაქვემდებარებულ ტერიტორიათა მოსახლეობის ცხოვრება ერთგვარად თეატრალიზებული იყო',
          'ბ' => 'ვენეციასა და ჩრდილო იტალიის ქალაქებში როგორც დაბალი სოციალური ფენა, ისე პატრიციები მოტყუებულნი
          რჩებოდნენ, რადგან აქტიური პოლიტიკური სისტემიდან გამოდევნილნი იყვნენ',
          'გ' => 'ვენეციასა და მის ირგვლივ არსებულ ქალაქებში საზოგადოების ყოველი წევრი ეგალიტარული, თანასწორუფლებიანი
          იყო',
          'დ' => 'ვენეციასა და მის მიმდებარე ქალაქებში სოციალური სისტემის სტაბილურობა ემყარებოდა ძალაუფლებათა ერთგვარ
          წონასწორობას',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 14,
      'introduction' => 'გადმოცემის თანახმად, 1794 წელს ნაპოლეონ ბონაპარტემ იტალიის დაპყრობა გადაწყვიტა. მან ვენეციის რესპუბლიკას
      ომი გამოუცხადა. თავისუფლების სანაცვლოდ სენატმა ნაპოლეონს ფული შესთავაზა, მაგრამ უარი მიიღო. სენატორები
      შეშინდნენ და ხელისუფლება მიატოვეს. მაშინდელმა დოჟმა კი, მხიარულმა ლუდოვიკო მანინმა, გვირგვინი თავიდან
      მოიძრო, ლაქიას გადაუგდო და დაუძახა: „აჰა, დაიჭირე, აღარ დამჭირდება!“ 1797 წლის 15 მაისს ნაპოლეონის ჯარები
      ვენეციაში შევიდნენ.',
      'question' => 'ტექსტის III აბზაცის რომელი წინადადების ილუსტრაციად შეიძლება განვიხილოთ ლუდოვიკო მანინის ეს ქმედება?',
      'answers' => json_encode(
        [
          'ა' => 'კარნავალი შლიდა ყველანაირ ზღვარს, აკრძალვას, ნორმას, პრივილეგიას',
          'ბ' => 'ჩვეულებრივ დღეებშიც ბევრი ირგებდა ნიღაბს, თითქოს ვენეციის მთელი ცხოვრებაც კარნავალი იყო',
          'გ' => 'ვენეციელებს კარნავალში მაყურებლის ფუნქცია კი არ ჰქონდათ, არამედ ისინი კარნავალში ცხოვრობდნენ',
          'დ' => 'ფერმკრთალდებოდა მიჯნები სოციალურ ფენებს შორის, რითაც კარნავალი ამკვიდრებდა ეგალიტარულ
          საზოგადოებას',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 15,
      'introduction' => 'რა არის ამ ტექსტის ძირითადი მიზანი?',
      'answers' => json_encode(
        [
          'ა' => 'ვენეციის რესპუბლიკაში მთავრობის ლოიალური პოლიტიკის შედეგად ჩამოყალიბებული სოციალური
          ურთიერთობების მიმოხილვა',
          'ბ' => 'ვენეციის რესპუბლიკაში არსებული, ერთი შეხედვით, სტაბილური, თუმცა, რეალურად მყიფე პოლიტიკური და
          სოციალური ვითარების მიმოხილვა',
          'გ' => 'ვენეციური კარნავალის როლის გამოკვეთა სოციალურად ეგალიტარული საზოგადოების ჩამოყალიბების
          თვალსაზრისით',
          'დ' => 'ვენეციის რესპუბლიკის მთავრობის მიერ დაქვემდებარებულ ტერიტორიათა მოსახლეობის მიმხრობის სტრატეგიების
          გამოკვეთა',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 16,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
      ,,დაბალანსებული კონსტიტუცია : პოლიტიკური სტაბილურობა“? (I აბზაცი)',
      'answers' => json_encode(
        [
          'ა' => 'სოციალური კავშირები : კომპრომისი',
          'ბ' => 'ინტერესთა კონფლიქტი : დაპირისპირება',
          'გ' => 'კლასობრივი უთანასწორობა : სოლიდარობა',
          'დ' => 'ეგალიტარული საზოგადოება : დაქვემდებარება',
          'ე' => 'ადმინისტრაციული თანამდებობა : ძალაუფლება',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 17,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
      ,,პრივილეგია : უპირატესობას ანიჭებს“? (II აბზაცი)',
      'answers' => json_encode(
        [
          'ა' => 'ნორმა : აკანონებს',
          'ბ' => 'ნებართვა : ზღუდავს',
          'გ' => 'ალიბი : ბრალს სდებს',
          'დ' => 'ზღვარი : განსაზღვრავს',
          'ე' => 'მანდატი : უფლებამოსილს ხდის',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 18,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
      ,,კარნავალი : სოციალური თანასწორობა“? (III აბზაცი)',
      'answers' => json_encode(
        [
          'ა' => 'მულტიპლიკაცია : მოძრაობის ილუზია',
          'ბ' => 'მირაჟი : რეალური გამოსახულება',
          'გ' => 'კონსილიუმი : შეთანხმება',
          'დ' => 'ბოიკოტი : პროტესტი',
          'ე' => 'რეანიმაცია : კოლაფსი',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 19,
      'introduction' => 'რა მნიშვნელობით არ არის გამოყენებული ტექსტის IV აბზაცში სიტყვა „თეატრალური“?',
      'answers' => json_encode(
        [
          'ა' => 'ირონიული',
          'ბ' => 'სარკასტული',
          'გ' => 'მეტაფორული',
          'დ' => 'არტისტული',
          'ე' => 'დრამატული',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 20,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი გამოთქმა არის ტექსტში მეტაფორული?',
      'answers' => json_encode(
        [
          'ა' => 'თვით ვენეციელები ამ სტაბილურობას მარადიულად მიიჩნევდნენ',
          'ბ' => 'ინტერესთა ამ კონფლიქტში მომწყვდეულებს კომპრომისიღა რჩებოდათ',
          'გ' => 'ნიღბიანი მსახური შეიძლებოდა დოჟად ან სენატორად გამოეცხადებინათ, მასხარა – მეფედ',
          'დ' => 'ხელისუფლება უზრუნველყოფდა მოსახლეობას საკვებით და აწყობდა ნაირგვარ საჯარო რიტუალებს',
          'ე' => 'ვენეციელ მეთევზეებს საკუთარი დოჟის არჩევის უფლება ჰქონდათ',
        ]
      ),
      'correct' => 'ბ',

    ]);




    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 21,
      'introduction' => 'მოცემულია დებულებები:',

      'conditions' => json_encode([
        'თუ ადამიანი რაციონალურია, მაშინ ის ზნეობრივიც არის.',
        'ზოგიერთი ადამიანი ზნეობრივია, მაგრამ არ არის შემწყნარებელი.',
        'არ არსებობს რაციონალური ადამიანი, რომელიც შემწყნარებელი არ არის.',
      ]),
      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად მცდარი, თუ ეს დებულებები ჭეშმარიტია?',
      'answers' => json_encode(
        [
          'ა' => 'თუ ზნეობრივი ადამიანი რაციონალური არ არის, მაშინ ის არც შემწყნარებელია',
          'ბ' => 'თუ ადამიანი შემწყნარებელი არ არის, მაშინ ის არც რაციონალურია',
          'გ' => 'ზოგიერთი არაზნეობრივი ადამიანი შემწყნარებელია',
          'დ' => 'ყველა შემწყნარებელი ადამიანი რაციონალურია',
          'ე' => 'ყველა ზნეობრივი ადამიანი რაციონალურია',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 22,

      'introduction' => 'წყნარი ოკეანის ერთ-ერთი კუნძული ცნობილია უზარმაზარი მონოლითებით, რომლებიც ადგილობრივმა
      მოსახლეობამ ათასობით წლის წინ გამოაქანდაკა. გიგანტურ ქანდაკებებს ურთიერთდაპირისპირებული ტომები ქმნიდნენ.
      მეცნიერები ვარაუდობენ, რომ ქანდაკებების აღმართვის მიზანი მოწინააღმდეგისთვის ძალის დემონსტრირება იყო – რაც
      უფრო დიდ ქანდაკებას აღმართავდა ერთი ტომი, მით უფრო ძლიერად მიიჩნევდნენ მას სხვა ტომები.',

      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი აყენებს ეჭვქვეშ ყველაზე მეტად მეცნიერთა ვარაუდს ქანდაკებების აღმართვის მიზნის
      შესახებ?',
      'answers' => json_encode(
        [
          'ა' => 'ამ კუნძულზე არქეოლოგებმა აღმოაჩინეს საკულტო დანიშნულების ნივთები, რომლებსაც ნიადაგის ნაყოფიერების
          გაზრდის მიზნით ჩატარებული რიტუალებისას იყენებდნენ',
          'ბ' => 'ამ კუნძულის ქანდაკებები განსხვავდება ერთმანეთისგან სიმაღლისა და წონის მიხედვით. ყველაზე დიდი ქანდაკების
          წონა 270 ტონაა, ხოლო სიმაღლე – 20 მეტრი',
          'გ' => 'ამ კუნძულის მკვიდრთა რწმენით, გარდაცვლილთა ქვაში უკვდავყოფა მომავალში მათი შთამომავლების სულთა
          სამყაროში უკეთესი ადგილის დამკვიდრებას უზრუნველყოფდა',
          'დ' => 'ამ კუნძულის ქანდაკებები სანაპირო ხაზის გასწვრივ არის ჩამწკრივებული ისე, რომ ზურგი ზღვისკენ აქვთ მიქცეული,
          ხოლო სახე – კუნძულის შუაგულისკენ',
          'ე' => 'ამ კუნძულის ერთ დროს მრავალრიცხოვანი მოსახლეობა ბუნებრივი რესურსების დეფიციტით განპირობებულმა
          სამოქალაქო ომებმა გაანადგურა',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 23,

      'introduction' => 'მოცემულია სამი დებულება:',

      'conditions' => json_encode([
        'I. არც ერთი მუსიკოსი არ არის კოსმონავტი.',
        'II. ზოგიერთი მუსიკოსი მოფარიკავეა.',
        'III. ზოგიერთი კოსმონავტი არ არის მოფარიკავე.',

      ]),
      'question' => 'ამ დებულებათა შესახებ ქვემოთ წარმოდგენილი მტკიცებებიდან რომელია მართებული?',
      'answers' => json_encode(
        [
          'ა' => 'I-დან და II-დან ერთად შეგვიძლია დავასკვნათ, რომ III ჭეშმარიტია',
          'ბ' => 'II-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ I მცდარია',
          'გ' => 'I-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ II ჭეშმარიტია',
          'დ' => 'I-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ II მცდარია',
          'ე' => 'არც ერთი მათგანი არ გამომდინარეობს დანარჩენი ორიდან',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 24,

      'introduction' => 'ეკამ, მაიამ და ლევანმა წაიკითხეს რამდენიმე სხვადასხვა წიგნი. თითოეულმა მათგანმა წაიკითხა თითო ისეთი წიგნი,
      რომელიც დანარჩენ ორს არ ჰქონდა წაკითხული. ამ სამიდან ყოველმა ორმა წაიკითხა კიდევ თითო წიგნი, რომელიც
      მესამეს არ ჰქონდა წაკითხული. ხოლო ერთი წიგნი სამივემ წაიკითხა. ამასთანავე ცნობილია, რომ:',

      'conditions' => json_encode([
        'ეკას მიერ წაკითხული წიგნებიდან ორი იყო სათავგადასავლო.',
        'მაიას მიერ წაკითხული წიგნებიდან სამი იყო სათავგადასავლო.',
        'ლევანის მიერ წაკითხული წიგნებიდან ოთხი იყო სათავგადასავლო.',

      ]),
      'question' => 'რის ტოლია სამივეს მიერ წაკითხული წიგნების საერთო რაოდენობა და მათ შორის რამდენია სათავგადასავლო ჟანრის?',
      'answers' => json_encode(
        [
          'ა' => '6-ის; 4;',
          'ბ' => '7-ის; 4;',
          'გ' => '7-ის; 5;',
          'დ' => '8-ის; 4;',
          'ე' => '8-ის; 5;',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'logic',
      'number' => 25,

      'introduction' => 'მოცემულია დებულებები:',


      'conditions' => json_encode([
        'ზოგიერთი ნახატი ბაროკოს სტილისაა.',
        'ყველა ბაროკოს სტილის ნახატი ძვირადღირებულია.',
        'ლანის მხოლოდ ბაროკოს სტილის ნახატები მოსწონსს.',

      ]),
      'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი გამომდინარეობს მოცემული დებულებებიდან?',
      'answers' => json_encode(
        [
          'ა' => 'თუ ანის ნახატი მოეწონა, მაშინ ის ძვირადღირებულია',
          'ბ' => 'თუ ნახატი ძვირადღირებულია, ანის ის აუცილებლად მოეწონება',
          'გ' => 'თუ ნახატი ძვირადღირებულია, მაშინ ის ბაროკოს სტილის უნდა იყოს',
          'დ' => 'თუ ნახატი ბაროკოს სტილისაა, ანის ის აუცილებლად მოეწონება',
          'ე' => 'თუ ნახატი ბაროკოს სტილისაა და თან ძვირადღირებულია, ანის ის მოეწონება',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 26,

      'introduction' => 'ხშირად კონფლიქტის მიზეზი ხდება ჩვენი დაშვება, რომ კონკრეტულმა მოვლენამ სხვაშიც ისეთივე გრძნობები უნდა
      გამოიწვიოს, როგორსაც ის ჩვენში აღძრავს, ------ ემოციებს იწვევს ------ ის მნიშვნელობა, რომელსაც ჩვენ მას ვანიჭებთ. ამ
      მნიშვნელობას ------განაპირობებს. პრობლემის მოგვარება იწყება მაშინ, როდესაც ჩვენ მზად ვართ, ------ სხვა ადამიანის
      სუბიექტური სამყარო.',
      'answers' => json_encode(
        [
          'ა' => 'რადგან / ესა თუ ის მოვლენა თავისთავად და არა / ხომ თავად ობიექტური რეალობა/ ვაღიაროთ',
          'ბ' => 'რადგან / ესა თუ ის მოვლენა თავისთავად და არა / ხომ თავად ობიექტური რეალობა / შევცვალოთ',
          'გ' => 'მაგრამ / არა ესა თუ ის მოვლენა თავისთავად, არამედ / კი, თავის მხრივ, სუბიექტური გამოცდილება / ვაღიაროთ',
          'დ' => 'მაგრამ / არა ესა თუ ის მოვლენა თავისთავად, არამედ / კი, თავის მხრივ, სუბიექტური გამოცდილება / შევცვალოთ',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 27,

      'introduction' => 'ისევე, როგორც ყველა მყარ სისტემაში, კულტურაშიც საყრდენი სტრუქტურა მნიშვნელოვნად ზღუდავს
      თავისუფლებას. ------ სისტემის გარდაქმნა სტრუქტურის ------ მოითხოვს. ------ , რადგან სტრუქტურის დემონტაჟსა და
      ხელახლა აგებას ------ .',
      'answers' => json_encode(
        [
          'ა' => 'ამასთან, აქ, სხვა სისტემებისგან განსხვავებით, / დემონტაჟს / ასეთი გარდაქმნები კი შედარებით უმტკივნეულოდ
          წარიმართება / შორის სრული დეზორიენტაციის პერიოდია',
          'ბ' => 'თუმცა, სხვა სისტემებისგან განსხვავებით, აქ / შენარჩუნებას / ეს კი აძნელებს ასეთი გარდაქმნების განხორციელებას /
          ბევრად უფრო დიდი ძალისხმევა სჭირდება',
          'გ' => 'ამიტომ, ისევე, როგორც ყველგან, აქაც / დემონტაჟს / ამას კი უცილობლად თან ახლავს გარკვეული საშიშროება / შორის
          ერთგვარი დეზორიენტაციის პერიოდია',
          'დ' => 'ამის მიუხედავად, აქაც, ისევე, როგორც ყველგან, / შენარჩუნებას / ამით აიხსნება ამ სფეროში გარდაქმნების
          განსაკუთრებული მტკივნეულობა / მეტი ძალისხმევა დასჭირდებოდა',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 28,

      'introduction' => 'ავტორი თავის წიგნს პარადოქსებზე აგებს. მაგალითად, წიგნის ერთ-ერთ თავში ის ამტკიცებს, რომ შუღლი ------
      მშვიდობას, როგორც ამას საღი აზრი მიიჩნევს. ------ , მისი აზრით, შუღლი ------ ფაქტორი, რომელიც ხელს ------
      მშვიდობის დაცვასა და სოციალური ერთიანობის შენარჩუნებას.',
      'answers' => json_encode(
        [
          'ა' => 'არ ემუქრება / მიუხედავად ამისა / არ არის / უშლის',
          'ბ' => 'მართლაც ემუქრება / ამდენად / არის / არ უწყობს',
          'გ' => 'მართლაც ემუქრება / მაშასადამე / არ არის / უშლის',
          'დ' => 'არ ემუქრება / პირიქით / არის / უწყობს',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'fill',
      'number' => 29,

      'introduction' => 'გონიერი ადამიანი -------, უგუნური ------- ცდილობს მოირგოს სამყარო. ------- ყველა ცვლილება, რომელიც სამყაროს
      უკავშირდება, ------- ადამიანზეა დამოკიდებული.',
      'answers' => json_encode(
        [
          'ა' => 'ადაპტირდება სამყაროსთან, ერგება მას / კი, პირიქით, / ამიტომ / უგუნურ',
          'ბ' => 'ადაპტირდება სამყაროსთან, ერგება მას / კი, პირიქით, / მიუხედავად ამისა, / უგუნურ',
          'გ' => 'ადაპტირების პროცესში ცვლის სამყაროს, ასხვაფერებს მას / ადამიანი კი არ / მიუხედავად ამისა, / გონიერ',
          'დ' => 'ადაპტირების პროცესში ცვლის სამყაროს, ასხვაფერებს მას / ადამიანიც, ანალოგიურად, / ამიტომ გასაკვირი როდია,
          რომ / მხოლოდ გონიერ',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 30,
      'introduction' => 'რით დასტურდება, რომ ფრინველთა ფრენის მექანიზმის ჩამოყალიბება უშუალოდ არ უკავშირდება ბუმბულის
      წარმოქმნას?',
      'answers' => json_encode(
        [
          'ა' => 'თეროპოდებს ფრენის უნარი გვერდითი მოვლენის სახით განუვითარდათ, კერძოდ, კიდურების ქნევით წონასწორობის
          დასაცავად',
          'ბ' => 'ბუმბულის წარმოქმნა უკავშირდება თეროპოდების სირბილის დროს სიჩქარის მომატებას და არა ფრენას',
          'გ' => 'ხმელეთის დინოზავრებს ფრენა არ შეეძლოთ, თუმცა, მრავალი მათგანი ბუმბულით იყო შემოსილი',
          'დ' => 'ფრინველები, სავარაუდოდ, თეროპოდების შთამომავლები არიან და თეროპოდებს კი არც ბუმბული ჰქონდათ და არც
          ფრენა შეეძლოთ',
        ]
      ),
      'correct' => 'გ',

    ]);



    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 31,
      'introduction' => 'ფრინველები რომ თეროპოდების შთამომავლები იყვნენ, ამის ილუსტრაცია:',
      'answers' => json_encode(
        [
          'ა' => 'არის არქეოპტერიქსი, რადგან ის გარდამავალი ფორმაა და მასზე აღიბეჭდა ტრანსფორმაციის კვალი:
          რეპტილიებისთვისაც და ფრინველებისთვისაც დამახასიათებელი ნიშნები',
          'ბ' => 'არის არქეოპტერიქსი, მიუხედავად იმისა, რომ მას ფრენა არ შეეძლო და არც დინოზავრებისთვის დამახასიათებელი
          ნიშნები ჰქონდა',
          'გ' => 'არის ანჩიორნისი, რადგან მას ჰქონდა უამრავი ბუმბული − ფრინველებისთვის დამახასიათებელი უმთავრესი ნიშანი,
          მიუხედავად იმისა, რომ მისი ფრთები ფრენისთვის გამოუსადეგარი იყო',
          'დ' => 'არის ანჩიორნისი, მიუხედავად იმისა, რომ მისი ჭარბი შებუმბვლის განმაპირობებელი ფაქტორი იყო ფრენის უნარი
          და არა სქესობრივი გადარჩევა',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 32,
      'introduction' => 'ცნობილია, რომ ბიოლოგ-ევოლუციონისტები სხეულის ძველი ნაწილისთვის ახალი ფუნქციის მინიჭებას უწოდებენ
      ეგზაპტაციას. ქვემოთ ჩამოთვლილთაგან რომელია ეგზაპტაციის მაგალითი?',
      'answers' => json_encode(
        [
          'ა' => 'მაჯის ერთ-ერთი ძვალი, როგორც სხვადასხვა დანიშნულების ფუნქციური ნაწილი სხვადასხვა სახეობის
          ორგანიზმისთვის',
          'ბ' => 'ბუმბული, როგორც თერმოიზოლაციის ერთ-ერთი საშუალება თეროპოდებისა და ფრინველებისთვის',
          'გ' => 'ფრთები, როგორც ფრინველებისთვის მრავალფუნქციური ნაწილი (ხმაურის წარმოქმნა თუ ჩახშობა, ბუდის აშენება,
          წყლის გადატანა...)',
          'დ' => 'თეროპოდების ძვლოვანი კუდი, როგორც ფრინველების ბოლოფრთის წინა სახე',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 33,
      'introduction' => 'ეპიდექსიპტერიქსის ექსტრავაგანტური შებუმბვლა, გარკვეული აზრით, არაპრაქტიკული იყო. ქვემოთ
      ჩამოთვლილთაგან რომელი არ არის ამ დებულების ადეკვატური ახსნა?',

      'answers' => json_encode(
        [
          'ა' => 'ეპიდექსიპტერიქსს ფრთები არ ჰქონდა, მისი ისრისებური, ნაირფერი ბუმბულები კი საფრენად გამოუსადეგარი იყო',
          'ბ' => 'ეპიდექსიპტერიქსს კუდის ნაცვლად ოთხი ისრისებური წვრილი ბუმბული ჰქონდა, რომლებიც ვერ უზრუნველყოფდა
          ცხოველის თერმორეგულაციას',
          'გ' => 'ეპიდექსიპტერიქსი მტრედის ზომის იყო და მასზე ორჯერ უფრო გრძელი ბუმბულები გადაადგილებისას ხელს
          შეუშლიდა',
          'დ' => 'ეპიდექსიპტერიქსს ჭრელი, ზოლებიანი ბუმბულები მეწყვილის მოსაზიდად ჰქონდა',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 34,

      'introduction' => '2013 წელს ჩინეთში აღმოაჩინეს განამარხებული პრეისტორიული ფრთოსანი ცხოველი, რომელიც 160 მილიონი წლის
      წინ ცხოვრობდა. ეს არის ხოხბის ზომის არსება პატარა ფრთებით, ბრჭყალებით და გრძელი კუდით. მას ფრენა არ შეეძლო.
      ახლად აღმოჩენილი არსება ძალიან ჰგავს ფრინველს, მაგრამ ის ჯერ კიდევ არ არის ფრინველი. მას აურორნისი უწოდეს
      (ლათინურად aurora განთიადს ნიშნავს, ძველბერძნულად ornis კი − ფრინველს), ანუ განთიადის, ცისკრის ფრინველი.
      ქვემოთ ჩამოთვლილთაგან რომელი შედარებაა სწორი?',

      'answers' => json_encode(
        [
          'ა' => 'აურორნისს, არქეოპტერიქსის მსგავსად, შენარჩუნებული ჰქონდა რეპტილიური წარსულის კვალი, თუმცა, მისგან
          განსხვავებით, აურორნისს ფრინველთა კლასს არ მიაკუთვნებენ',
          'ბ' => 'აურორნისი, ისევე, როგორც ანჩიორნისი, დინოზავრია, თუმცა ამ უკანასკნელს მისგან ჭარბი შებუმბვლა განასხვავებს',
          'გ' => 'აურორნისს ეპიდექსიპტერიქსთან ბევრი საერთო აქვს: ორივე ერთ პერიოდში ცხოვრობდა, ერთი ზომისანი იყვნენ,
          ფარშავანგისებური ბუმბულები ჰქონდათ',
          'დ' => 'აურორნისი გარკვეულწილად ჰგავს სამივე განამარხებულ ინდივიდს, თუმცა მათ შორის სხვაობა არსებითია −
          აურორნისი თეროპოდი არ არის',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'text',
      'number' => 35,
      'introduction' => 'ქვემოთ წარმოდგენილია ტექსტში განხილულ თემაზე წამოჭრილი რამდენიმე საკითხი. მათგან რომელი არ არის
      საკვანძო ევოლუციური თეორიის თვალსაზრისით?',
      'answers' => json_encode(
        [
          'ა' => 'ფრინველისმაგვარი დინოზავრები და დინოზავრისმაგვარი ფრინველები ერთ პერიოდში თანაარსებობდნენ თუ ჯერ
          თეროპოდები იყვნენ და შემდეგ ფრინველები',
          'ბ' => 'რატომ დაერქვა ეპიდექსიპტერიქსს იურული ფარშავანგი − მხოლოდ გარეგნული მსგავსება არის ამის საფუძველი თუ
          ბოლოფრთის ანალოგიური დანიშნულება',
          'გ' => 'რატომ არის ევოლუციის პროცესი განსაკუთრებით შემოქმედებითი მაშინ, როცა ის რეპროდუქციულ ფუნქციებს
          უკავშირდება',
          'დ' => 'რით შეიძლება აიხსნას გარდამავალი ფორმების ნაირგვარობა (არქეოპტერიქსი, ანჩიორნისი, ეპიდექსიპტერიქსი) −
          სქესობრივი გადარჩევით თუ, ზოგადად, ბუნებრივი გადარჩევით',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 36,
      'introduction' => 'I აბზაცში გამოყენებულია გამოთქმა „დიდია იმის ალბათობა... “ქვემოთ ჩამოთვლილთაგან რომელია ამ გამოთქმის
      ეკვივალენტური?',
      'answers' => json_encode(
        [
          'ა' => 'შესაძლოა, ასე მოხდეს',
          'ბ' => 'უეჭველად ასე უნდა მოხდეს',
          'გ' => 'შეიძლება შემთხვევითი იყოს',
          'დ' => 'სწორედ დამთხვევა უნდა იყოს',
          'ე' => 'მოსალოდნელია, სწორედ ასე მოხდეს',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 37,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში ,,საიდუმლო : გამჟღავნება“?
      ( I აბზაცი)',
      'answers' => json_encode(
        [
          'ა' => 'ჰიპოთეზა : არგუმენტირება',
          'ბ' => 'პრობლემა : გადაჭრა',
          'გ' => 'ესკალაცია : დაძაბვა',
          'დ' => 'აპელაცია : დაცვა',
          'ე' => 'ტერორი : მუქარა',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 38,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელია სხეულის „ფუნქციური ნაწილის“ აუცილებელი მახასიათებელი (III აბზაცი)?',
      'answers' => json_encode(
        [
          'ა' => 'ცვალებადი დანიშნულება',
          'ბ' => 'მრავალგვარი დანიშნულება',
          'გ' => 'განუსაზღვრელი დანიშნულება',
          'დ' => 'რეპროდუქციული დანიშნულება',
          'ე' => 'სპეციფიკური დანიშნულება',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 39,
      'introduction' => 'წყვილში „ექსტრავაგანტური : ორდინარული“ ისეთივე მიმართებაა, როგორიც წყვილში ულტრათანამედროვე :',
      'answers' => json_encode(
        [
          'ა' => 'ნოვატორული',
          'ბ' => 'არქაული',
          'გ' => 'ანტიკვარული',
          'დ' => 'მარადიული',
          'ე' => 'სამომავლო',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'verbal',
      'category' => 'analogy',
      'number' => 40,
      'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი არ არის მეტაფორული?',
      'answers' => json_encode(
        [
          'ა' => 'ევოლუციის პროცესი განსაკუთრებით შემოქმედებითია',
          'ბ' => 'ამ დროს მოხატული ფრთები განსაკუთრებულ როლს ასრულებს',
          'გ' => 'ამდენი ბუმბული ანჩიორნისისთვის მძიმე ტვირთი უნდა ყოფილიყო',
          'დ' => 'ევოლუციის მამოძრავებელი ძალა, შესაძლოა, სქესობრივი გადარჩევაც იყო',
          'ე' => 'სხვადასხვა ფრინველი ფრთებს ხმაურის გამოსაწვევად ან ჩასახშობად იყენებს',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 41,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',
      'image' => env('IMAGE_URL') . '/images/general-version-3-41.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 42,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
      'image' => env('IMAGE_URL') . '/images/general-version-3-42.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 43,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
      'image' => env('IMAGE_URL') . '/images/general-version-3-43.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 44,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
      'image' => env('IMAGE_URL') . '/images/general-version-3-44.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 45,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
      'image' => env('IMAGE_URL') . '/images/general-version-3-45.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 46,
      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
      'image' => env('IMAGE_URL') . '/images/general-version-3-46.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 47,

      'introduction' => 'კომპანიამ რვა მილიონ ლარად ავტომანქანები შეიძინა. თითოეულ ავტომანქანაში ოცი ათასი ლარი გადაიხადა.
      რამდენი ავტომანქანა შეუძენია კომპანიას?',



      'answers' => json_encode(
        [
          'ა' => '40',
          'ბ' => '50',
          'გ' => '400',
          'დ' => '500',
          'ე' => '4000',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 48,

      'introduction' => 'თუ 2𝑥 − 3𝑦 = 9 და 𝑥 + 4𝑦 = −1, მაშინ 3𝑥 + 𝑦 =',

      'answers' => json_encode(
        [
          'ა' => '-2',
          'ბ' => '-4',
          'გ' => '4',
          'დ' => '6',
          'ე' => '8',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 49,

      'introduction' => 'მართკუთხა საკოორდინატო სიბრტყეზე მოცემულია მართკუთხა
      სამკუთხედი, რომლის კათეტები საკოორდინატო ღერძების პარალელურია (იხ.
      ნახაზი). რის ტოლია ამ სამკუთხედის მართი კუთხის წვეროს კოორდინატები, თუ
      მახვილი კუთხეების წვეროების კოორდინატებია (3; 5) და (8; 2)?',
      'image' => env('IMAGE_URL') . '/images/general-version-3-49.png',
      'answers' => json_encode(
        [
          'ა' => '(6; 4)',
          'ბ' => '(3; 8)',
          'გ' => '(5; 3)',
          'დ' => '(8; 5)',
          'ე' => '(10; 6)',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 50,

      'introduction' => 'სამ უჯრაში, რომელთაგან არც ერთი არაა ცარიელი, სულ 9 ცალი წიგნი აწყვია. ყველაზე ნაკლები რაოდენობის წიგნი
      პირველ უჯრაშია, ყველაზე მეტი – მესამე უჯრაში. ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს წიგნების
      რაოდენობა მეორე უჯრაში?',

      'answers' => json_encode(
        [
          'ა' => '1-ის',
          'ბ' => '2-ის',
          'გ' => '4-ის',
          'დ' => '5-ის',
          'ე' => '6-ის',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 51,

      'introduction' => 'ქვემოთ ჩამოთვლილი რიცხვებიდან რომელი შეიძლება წარმოვადგინოთ 2𝑘 + 1 სახით, სადაც k ნატურალური
      რიცხვია?',

      'answers' => json_encode(
        [
          'ა' => '7',
          'ბ' => '21',
          'გ' => '33',
          'დ' => '41',
          'ე' => '63',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'analysis',
      'number' => 52,


      'introduction' => 'A, B, C და D წერტილები ერთ წრფეზე მდებარეობს (იხ. ნახაზი).
      AC მონაკვეთის სიგრძეა 15 სმ, BD მონაკვეთისა – 19 სმ, ხოლო AD
      მონაკვეთისა – 27 სმ. რის ტოლია BC მონაკვეთის სიგრძე?',

      'image' => env('IMAGE_URL') . '/images/general-version-3-52.png',
      'answers' => json_encode(
        [
          'ა' => '4 სმ-ის',
          'ბ' => '7 სმ-ის',
          'გ' => '8 სმ-ის',
          'დ' => '9 სმ-ის',
          'ე' => '12 სმ-ის',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'analysis',
      'number' => 53,

      'introduction' => 'მაიას, სანდროს, ელენეს და ვაჟას ერთნაირი ხელფასი აქვთ. ოთხივე მათგანი ამ დაწესებულებაში მუშაობს.
      ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს სანდროს ასაკი?',

      'answers' => json_encode(
        [
          'ა' => '56 წლის',
          'ბ' => '58 წლის',
          'გ' => '60 წლის',
          'დ' => '62 წლის',
          'ე' => '64 წლის',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'analysis',
      'number' => 54,

      'introduction' => 'რის ტოლია დაწესებულებაში მომუშავე იმ თანამშრომელთა საშუალო ხელფასი, რომელთა ასაკი 30 წელზე
      ნაკლებია?',

      'answers' => json_encode(
        [
          'ა' => '750 ლარის',
          'ბ' => '800 ლარის',
          'გ' => '850 ლარის',
          'დ' => '900 ლარის',
          'ე' => '950 ლარის',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'analysis',
      'number' => 55,

      'introduction' => 'დათო, თორნიკე და ზურაბი ამ დაწესებულებაში მუშაობენ. მათგან ყველაზე უმცროსია დათო, ყველაზე
      უფროსი თორნიკე. დათოს ხელფასი როგორც თორნიკეს, ისე ზურაბის ხელფასზე 1000 ლარით ნაკლებია.
      რამდენი წლით უფროსია ზურაბი დათოზე?',

      'answers' => json_encode(
        [
          'ა' => '26',
          'ბ' => '28',
          'გ' => '30',
          'დ' => '32',
          'ე' => '34',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 56,

      'introduction' => 'ქვემოთ ჩამოთვლილი წილადებიდან რომელია უმცირესი?',

      'answers' => json_encode(
        [
          'ა' => '7/8',
          'ბ' => '5/6',
          'გ' => '3/4',
          'დ' => '30/50',
          'ე' => '333/444',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 57,

      'introduction' => 'ერთ კალათაში 4-ით ნაკლები კაკალია, ვიდრე მეორეში. რამდენი კაკალია მეორე კალათაში, თუ ორივეში ერთად
      კაკლების რაოდენობა n-ის ტოლია?',

      'answers' => json_encode(
        [
          'ა' => 'n/2-4',
          'ბ' => 'n/2+4',
          'გ' => '(n-4)/2',
          'დ' => '(m+4)/2',
          'ე' => '(2n-4)/2',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 58,

      'introduction' => 'კასრში m ლიტრი ღვინო იყო. ზაზას მხოლოდ 7-ლიტრიანი და 8-ლიტრიანი ჭურჭლები აქვს. მან
      კასრიდან გადმოღებული ღვინით რამდენიმე ჭურჭელი შეავსო. ამის შემდეგ კასრში 50 ლიტრი ღვინო
      დარჩა. ჩამოთვლილთაგან რომლის ტოლი არ შეიძლება იყოს m ?',


      'answers' => json_encode(
        [
          'ა' => '65-ის',
          'ბ' => '72-ის',
          'გ' => '73-ის',
          'დ' => '80-ის',
          'ე' => '83-ის',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 59,

      'introduction' => 'რის ტოლია კვადრატის მეზობელი გვერდების შუაწერტილებისა და ორი
      მოპირდაპირე წვეროს შეერთებით მიღებული გამუქებული ოთხკუთხედის (იხ.
      ნახაზი) ფართობი, თუ კვადრატის ფართობი 28 სმ2-ის ტოლია?',

      'image' => env('IMAGE_URL') . '/images/general-version-3-59.png',

      'answers' => json_encode(
        [
          'ა' => '12 სმ2-ის',
          'ბ' => '14 სმ2-ის',
          'გ' => '16 სმ2-ის',
          'დ' => '18 სმ2-ის',
          'ე' => '20 სმ2-ის',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 60,

      'introduction' => 'ნატურალური რიცხვის როგორც 6-ზე, ასევე 8-ზე გაყოფისას მიღებული ნაშთი 4-ის ტოლია. ჩამოთვლილთაგან
      რომლის ტოლი შეიძლება იყოს ამავე რიცხვის 48-ზე გაყოფისას მიღებული ნაშთი?',

      'answers' => json_encode(
        [
          'ა' => '12-ის',
          'ბ' => '16-ის',
          'გ' => '20-ის',
          'დ' => '22-ის',
          'ე' => '28-ის',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 61,

      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

      'image' => env('IMAGE_URL') . '/images/general-version-3-61.png',


      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 62,

      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

      'image' => env('IMAGE_URL') . '/images/general-version-3-62.png',

      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 63,

      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',
      'image' => env('IMAGE_URL') . '/images/general-version-3-63.png',

      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 64,

      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

      'image' => env('IMAGE_URL') . '/images/general-version-3-64.png',

      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'compare',
      'number' => 65,

      'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

      'image' => env('IMAGE_URL') . '/images/general-version-3-65.png',
      'answers' => json_encode(
        [
          'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
          'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 66,

      'introduction' => 'ჯგუფში ვაჟების რაოდენობა 1-ით ნაკლებია გოგონების რაოდენობაზე. ჩამოთვლილთაგან რომლის ტოლი
      შეიძლება იყოს ჯგუფში გოგონების პროცენტული წილი?',

      'answers' => json_encode(
        [
          'ა' => '50%-ის',
          'ბ' => '60%-ის',
          'გ' => '70%-ის',
          'დ' => '80%-ის',
          'ე' => '90%-ის',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 67,

      'introduction' => 'თუ 𝑎/𝑎+𝑏 = 3 , მაშინ 𝑏/𝑎+𝑏 =',

      'answers' => json_encode(
        [
          'ა' => '−2',
          'ბ' => '-1',
          'გ' => '0',
          'დ' => '1',
          'ე' => '2',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 68,

      'introduction' => 'მართკუთხედიდან, რომლის სიგრძეა 14 სმ, ხოლო სიგანე – 4 სმ,
      ამოკვეთილია სამი ტოლი წრე. მაქსიმუმ რის ტოლი შეიძლება იყოს ამ
      წრეების ფართობთა ჯამი?',
      'image' => env('IMAGE_URL') . '/images/general-version-3-68.png',


      'answers' => json_encode(
        [
          'ა' => '9𝜋 სმ2-ის',
          'ბ' => '10𝜋 სმ2-ის',
          'გ' => '11𝜋 სმ2-ის',
          'დ' => '12𝜋 სმ2-ის',
          'ე' => '13𝜋 სმ2-ის',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 69,

      'introduction' => 'რამდენიმე ნატურალური რიცხვის ნამრავლი 420-ის ტოლია. ჩამოთვლილთაგან რომლის ტოლი არ შეიძლება იყოს ამ
      რიცხვებიდან რომელიმე 2-ის ჯამი?',

      'answers' => json_encode(
        [
          'ა' => '14-ის',
          'ბ' => '12-ის',
          'გ' => '11-ის',
          'დ' => '10-ის',
          'ე' => '8-ის',
        ]
      ),
      'correct' => 'ა',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 70,

      'introduction' => '𝑎, 𝑏, 𝑐 მიმდევრობის პირველი წევრი ნატურალური რიცხვია, ყოველი მომდევნო წევრი კი წინა წევრზე 5-ით მეტია.
      ჩამოთვლილთაგან რომელია მართებული?',

      'conditions' => json_encode([
        'I. 𝑐 − 𝑎 = 15.',
        'II. 𝑎 ∙ 𝑏 ∙ 𝑐 ლუწი რიცხვია.',
        'III. (𝑎+𝑏+𝑐)/3 ნატურალური რიცხვია.',
      ]),

      'answers' => json_encode(
        [
          'ა' => 'მხოლოდ I',
          'ბ' => 'მხოლოდ I და III',
          'გ' => 'მხოლოდ II და III',
          'დ' => 'მხოლოდ I და II',
          'ე' => 'I, II და III',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 71,

      'introduction' => '𝑥 და 𝑦 ნულისგან განსხვავებული რიცხვებია. მოცემულია ორი პირობა:',
      'conditions' => json_encode([
        'I. 𝑥/𝑦 < 0',
        'II. 𝑥 − 𝑦 > 0.',
      ]),
      'question' => 'იმის გასარკვევად, 𝑥𝑦 მეტია თუ არა (−1)-ზე:',


      'answers' => json_encode(
        [
          'ა' => 'I პირობა საკმარისია, II კი – არა',
          'ბ' => 'II პირობა საკმარისია, I კი – არა',
          'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
          'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
          'ე' => 'მოცემული პირობები არ არის საკმარისი',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 72,

      'introduction' => 'ვაჟას სახლიდან სპორტდარბაზში მისვლა და უკან დაბრუნება ორი გზით შეუძლია, რომელთაგან ერთი უფრო
      გრძელია. მოცემულია ორი პირობა:',
      'conditions' => json_encode([
        'I. თუ ვაჟა სახლიდან სკოლაში გრძელი გზით წავა და უკანაც იმავე გზით დაბრუნდება, მას სულ 980 მეტრის გავლა
        მოუწევს',
        'II. თუ ვაჟა სახლიდან სპორტდარბაზში გრძელი გზით წავა, უკან კი მოკლე გზით დაბრუნდება, მას სულ 860 მეტრის
        გავლა მოუწევს',
      ]),
      'question' => 'იმის გასარკვევად, თუ რის ტოლია ვაჟას სახლიდან სპორტდარბაზამდე მისასვლელი მოკლე გზის სიგრძე:',


      'answers' => json_encode(
        [
          'ა' => 'I პირობა საკმარისია, II კი – არა',
          'ბ' => 'II პირობა საკმარისია, I კი – არა',
          'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
          'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
          'ე' => 'მოცემული პირობები არ არის საკმარისი',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 73,

      'introduction' => '𝑏 რიცხვია.
            მოცემულია ორი პირობა:',
      'conditions' => json_encode([
        'I. 2𝑏 − 5 = 0',
        'II. (𝑏 − 5)2 = 𝑏2',
      ]),
      'question' => 'იმის გასარკვევად, თუ რის ტოლია 𝑏:',


      'answers' => json_encode(
        [
          'ა' => 'I პირობა საკმარისია, II კი – არა',
          'ბ' => 'II პირობა საკმარისია, I კი – არა',
          'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
          'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
          'ე' => 'მოცემული პირობები არ არის საკმარისი',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 74,

      'introduction' => 'ABCD მართკუთხედია.
            მოცემულია ორი პირობა:',
      'conditions' => json_encode([
        'I. ABCD მართკუთხედის დიდი გვერდის სიგრძე 3-ჯერ მეტია მცირე გვერდის სიგრძეზე',
        'II. ABCD მართკუთხედის პერიმეტრი 8-ჯერ მეტია მცირე გვერდის სიგრძეზე',
      ]),
      'question' => 'იმის გასარკვევად, თუ რის ტოლია ABCD მართკუთხედის პერიმეტრი:',


      'answers' => json_encode(
        [
          'ა' => 'I პირობა საკმარისია, II კი – არა',
          'ბ' => 'II პირობა საკმარისია, I კი – არა',
          'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
          'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
          'ე' => 'მოცემული პირობები არ არის საკმარისი',
        ]
      ),
      'correct' => 'ე',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 75,

      'introduction' => 'x და y დადებითი რიცხვებია',
      'conditions' => json_encode([
        'I. 4𝑥-ისა და 𝑦-ის საშუალო არითმეტიკული 9-ის ტოლია',
        'II. 3𝑥-ისა და 3𝑦-ის საშუალო არითმეტიკული 9-ის ტოლია',
      ]),
      'question' => 'იმის გასარკვევად, რის ტოლია x-ისა და y-ის საშუალო არითმეტიკული:',


      'answers' => json_encode(
        [
          'ა' => 'I პირობა საკმარისია, II კი – არა',
          'ბ' => 'II პირობა საკმარისია, I კი – არა',
          'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
          'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
          'ე' => 'მოცემული პირობები არ არის საკმარისი',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 76,

      'introduction' => 'კუბისგან მართკუთხა პარალელეპიპედის ჩამოჭრით მიღებული სხეულის
      ზომები მითითებულია ნახაზზე:',

      'question' => 'რამდენი კუბური სანტიმეტრია ამ სხეულის მოცულობა?',

      'image' => env('IMAGE_URL') . '/images/general-version-3-76.png',



      'answers' => json_encode(
        [
          'ა' => '54',
          'ბ' => '56',
          'გ' => '58',
          'დ' => '60',
          'ე' => '62',
        ]
      ),
      'correct' => 'ბ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 77,

      'introduction' => 'თემურს ანასთან შედარებით 20%-ით ნაკლები ხელფასი აქვს. რამდენი პროცენტით მეტი ხელფასი აქვს ანას
      თემურთან შედარებით?',


      'answers' => json_encode(
        [
          'ა' => '15%-ით',
          'ბ' => '20%-ით',
          'გ' => '25%-ით',
          'დ' => '30%-ით',
          'ე' => '35%-ით',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 78,

      'introduction' => 'ციფრებით 2, 3, 7 და 8 ჩაწერეს ყველა შესაძლო კენტი სამნიშნა რიცხვი ისე, რომ თითოეული რიცხვის ჩანაწერში
      სამივე ციფრი ერთმანეთისგან განსხვავებული იყო. სულ რამდენი რიცხვი ჩაუწერიათ?',


      'answers' => json_encode(
        [
          'ა' => '6',
          'ბ' => '8',
          'გ' => '12',
          'დ' => '18',
          'ე' => '24',
        ]
      ),
      'correct' => 'გ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 79,

      'introduction' => 'მართკუთხედი დაყოფილია მართკუთხედად და ექვსკუთხედად, რომლის
      ზოგიერთი გვერდის სიგრძე ნახაზზეა მითითებული. ექვსკუთხედის ფართობია 10 სმ2.
      რის ტოლია ამ ექვსკუთხედის პერიმეტრი?',

      'image' => env('IMAGE_URL') . '/images/general-version-3-79.png',



      'answers' => json_encode(
        [
          'ა' => '8 სმ-ის',
          'ბ' => '10 სმ-ის',
          'გ' => '12 სმ-ის',
          'დ' => '14 სმ-ის',
          'ე' => '16 სმ-ის',
        ]
      ),
      'correct' => 'დ',

    ]);
    DB::table('tests')->insert([
      'test_type_id' => TestType::find(3)['id'],
      'type' => 'mathematical',
      'category' => 'tasks',
      'number' => 80,

      'introduction' => 'ნებისმიერი ნატურალური x რიცხვისთვის -ით აღნიშნულია ისეთი ოპერაცია, რომ:',

      'question' => 'ნატურალური რიცხვი a არაა 3-ის ჯერადი. რის ტოლია 𝑎∗, თუ (𝑎∗)∗ = 𝑎 ?',
      'conditions' => json_encode([
        '𝑥∗ = 𝑥/5 , თუ x არის 5-ის ჯერადი.',
        '𝑥∗ = 𝑥 + 8, თუ x არაა 5-ის ჯერადი.',
      ]),

      'answers' => json_encode(
        [
          'ა' => '12-ის',
          'ბ' => '10-ის',
          'გ' => '8-ის',
          'დ' => '6-ის',
          'ე' => '4-ის',
        ]
      ),
      'correct' => 'ბ',

    ]);
  }
}
