<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\TestType;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;

class TestTwoSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 1,
            'introduction' => 'საერთაშორისო ჟიურიში ოთხი წევრია: დავითი, მაიკლი, თეონა და ანა. თითოეულმა მათგანმა დანარჩენი სამიდან
            ერთ-ერთი დაასახელა ჟიურის თავმჯდომარედ. ცნობილია, რომ:',

            'conditions' => json_encode([
                'ანამ დაასახელა დავითი.',
                'ჟიურის ორმა წევრმა დაასახელა თეონა.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია შეუძლებელი?',
            'answers' => json_encode(
                [
                    'ა' => 'თეონამ დაასახელა ანა',
                    'ბ' => 'მაიკლმა დაასახელა თეონა',
                    'გ' => 'დავითმა დაასახელა თეონა',
                    'დ' => 'თეონამ დაასახელა დავითი',
                    'ე' => 'დავითმა დაასახელა მაიკლი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 2,

            'introduction' => 'შენობაზე ერთ მწკრივად ოთხი სხვადასხვა ქვეყნის თითო დროშა კიდია: ნეპალის, კამერუნის, ისლანდიისა და დანიის
            (არა აუცილებლად ამ თანმიმდევრობით), ცნობილია:',

            'conditions' => json_encode([
                'ნეპალის დროშა არ არის მწკრივის კიდეში.',
                'ყველაზე დიდი დროშა უშუალოდ დანიის დროშის მარჯვნივ კიდია.',
                'კამერუნისა და ნეპალის დროშებს შორის ერთი დროშა კიდია.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია შესაძლებელი?',
            'answers' => json_encode(
                [
                    'ა' => 'ნეპალის დროშა ყველაზე დიდია',
                    'ბ' => 'ისლანდიის დროშა ყველაზე დიდია',
                    'გ' => 'კამერუნის დროშა არ არის მწკრივის კიდეში',
                    'დ' => 'ნეპალის დროშა დანიის დროშის გვერდით არ კიდია',
                    'ე' => 'დანიის დროშა უშუალოდ ისლანდიის დროშის გვერდითაა',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 3,

            'introduction' => 'მოცემულია სამი დებულება:',

            'conditions' => json_encode([
                'ყველა ინჟინერი სპორტსმენია.',
                'ყველა ფილოსოფოსი სპორტსმენია.',
                'არც ერთი ინჟინერი არ არის ფილოსოფოსი.',

            ]),
            'question' => 'თუ ეს დებულებები ჭეშმარიტია, მაშინ ქვემოთ ჩამოთვლილთაგან რომელი არ შეიძლება იყოს ჭეშმარიტი?',
            'answers' => json_encode(
                [
                    'ა' => 'ზოგიერთი არაფილოსოფოსი ინჟინერია',
                    'ბ' => 'ზოგიერთი არასპორტსმენი ფილოსოფოსია',
                    'გ' => 'ზოგიერთი არასპორტსმენი არ არის ინჟინერი',
                    'დ' => 'ზოგიერთი არაინჟინერი არ არის ფილოსოფოსი',
                    'ე' => 'ზოგიერთი არასპორტსმენი არ არის ფილოსოფოსი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 4,

            'introduction' => 'მოცემულია:',

            'conditions' => json_encode([
                'პანტომიმის თეატრის დასის მხოლოდ ზოგიერთი წევრია პროფესიონალი მოცეკვავე.',
                'გიორგიმ დაასკვნა: მაშასადამე, ამ დასის ზოგიერთი წევრი ფიზიკურად ძლიერია',


            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი უნდა აერჩია გიორგის მეორე წანამძღვრად, რომ ამგვარი დასკვნა გამოეტანა?',
            'answers' => json_encode(
                [
                    'ა' => 'არსებობენ პროფესიონალი მოცეკვავეები, რომლებიც ფიზიკურად ძლიერები არიან',
                    'ბ' => 'ზოგიერთი ფიზიკურად ძლიერი ადამიანი არის პროფესიონალი მოცეკვავე',
                    'გ' => 'ზოგიერთი პროფესიონალი მოცეკვავე არ არის ფიზიკურად ძლიერი',
                    'დ' => 'ზოგიერთი პროფესიონალი მოცეკვავე ფიზიკურად ძლიერია',
                    'ე' => 'ყველა პროფესიონალი მოცეკვავე ფიზიკურად ძლიერია',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 5,

            'introduction' => 'აღდგომის კუნძული, იგივე რაპანუი, ცნობილია უზარმაზარი მონოლითებით, რომლებიც ადგილობრივმა
            მოსახლეობამ ათასობით წლის წინ გამოაქანდაკა. გიგანტურ ქანდაკებებს ურთიერთდაპირისპირებული ტომები
            ქმნიდნენ. მეცნიერები ვარაუდობენ, რომ ქანდაკებების აღმართვის მიზანი მოწინააღმდეგისთვის ძალის დემონსტრირება
            იყო – რაც უფრო დიდ ქანდაკებას აღმართავდა ერთი ტომი, მით უფრო ძლიერად მიიჩნევდნენ მას სხვა ტომები',
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი აყენებს ეჭვქვეშ ყველაზე მეტად მეცნიერთა ვარაუდს ქანდაკებების აღმართვის
            მიზნის შესახებ?',
            'answers' => json_encode(
                [
                    'ა' => 'რაპანუიზე არქეოლოგებმა აღმოაჩინეს საკულტო დანიშნულების ნივთები, რომლებსაც ნიადაგის ნაყოფიერების
                    გაზრდის მიზნით ჩატარებული რიტუალებისას იყენებდნენ',
                    'ბ' => 'რაპანუის ქანდაკებები განსხვავდება ერთმანეთისგან სიმაღლისა და წონის მიხედვით. ყველაზე დიდი ქანდაკების წონა
                    270 ტონაა, ხოლო სიმაღლე – 20 მეტრი',
                    'გ' => 'რაპანუის ერთ დროს მრავალრიცხოვანი მოსახლეობა ბუნებრივი რესურსების დეფიციტით განპირობებულმა
                    სამოქალაქო ომებმა გაანადგურა',
                    'დ' => 'რაპანუის ქანდაკებები სანაპირო ხაზის გასწვრივ არის ჩამწკრივებული ისე, რომ ზურგი ზღვისკენ აქვთ მიქცეული,
                    ხოლო სახე – კუნძულის შუაგულისკენ',
                    'ე' => 'რაპანუის მკვიდრთა რწმენით, გარდაცვლილთა ქვაში უკვდავყოფა მომავალში მათი შთამომავლების სულთა
                    სამყაროში უკეთესი ადგილის დამკვიდრებას უზრუნველყოფდა',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 6,

            'introduction' => '------- მოთხოვნილებები უდევს საფუძვლად. ------- , მათ შორის ------- განსხვავებაა: ცხოველის მოთხოვნილებათა
            ბუნება და წრე ------- არის განსაზღვრული ცოცხალი ორგანიზმის ბიოლოგიური თავისებურებებით. ხოლო ადამიანი
            ისტორიული არსებაა და მისი მოთხოვნილებები, სოციალურ ურთიერთობათა ------- .',
            'answers' => json_encode(
                [
                    'ა' => 'როგორც ადამიანის, ისე ცხოველის ქცევას / მიუხედავად ამისა / მაინც დიდი / ერთხელ და სამუდამოდ / განვითარების
                    კვალდაკვალ, განუწყვეტელი გარდაქმნის პროცესშია',
                    'ბ' => 'ადამიანისა და ცხოველის ქცევას სხვადასხვა ტიპის / მიუხედავად ამისა / მაინც უმნიშვნელო / მხოლოდ ნაწილობრივ/
                    განვითარების კვალდაკვალ, განუწყვეტელი გარდაქმნის პროცესშია',
                    'გ' => 'როგორც ადამიანის, ისე ცხოველის ქცევას / შესაბამისად / მხოლოდ უმნიშვნელო / არასოდეს არ / ცვალებადობის
                    მიუხედავად, არსებითად უცვლელი რჩება',
                    'დ' => 'ადამიანისა და ცხოველის ქცევას სხვადასხვა ტიპის / შესაბამისად / მნიშვნელოვანი / ერთხელ და სამუდამოდ /
                    ცვალებადობის მიუხედავად, არსებითად უცვლელი რჩება',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 7,

            'introduction' => ' თუკი მეცნიერს საკვლევი საკითხის მიმართ ემოციური დამოკიდებულება ------ , მის მიერ ამ საკითხის კვლევა ------ .
            ფიქრი და მსჯელობა იმაზე, რაც გაბრაზებს, გაშინებს ან, პირიქით, მოგწონს, შესასწავლი საკითხისადმი ------ გამო,
            კვლევის ობიექტურობას ------ .',
            'answers' => json_encode(
                [
                    'ა' => 'არ აქვს / არ არის საუკეთესო არჩევანი / ემოციური დისტანციის ნაკლებობის / მეტ დამაჯერებლობას მატებს',
                    'ბ' => ' აქვს / არ არის საუკეთესო არჩევანი/ ემოციური დისტანციის ნაკლებობის / რისკის ქვეშ აყენებს',
                    'გ' => 'აქვს / საუკეთესო არჩევანია / დიდი ემოციური დისტანციის / მეტ დამაჯერებლობას მატებს',
                    'დ' => 'არ აქვს / საუკეთესო არჩევანია / დიდი ემოციური დისტანციის / რისკის ქვეშ აყენებს',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 8,

            'introduction' => 'ინდივიდუალისტურ და კოლექტივისტურ საზოგადოებებში განსხვავებული დამოკიდებულებაა დიპლომის მიმართ.
            ინდივიდუალისტურ საზოგადოებაში დიპლომი ------ . კოლექტივისტურ საზოგადოებაში კი ის ------ – დიპლომის
            ფლობასთან დაკავშირებული სოციალური დამოკიდებულება უფრო ------ , ვიდრე საგნის ცოდნის შედეგად
            წარმოქმნილი თვითპატივისცემა. ამიტომ კოლექტივისტურ საზოგადოებაში დიპლომების ------ ',
            'answers' => json_encode(
                [
                    'ა' => 'მფლობელისათვის უფრო მაღალი სტატუსის მქონე ჯგუფის წევრებთან კავშირის საშუალებას იძლევა / მფლობელის
                    თვითპატივისცემას ამაღლებს / ნაკლებად მნიშვნელოვანია / არაკეთილსინდისიერი გზით მოპოვების უფრო დიდი
                    ცდუნებაა',
                    'ბ' => 'მფლობელის თვითპატივისცემას ამაღლებს / მფლობელისათვის უფრო მაღალი სტატუსის მქონე ჯგუფის წევრებთან
                    კავშირის საშუალებას იძლევა / მნიშვნელოვანია / არაკეთილსინდისიერი გზით მოპოვების უფრო დიდი ცდუნებაა',
                    'გ' => 'მფლობელის თვითპატივისცემას ამაღლებს / მფლობელისათვის უფრო მაღალი სტატუსის მქონე ჯგუფის წევრებთან
                    კავშირის საშუალებას იძლევა / მნიშვნელოვანია / კეთილსინდისიერი გზით მოპოვების მეტი მოტივაცია არსებობს',
                    'დ' => 'მფლობელისათვის უფრო მაღალი სტატუსის მქონე ჯგუფის წევრებთან კავშირის საშუალებას იძლევა / მფლობელის
                    თვითპატივისცემას ამაღლებს / ნაკლებად მნიშვნელოვანია / კეთილსინდისიერი გზით მოპოვების ნაკლები მოტივაცია
                    არსებობს',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 9,

            'introduction' => '------- პოლიტიკოსებს, რომლებიც ეროვნული ღირებულებების ------- გვპირდებიან. ეს ღირებულებები ფაქტად -------
            აღვიქვათ, -------. ქცევების სწრაფი ცვლილებების მიუხედავად, საზოგადოების ბაზისური ღირებულებები ------- .',
            'answers' => json_encode(
                [
                    'ა' => ' არასდროს ენდოთ / შეცვლას / უნდა / ისევე, როგორც, მაგალითად, ქვეყნის გეოგრაფიული მდებარეობა / სტაბილურია',
                    'ბ' => 'გონივრულია, ვენდოთ / შეცვლას / არ უნდა / განსხვავებით ქვეყნის გეოგრაფიული მდებარეობისგან / სტაბილურია',
                    'გ' => 'გონივრულია, ვენდოთ / შენარჩუნებას / უნდა / ისევე, როგორც, მაგალითად, ქვეყნის გეოგრაფიული მდებარეობა /
                    შეიძლება შეიცვალოს',
                    'დ' => 'არასდროს ენდოთ / შენარჩუნებას / არ უნდა / განსხვავებით ქვეყნის გეოგრაფიული მდებარეობისგან / სტაბილურია',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 10,
            'introduction' => 'XVI-XVII საუკუნეების ვენეციის მკვიდრნი რესპუბლიკაში არსებულ პოლიტიკურ და სოციალურ სტაბილურობას
            ხსნიდნენ კონსტიტუციით',
            'answers' => json_encode(
                [
                    'ა' => 'რომელიც ორიენტირებული იყო დემოკრატიული პრინციპების დაცვაზე',
                    'ბ' => 'რომელიც მიზნად ისახავდა საზოგადოების ყოველი წევრის ინტერესების დაცვას',
                    'გ' => 'რომელიც თითქოსდა ითვალისწინებდა სხვადასხვა სოციალური ფენის ინტერესებს',
                    'დ' => 'რომელშიც წარმოდგენილი იყო როგორც წარჩინებულთა, ისე მდაბიოთა ინტერესები',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 11,
            'introduction' => 'კქვემოთ ჩამოთვლილთაგან რომელს ვერ გამოვიყენებთ სოციალური კავშირების შენარჩუნების მაგალითად?',
            'answers' => json_encode(
                [
                    'ა' => 'წვრილი არისტოკრატები მოქმედებდნენ პატრონაჟის ინტერესების დაცვით, ეს ინტერესები კი თითოეულ მათგანს
                    რომელიმე „გრანდისთან“ აკავშირებდა',
                    'ბ' => 'დიდი საბჭოს გარეთ დარჩენილი ე. წ. მოქალაქეები (2000-3000 მამაკაცი) იკავებდნენ ადმინისტრაციულ
                    თანამდებობებს, მათ ქალიშვილებს კი ცოლად ირთავდნენ წარჩინებულები',
                    'გ' => 'დიდებულებს, რომლებიც პრაქტიკულად მართავდნენ ვენეციას და რომელთაც ემორჩილებოდნენ წვრილი
                    არისტოკრატები, ხელთ ეპყრათ უმთავრესი პოლიტიკური დაწესებულებების გასაღებები',
                    'დ' => 'გარკვეული პრივილეგიები, მაგ., ადმინისტრაციული თანამდებობები, აგრძნობინებდა მოქალაქეებს, რომ ისინი
                    წარჩინებულთაგან დიდად არ განსხვავდებოდნენ',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 12,
            'introduction' => 'გთავაზობთ ინფორმაციას ძველ რომაულ დღესასწაულზე:
            ძველ რომში მიწათმოქმედების, ნაყოფიერების ღვთაებად მიიჩნევდნენ სატურნუსს. მის პატივსაცემად გამართულ
            დღესასწაულებს სატურნალიები ეწოდებოდა. მთელი კვირა ქალაქში საზეიმო განწყობა სუფევდა. იმართებოდა ლხინი. ამ
            დღეებში მოსახლეობა თავისუფლდებოდა ყოველგვარი მოვალეობისგან. მოწაფეებს არ სჯიდნენ არასათანადო
            საქციელისთვის. არც მსჯავრდებულები ისჯებოდნენ. იმპერატორი მონაწილეებს საჩუქრებს ურიგებდა. მონები
            თავისუფლებად ითვლებოდნენ. მეტიც, მათ თავიანთი ბატონები ემსახურებოდნენ. სატურნალიებისა და ვენეციური კარნავალის შედარების საფუძველზე შეიძლება დავასკვნათ:',
            'answers' => json_encode(
                [
                    'ა' => 'ორივე დღესასწაულის ძირითადი შინაარსი რელიგიური იყო: სატურნალიები მიწათმოქმედების ღვთაებას
                    განადიდებდა, კარნავალი კი მომავალი აღდგომის დღესასწაულს ეძღვნებოდა',
                    'ბ' => 'ორივე დღესასწაულზე პურითა და სანახაობით, როლების გაცვლითა და რიტუალებით იქმნებოდა ჰარმონიული
                    ურთიერთობების ილუზია',
                    'გ' => 'ორივე დღესასწაულზე თავისუფლდებოდნენ მსჯავრდებულები; იმ დღეებში არავის მოეთხოვებოდა პასუხი ჩადენილი
                    დანაშაულისთვის',
                    'დ' => 'ორივე დღესასწაული კიცხავდა სამყაროს არასრულყოფილებას და, ამავე დროს, მხიარული ემოციებით ცდილობდა
                    სამყაროს რეალური სურათის შექმნას',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 13,
            'introduction' => 'რა ფუნქცია აქვს ტექსტისთვის მეთევზეთა დოჟისა და ჩრდილო იტალიის ქალაქების ეპიზოდებს? (IV აბზაცი)',
            'question' => 'ორივე ეპიზოდი ამყარებს იმ მოსაზრებას, რომ:',
            'answers' => json_encode(
                [
                    'ა' => 'ვენეციისა და მის დაქვემდებარებულ ტერიტორიათა მოსახლეობის ცხოვრება ერთგვარად თეატრალიზებული იყო',
                    'ბ' => 'ვენეციასა და ჩრდილო იტალიის ქალაქებში როგორც დაბალი სოციალური ფენა, ისე პატრიციები მოტყუებულნი
                    რჩებოდნენ, რადგან აქტიური პოლიტიკური სისტემიდან გამოდევნილნი იყვნენ',
                    'გ' => 'ვენეციასა და მის ირგვლივ არსებულ ქალაქებში საზოგადოების ყოველი წევრი ეგალიტარული, თანასწორუფლებიანი
                    იყო',
                    'დ' => 'ვენეციასა და მის მიმდებარე ქალაქებში სოციალური სისტემის სტაბილურობა ემყარებოდა ძალაუფლებათა ერთგვარ
                    წონასწორობას',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 14,
            'introduction' => 'გადმოცემის თანახმად, 1794 წელს ნაპოლეონ ბონაპარტემ იტალიის დაპყრობა გადაწყვიტა. მან ვენეციის რესპუბლიკას
            ომი გამოუცხადა. თავისუფლების სანაცვლოდ სენატმა ნაპოლეონს ფული შესთავაზა, მაგრამ უარი მიიღო. სენატორები
            შეშინდნენ და ხელისუფლება მიატოვეს. მაშინდელმა დოჟმა კი, მხიარულმა ლუდოვიკო მანინმა, გვირგვინი თავიდან
            მოიძრო, ლაქიას გადაუგდო და დაუძახა: „აჰა, დაიჭირე, აღარ დამჭირდება!“ 1797 წლის 15 მაისს ნაპოლეონის ჯარები
            ვენეციაში შევიდნენ.',
            'question' => 'ტექსტის III აბზაცის რომელი წინადადების ილუსტრაციად შეიძლება განვიხილოთ ლუდოვიკო მანინის ეს ქმედება?',
            'answers' => json_encode(
                [
                    'ა' => 'კარნავალი შლიდა ყველანაირ ზღვარს, აკრძალვას, ნორმას, პრივილეგიას',
                    'ბ' => 'ჩვეულებრივ დღეებშიც ბევრი ირგებდა ნიღაბს, თითქოს ვენეციის მთელი ცხოვრებაც კარნავალი იყო',
                    'გ' => 'ვენეციელებს კარნავალში მაყურებლის ფუნქცია კი არ ჰქონდათ, არამედ ისინი კარნავალში ცხოვრობდნენ',
                    'დ' => 'ფერმკრთალდებოდა მიჯნები სოციალურ ფენებს შორის, რითაც კარნავალი ამკვიდრებდა ეგალიტარულ
                    საზოგადოებას',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 15,
            'introduction' => 'იტალიის ისტორიის მკვლევრებმა დაამკვიდრეს ტერმინი „ვენეციის მითი“. ქვემოთ ჩამოთვლილთაგან რომელი ხსნის
            მართებულად ამ ტერმინის არსს?',
            'answers' => json_encode(
                [
                    'ა' => 'ეს ტერმინი „დაბალანსებული კონსტიტუციის“ ეკვივალენტურია',
                    'ბ' => 'ეს ტერმინი იმავე შინაარსს გულისხმობს, რასაც – რომაული გამოთქმა: „პური და სანახაობა“',
                    'გ' => 'ამ ტერმინით აღნიშნავენ პოლიტიკური სისტემის ხანმოკლეობას, ანუ მიანიშნებენ ვენეციის რესპუბლიკის გაუქმებაზე',
                    'დ' => 'ამ ტერმინით მიანიშნებენ სტაბილურ, დაბალანსებულ საზოგადოებაზე, თუმცა, გულისხმობენ, რომ ამგვარი
                    წარმოდგენა ყალბია',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 16,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
            ,,დაბალანსებული კონსტიტუცია : პოლიტიკური სტაბილურობა“? (I აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'სოციალური კავშირები : კომპრომისი',
                    'ბ' => 'ინტერესთა კონფლიქტი : დაპირისპირება',
                    'გ' => 'კლასობრივი უთანასწორობა : სოლიდარობა',
                    'დ' => 'ეგალიტარული საზოგადოება : დაქვემდებარება',
                    'ე' => 'ადმინისტრაციული თანამდებობა : ძალაუფლება',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 17,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
            ,,პრივილეგია : უპირატესობას ანიჭებს“? (II აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ნორმა : აკანონებს',
                    'ბ' => 'ნებართვა : ზღუდავს',
                    'გ' => 'ალიბი : ბრალს სდებს',
                    'დ' => 'ზღვარი : განსაზღვრავს',
                    'ე' => 'მანდატი : უფლებამოსილს ხდის',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 18,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში – ,,კარნავალი : ნიღაბი“?
            (III აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'პრემიერა : აფიშა',
                    'ბ' => 'ბრიფინგი : საშვი',
                    'გ' => 'ფესტივალი : პრიზი',
                    'დ' => 'კორონაცია : გვირგვინი',
                    'ე' => 'პრეზენტაცია : სლაიდი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 19,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
            ,,გროტესკი : ტრაგიკომიკური“? (III აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'იუმორი : ცინიკური',
                    'ბ' => 'ირონია : გამკიცხავი',
                    'გ' => 'იგავი : ალეგორიული',
                    'დ' => 'სარკაზმი : აგრესიული',
                    'ე' => 'ფანტასტიკა : შთამბეჭდავი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 20,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი გამოთქმა არ არის ტექსტში მეტაფორული?',
            'answers' => json_encode(
                [
                    'ა' => 'ნიღაბი მნიშვნელოვან სოციალურ როლს ასრულებდა',
                    'ბ' => 'ფერმკრთალდებოდა მიჯნები სოციალურ ფენებს შორის',
                    'გ' => 'ხელთ ეპყრათ პოლიტიკური დაწესებულებების გასაღებები',
                    'დ' => 'ინტერესთა ამ კონფლიქტში მომწყვდეულებს კომპრომისიღა რჩებოდათ',
                    'ე' => 'ზოგი ადმინისტრაციული თანამდებობა მხოლოდ მოქალაქეებისთვის იყო გათვალისწინებული',
                ]
            ),
            'correct' => 'ე',

        ]);







        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 21,
            'introduction' => 'მოცემულია დებულებები:',

            'conditions' => json_encode([
                'თუ ადამიანი გონიერია, მაშინ ის კეთილიც არის.',
                'ზოგიერთი ადამიანი კეთილია, მაგრამ არ არის წინდახედული.',
                'არ არსებობს გონიერი ადამიანი, რომელიც წინდახედული არ არის.',
            ]),
            'question' => 'თუ ეს დებულებები ჭეშმარიტია, მაშინ ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად მცდარი?',
            'answers' => json_encode(
                [
                    'ა' => 'ყველა კეთილი ადამიანი გონიერია',
                    'ბ' => 'ყველა წინდახედული ადამიანი გონიერია',
                    'გ' => 'თუ ადამიანი წინდახედული არ არის, მაშინ ის არც გონიერია',
                    'დ' => 'ზოგიერთი ადამიანი, რომელიც არ არის კეთილი, წინდახედულია',
                    'ე' => 'თუ კეთილი ადამიანი გონიერი არ არის, მაშინ ის არ არის წინდახედული',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 22,

            'introduction' => 'მეცნიერებმა დაადგინეს, რომ როცა მცენარეებს საფრთხე ემუქრებათ, ისინი იყენებენ ერთგვარ „ენას“, რომლითაც
            სახიფათო მტაცებლის შესახებ სხვა მცენარეებსაც აფრთხილებენ.',

            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განამტკიცებს ყველაზე მეტად მეცნიერთა ამ დასკვნას?',
            'answers' => json_encode(
                [
                    'ა' => 'ზოგიერთი მცენარე მასზე მავნებლების თავდასხმისას გამოყოფს სურნელოვან ნივთიერებას. ეს ნივთიერება იზიდავს
                    იმ მწერებს, რომლებიც ამ მცენარის ფოთლებზე არსებული პარაზიტებით იკვებებიან',
                    'ბ' => 'ზოგიერთ მცენარეში პერიოდულად აქტიურდება ნივთიერებები, რომლებიც მავნებლებს უზღუდავს მონელების
                    უნარს. ეს განსაკუთრებით მაშინ ხდება, როცა ახლომდებარე მცენარეს პარაზიტები შემოესევიან',
                    'გ' => 'ცხოველების ორგანიზმში ტკივილის შესახებ ინფორმაცია იმავე ნივთიერებებით ვრცელდება, რომლებიც მცენარის
                    დაზიანების შემთხვევაში მის დაუზიანებელ ნაწილში თავდაცვითი რეაქციების გააქტიურებას უზრუნველყოფს',
                    'დ' => 'ზოგიერთი მცენარის ფოთლის დაზიანებისას გამოიყოფა ნივთიერება გლუტამატი, რომელიც უზრუნველყოფს
                    მცენარის დანარჩენ დაუზიანებელ ნაწილებში თავდაცვითი რეაქციების გააქტიურებას',
                    'ე' => 'ყვავილოვანი მცენარეები მწერების როგორც მისაზიდად, ისე დასაფრთხობად გამოყოფენ ქიმიურ ნივთიერებებს, იმავე
                    ნივთიერებებს გამოყოფენ მწერებიც. ამ ნივთიერებებს მწერებში სასიგნალო ფუნქციაც აქვს',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 23,

            'introduction' => 'მოცემულია სამი დებულება:',

            'conditions' => json_encode([
                'I. არც ერთი მათემატიკოსი არ არის მოთხილამურე.',
                'II. ზოგიერთი მათემატიკოსი მელომანია.',
                'III. ზოგიერთი მოთხილამურე არ არის მელომანი.',

            ]),
            'question' => 'ამ დებულებათა შესახებ ქვემოთ წარმოდგენილი მტკიცებებიდან რომელია მართებული?',
            'answers' => json_encode(
                [
                    'ა' => 'I-დან და II-დან ერთად შეგვიძლია დავასკვნათ, რომ III ჭეშმარიტია',
                    'ბ' => 'I-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ II ჭეშმარიტია',
                    'გ' => 'II-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ I მცდარია',
                    'დ' => 'I-დან და III-დან ერთად შეგვიძლია დავასკვნათ, რომ II მცდარია',
                    'ე' => 'არც ერთი მათგანი არ გამომდინარეობს დანარჩენი ორიდან',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 24,

            'introduction' => 'ნინომ, ანამ და გიორგიმ ნახეს რამდენიმე სხვადასხვა ფილმი. თითოეულმა მათგანმა ნახა თითო ისეთი ფილმი,
            რომელიც დანარჩენ ორს არ ჰქონდა ნანახი. ამ სამიდან ყოველმა ორმა ნახა კიდევ თითო ფილმი, რომელიც მესამეს არ
            ჰქონდა ნანახი. ხოლო ერთი ფილმი სამივემ ნახა. ამასთანავე ცნობილია, რომ:',

            'conditions' => json_encode([
                'ნინოს მიერ ნანახი ფილმებიდან ორი იყო სათავგადასავლო.',
                'ანას მიერ ნანახი ფილმებიდან სამი იყო სათავგადასავლო.',
                'გიორგის მიერ ნანახი ფილმებიდან ოთხი იყო სათავგადასავლო.',

            ]),
            'question' => 'რის ტოლია სამივეს მიერ ნანახი ფილმების საერთო რაოდენობა და მათ შორის რამდენია სათავგადასავლო ჟანრის?',
            'answers' => json_encode(
                [
                    'ა' => '6-ის; 4;',
                    'ბ' => '7-ის; 4;',
                    'გ' => '7-ის; 5;',
                    'დ' => '8-ის; 4;',
                    'ე' => '8-ის; 5;',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 25,

            'introduction' => 'მოცემულია დებულებები:',


            'conditions' => json_encode([
                'ზოგიერთი ფილმი კომედიური ჟანრისაა.',
                'ყველა ფილმი, რომელიც კომედიური ჟანრისაა, სასიამოვნო საყურებელია.',
                'ლაშას მხოლოდ კომედიური ჟანრის ფილმები მოსწონს.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი გამომდინარეობს მოცემული დებულებებიდან?',
            'answers' => json_encode(
                [
                    'ა' => 'თუ ფილმი კომედიური ჟანრისაა და საყურებლადაც სასიამოვნოა, ის ლაშას მოეწონება',
                    'ბ' => 'თუ ფილმი სასიამოვნო საყურებელია, ლაშას ის აუცილებლად მოეწონება',
                    'გ' => 'თუ ფილმი სასიამოვნო საყურებელია, ის კომედიური ჟანრის უნდა იყოს',
                    'დ' => 'თუ ფილმი კომედიური ჟანრისაა, ლაშას ის აუცილებლად მოეწონება',
                    'ე' => 'თუ ლაშას ფილმი მოსწონს, ის სასიამოვნო საყურებელია',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 26,

            'introduction' => 'ხშირად კონფლიქტის მიზეზი ხდება ჩვენი დაშვება, რომ კონკრეტულმა მოვლენამ სხვაშიც ისეთივე გრძნობები უნდა
            გამოიწვიოს, როგორსაც ის ჩვენში აღძრავს, ------ ემოციებს იწვევს ------ ის მნიშვნელობა, რომელსაც ჩვენ მას ვანიჭებთ. ამ
            მნიშვნელობას ------განაპირობებს. პრობლემის მოგვარება იწყება მაშინ, როდესაც ჩვენ მზად ვართ, ------ სხვა ადამიანის
            სუბიექტური სამყარო.',
            'answers' => json_encode(
                [
                    'ა' => 'რადგან / ესა თუ ის მოვლენა თავისთავად და არა / ხომ თავად ობიექტური რეალობა/ ვაღიაროთ',
                    'ბ' => 'რადგან / ესა თუ ის მოვლენა თავისთავად და არა / ხომ თავად ობიექტური რეალობა / შევცვალოთ',
                    'გ' => 'მაგრამ / არა ესა თუ ის მოვლენა თავისთავად, არამედ / კი, თავის მხრივ, სუბიექტური გამოცდილება / ვაღიაროთ',
                    'დ' => 'მაგრამ / არა ესა თუ ის მოვლენა თავისთავად, არამედ / კი, თავის მხრივ, სუბიექტური გამოცდილება / შევცვალოთ',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 27,

            'introduction' => 'ნაციონალიზმის ერთ-ერთი მკვლევარი მიიჩნევს, რომ ადამიანები ------ , როცა ეს ------ ინტერესებს აკმაყოფილებს.
            ------ , ამ ვითარებაში ------ , თუ რატომ იღებენ ხოლმე ადამიანები ხანდახან ეთნიკური ჯგუფისთვის ------ , მაგრამ
            მათთვის პირადად ------ გადაწყვეტილებებს.',
            'answers' => json_encode(
                [
                    'ა' => 'ჯგუფებს მხოლოდ იმ შემთხვევაში არ ქმნიან / მათ პირად / შესაბამისად / გასაგებია / გამოუსადეგარ / მომგებიან',
                    'ბ' => 'ჯგუფებს ქმნიან და ჯგუფურ მოქმედებებში მონაწილეობენ მხოლოდ მაშინ / საერთო / შესაბამისად / გასაგებია /
                    გამოუსადეგარ / მომგებიან',
                    'გ' => 'ჯგუფებს ქმნიან და ჯგუფურ მოქმედებებში მონაწილეობენ მხოლოდ მაშინ / საერთო / თუმცა / გაუგებარი რჩება /
                    სასარგებლო/ სრულიად უსარგებლო',
                    'დ' => 'ჯგუფებს ქმნიან და ჯგუფურ მოქმედებებში მონაწილეობენ მხოლოდ მაშინ / მათ პირად / თუმცა / გაუგებარი რჩება /
                    სასარგებლო / სრულიად უსარგებლო',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 28,

            'introduction' => 'ანტიფემინიზმის არსებობის ფაქტზე ყურადღების გამახვილება ----- გადაწყვეტილებაა, ----- ამ ფენომენის საგანგებო
            მსჯელობის საგნად ქცევა ------ . ხომ არ ვიღებთ ამით ვალდებულებას, ვაღიაროთ ანტიფემინიზმი, როგორც შესაძლო
            პოზიცია ან ცხოვრების სტილი? ------ , არც ისე ახალი ლოზუნგი ამბობს: არსებობას გამართლება ------ .',
            'answers' => json_encode(
                [
                    'ა' => 'საჭირო / რადგან / მის ლეგიტიმაციას უშლის ხელს / ანალოგიურად / სჭირდება',
                    'ბ' => 'საჭირო / მაგრამ / მისი ლეგიტიმაციის რისკს შეიცავს / ანალოგიურად / სჭირდება',
                    'გ' => 'საკმაოდ სარისკო / რადგან / მისი ლეგიტიმაციის რისკს შეიცავს / თუმცა / არ სჭირდება',
                    'დ' => 'საკმაოდ სარისკო / მაგრამ / მის ლეგიტიმაციას უშლის ხელს / თუმცა / არ სჭირდება',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 29,

            'introduction' => 'გონიერი ადამიანი -------, უგუნური ------- ცდილობს მოირგოს სამყარო. ------- ყველა ცვლილება, რომელიც სამყაროს
            უკავშირდება, ------- ადამიანზეა დამოკიდებული.',
            'answers' => json_encode(
                [
                    'ა' => 'ადაპტირდება სამყაროსთან, ერგება მას / კი, პირიქით, / ამიტომ / უგუნურ',
                    'ბ' => 'ადაპტირდება სამყაროსთან, ერგება მას / კი, პირიქით, / მიუხედავად ამისა, / უგუნურ',
                    'გ' => 'ადაპტირების პროცესში ცვლის სამყაროს, ასხვაფერებს მას / ადამიანი კი არ / მიუხედავად ამისა, / გონიერ',
                    'დ' => 'ადაპტირების პროცესში ცვლის სამყაროს, ასხვაფერებს მას / ადამიანიც, ანალოგიურად, / ამიტომ გასაკვირი როდია,
                    რომ / მხოლოდ გონიერ',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 30,
            'introduction' => 'არქეოპტერიქსის აღმოჩენა დარვინის თეორიისთვის უძლიერესი მტკიცებულება აღმოჩნდა, რადგან ის:',
            'answers' => json_encode(
                [
                    'ა' => 'ბუმბულის ევოლუციის ილუსტრაციას წარმოადგენდა',
                    'ბ' => 'ტიპური რეპტილია იყო − ძვლოვანი კუდითა და ბუმბულით დაფარული სხეულით',
                    'გ' => 'უძველესი იყო მანამდე აღმოჩენილ ევოლუციური მეტამორფოზების ნიმუშებს შორის',
                    'დ' => 'როგორც ქვეწარმავლების, ისე ფრინველების ნიშნებს ინარჩუნებდა − გარდამავალი საფეხურის ილუსტრაცია იყო',
                ]
            ),
            'correct' => 'დ',

        ]);



        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 31,
            'introduction' => 'ქვემოთ მოცემულია წინადადებები I აბზაციდან. მათგან უშუალოდ რომელში არ ჩანს ევოლუციური
            მეტამორფოზების რიგში დაფიქსირებული კრიტიკული მომენტი?',
            'answers' => json_encode(
                [
                    'ა' => '„გერმანიაში ყვავის ზომის ნამარხი ფრინველი იპოვეს, რომელიც დაახლოებით 150 მილიონი წლის წინ ცხოვრობდა“',
                    'ბ' => 'არქეოპტერიქსს „ბუმბული და ფრინველისთვის დამახასიათებელი სხვა ნიშნები ჰქონდა, თუმცა, რეპტილიური
                    წარსულის კვალიც ეტყობოდა“',
                    'გ' => '„ეს ცვლილება (ქერცლის განვითარების შედეგად ბუმბულის წარმოქმნა) ფრენისთვის აუცილებელი ადაპტაცია იყო...
                    ბუმბულის ევოლუცია ფრენის ევოლუციასთან ერთად მოხდა“',
                    'დ' => '„პროტოფრინველებს წინა კიდურები ფრთებად ექცათ, რამაც ეს არსებები პლანერივით მოძრავი ცხოველებიდან
                    ნამდვილ ფრინველებად აქცია“',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 32,
            'introduction' => 'რომელი შეხედულება დააყენა ეჭვქვეშ სინოზაუროპტერიქსის აღმოჩენამ?',
            'answers' => json_encode(
                [
                    'ა' => 'ფრინველების წინაპრები პატარა, ოთხფეხა ქერცლიანი ქვეწარმავლები იყვნენ და ხეებზე დახტოდნენ',
                    'ბ' => 'რეპტილიების ქერცლის გადაქცევა ბუმბულის ნაირსახეობებად ფრენისთვის აუცილებელი ადაპტაცია იყო',
                    'გ' => 'თეროპოდები ხმელეთის დინოზავრები იყვნენ, მიუხედავად იმისა, რომ მათსა და ფრინველების ჩონჩხებს შორის
                    საოცარი მსგავსებაა',
                    'დ' => 'თეროპოდებს თხელი, პრიმიტიული ბუმბულით ჰქონდათ დაფარული სხეული, რაც თერმოიზოლაციის ფუნქციაზე
                    უნდა მიგვანიშნებდეს',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 33,
            'introduction' => 'ტექსტში წამოჭრილია საკითხი − პროტოფრინველები მიწიდან აფრინდნენ თუ ხეებიდან ჩამოფრინდნენ? რომელი
            ვერსიის სასარგებლოდ არის მოყვანილი კენ დაიალის სიტყვები?',

            'answers' => json_encode(
                [
                    'ა' => 'არც ერთის − ბარტყის ფრთები რუდიმენტულია და მას მხოლოდ მოძრაობის სიჩქარის გაზრდაში ეხმარება',
                    'ბ' => 'მიწიდან აფრინდნენ − შებუმბლულმა დინოზავრებმა სირბილის დროს კიდურების ქნევით დაიწყეს მაღლა აფრენა',
                    'გ' => 'ხეებიდან ჩამოფრინდნენ − პროტოფრინველებს ბუმბული აძლევდა პლანირებისა და ხიდან ხეზე გადახტომის
                    საშუალებას',
                    'დ' => 'ორივესი − როგორც ციცაბოზე ასვლის, ისე სიმაღლიდან დაშვების პროცესში ბარტყის ფრთების ფუნქციის
                    ჩამოყალიბება ფრინველის ევოლუციის პროცესს ერთგვარად „იმეორებს“',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 34,

            'introduction' => 'ცნობილია, რომ ფრინველების, დინოზავრებისა და პტეროზავრების (მფრინავი ხვლიკების) უახლოესი დღეს
            არსებული ნათესავები ნიანგები არიან. ალიგატორებში (ერთგვარი ნიანგები) აღმოაჩინეს იგივე გენი, რომელიც
            ფრინველის ბუმბულის ჩამოყალიბებაში მონაწილეობს. ეს გვაფიქრებინებს, რომ 250 მილიონი წლის წინ მათ ბუმბული
            ჰქონდათ.
            ქვემოთ მოცემულია სამი შეკითხვა. მათგან რომელია საკვანძო ევოლუციური თეორიის თვალსაზრისით?',

            'conditions' => json_encode([
                'I – როგორ წარმოექმნათ ფრინველებს ბუმბული და როგორ დაკარგეს ის ალიგატორის წინაპრებმა?',
                'II – ბუმბულის საწყისი ფუნქცია პტეროზავრებისთვის (მფრინავი ხვლიკებისთვის) თერმოიზოლაცია იყო თუ ფრენისთვის
                აუცილებელი ადაპტაცია?',
                'III – როგორ აღმოაჩინეს ალიგატორებში სწორედ ის გენი, რომელიც ბუმბულის წარმოქმნას განსაზღვრავს?',

            ]),
            'answers' => json_encode(
                [
                    'ა' => 'I და II',
                    'ბ' => 'II და III',
                    'გ' => 'მხოლოდ II',
                    'დ' => 'მხოლოდ III',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 35,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ მოსაზრებას აყენებს ეჭვქვეშ ტექსტის ბოლო წინადადებაში მოცემული დასკვნა?',
            'answers' => json_encode(
                [
                    'ა' => 'რეპტილიების ქერცლის ტრანსფორმირება მოხდა თეროპოდების ბუმბულად, ბუმბულის ჩამოყალიბებამ კი
                    განაპირობა ფრენის უნარის განვითარება',
                    'ბ' => 'ბუმბულის წარმოშობა არ უკავშირდება ფრენის დაწყებას; ბუმბულის საწყის ფუნქციას თერმოიზოლაცია
                    წარმოადგენდა',
                    'გ' => 'თეროპოდების სხვადასხვა ევოლუციურ საფეხურზე ბუმბულის ნაირსახეობები განვითარდა და ბოჭკომ ევოლუცია
                    განიცადა',
                    'დ' => 'ფრინველებს მსუბუქი ლულოვანი ძვლები და სპეციფიკური სასუნთქი სისტემა აქვთ; ფრთების მოძრაობას
                    სპეციალური კუნთები განსაზღვრავს',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 36,
            'introduction' => 'წყვილში ,,მეტამორფოზა : ტრანსფორმაცია“ ისეთივე მიმართებაა, როგორიც წყვილში „სისტემატიზაცია“: ( I აბზაცი )',
            'answers' => json_encode(
                [
                    'ა' => 'კონსტატაცია',
                    'ბ' => 'დეტალიზაცია',
                    'გ' => 'ოპტიმიზაცია',
                    'დ' => 'კლასიფიკაცია',
                    'ე' => 'რეკონსტრუქცია',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 37,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომლით შეიძლება ჩავანაცვლოთ ტექსტში სიტყვა „პროტოფრინველები“? (I აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'განამარხებული ფრინველები',
                    'ბ' => 'ადაპტირებული ფრინველები',
                    'გ' => 'ადრეული ფრინველები',
                    'დ' => 'ფრინველთა სახეობები',
                    'ე' => 'ფრინველთა ნაშიერები',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 38,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში –
            ,,ბუმბული : თერმოიზოლაცია“? (II აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ეკალი : ჩხვლეტა',
                    'ბ' => 'ხორთუმი : თავდასხმა',
                    'გ' => 'ფესვები : საკვების შეწოვა',
                    'დ' => 'ფრთები : წონასწორობის დაცვა',
                    'ე' => 'თვალები : სივრცეში ორიენტაცია',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 39,
            'introduction' => 'სიტყვა „რუდიმენტული“ აღნიშნავს ორგანოს, რომელსაც ორგანიზმის ისტორიული განვითარების პროცესში
            დაკარგული აქვს თავისი პირვანდელი მნიშვნელობა. რა მნიშვნელობით არის გამოყენებული ეს სიტყვა ტექსტის IV
            აბზაცში?',
            'answers' => json_encode(
                [
                    'ა' => 'მომცრო',
                    'ბ' => 'უმნიშვნელო',
                    'გ' => 'თავდაპირველი',
                    'დ' => 'განუვითარებელი',
                    'ე' => 'ფუნქციადაკარგული',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(2)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 40,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც წყვილში – ,,ლულოვანი : ლულა“?
            (V აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'წიგნიერი : წიგნი',
                    'ბ' => 'ანბანური : ანბანი',
                    'გ' => 'წვეთოვანი : წვეთი',
                    'დ' => 'კანონიერი : კანონი',
                    'ე' => 'ლურსმული : ლურსმანი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 41,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',
            'image' => env('IMAGE_URL') . '/images/general-version-1-41.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 42,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-42.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 43,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-43.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 44,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-44.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 45,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-45.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 46,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-46.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 47,

            'introduction' => 'a ნებისმიერი ნატურალური რიცხვია, b – მისი მომდევნო ნატურალური რიცხვია, c კი b-ს მომდევნო
            ნატურალური რიცხვია. მოცემულია სამი წინადადება:',


            'conditions' => json_encode([
                'I. a, b და c რიცხვებიდან რომელიმე ორის ჯამი ლუწია.',
                'II. a, b და c რიცხვებიდან რომელიმე ორი ლუწია.',
                'III. a, b და c რიცხვებიდან რომელიმე ორი კენტია.',

            ]),
            'question' => 'ამ წინადადებებიდან მართებულია:',
            'answers' => json_encode(
                [
                    'ა' => 'მხოლოდ I',
                    'ბ' => 'მხოლოდ II',
                    'გ' => 'მხოლოდ III',
                    'დ' => 'I და II',
                    'ე' => 'II და III',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 48,

            'introduction' => 'უჯრედებიან ბადეზე, რომლის თითოეული უჯრედი კვადრატია,
            მონიშნულია A და B წერტილები. ეს წერტილები ერთმანეთთან შეერთებულია
            ორი ტეხილით, რომელთა წვეროები ბადის კვანძებს ემთხვევა (იხ. ნახაზი). A და B
            წერტილების შემაერთებელი გრძელი ტეხილის სიგრძეა 180 მ. რამდენი მეტრია ამ
            წერტილების შემაერთებელი მოკლე ტეხილის სიგრძე?',

            'image' => env('IMAGE_URL') . '/images/general-version-1-48.png',
            'answers' => json_encode(
                [
                    'ა' => '80',
                    'ბ' => '90',
                    'გ' => '100',
                    'დ' => '110',
                    'ე' => '120',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 49,

            'introduction' => 'სულ რამდენი განსხვავებულციფრებიანი კენტი სამნიშნა რიცხვი შეიძლება ჩავწეროთ ციფრებით 2, 4, 7 და 8?',

            'answers' => json_encode(
                [
                    'ა' => '6',
                    'ბ' => '8',
                    'გ' => '12',
                    'დ' => '16',
                    'ე' => '24',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 50,

            'introduction' => 'კუბი დაყოფილია 8 ტოლ მართკუთხა პარალელეპიპედად, რომელთაგან
            თითოეულის უმცირესი წიბოს სიგრძე 2 სმ-ია',
            'question' => 'რამდენი კუბური სანტიმეტრია დაყოფის შედეგად მიღებული თითოეული
            მართკუთხა პარალელეპიპედის მოცულობა?',

            'image' => env('IMAGE_URL') . '/images/general-version-1-50.png',
            'answers' => json_encode(
                [
                    'ა' => '16',
                    'ბ' => '32',
                    'გ' => '48',
                    'დ' => '64',
                    'ე' => '96',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 51,

            'introduction' => 'ორნიშნა რიცხვი 2-ჯერ მეტია მისი ციფრების ჯამზე. რის ტოლია ამ ციფრების ნამრავლი?',

            'answers' => json_encode(
                [
                    'ა' => '2-ის',
                    'ბ' => '4-ის',
                    'გ' => '6-ის',
                    'დ' => '8-ის',
                    'ე' => '10',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 52,

            'introduction' => 'სულ რამდენმა სტუდენტმა აირჩია უმაღლეს საგანმანათლებლო დაწესებულებებში ჯანდაცვისა და სოციალური
            უზრუნველყოფის პროგრამები?',

            'answers' => json_encode(
                [
                    'ა' => '5 ათასმა',
                    'ბ' => '10 ათასმა',
                    'გ' => '15 ათასმა',
                    'დ' => '20 ათასმა',
                    'ე' => '25 ათასმა',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 53,

            'introduction' => 'მდედრობითი სქესის რამდენმა სტუდენტმა აირჩია უმაღლეს საგანმანათლებლო დაწესებულებებში განათლების,
            ჰუმანიტარული მეცნიერებებისა და ხელოვნების პროგრამები?',

            'answers' => json_encode(
                [
                    'ა' => '5 ათასმა',
                    'ბ' => '6 ათასმა',
                    'გ' => '7 ათასმა',
                    'დ' => '8 ათასმა',
                    'ე' => '9 ათასმა',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 54,

            'introduction' => 'რომელი საგანმანათლებლო პროგრამის შემთხვევაში იყო მდედრობითი სქესის სტუდენტთა რაოდენობა 1,5-ჯერ
            ნაკლები მამრობითი სქესის სტუდენტთა რაოდენობაზე?',

            'answers' => json_encode(
                [
                    'ა' => 'განათლების, ჰუმანიტარული მეცნიერებებისა და ხელოვნების',
                    'ბ' => 'ჯანდაცვისა და სოციალური უზრუნველყოფის',
                    'გ' => 'სოციალური მეცნიერებების, ბიზნესისა და სამართლის',
                    'დ' => 'სოფლის მეურნეობის',
                    'ე' => 'ზუსტი და საბუნებისმეტყველო მეცნიერებების',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 55,

            'introduction' => 'სტუდენტთა საერთო რაოდენობის რამდენი პროცენტია მამრობითი სქესის იმ სტუდენტთა რაოდენობა,
            რომლებმაც აირჩიეს საგანმანათლებლო პროგრამა „საინჟინრო, დამამუშავებელი და სამშენებლო დარგები“?',

            'answers' => json_encode(
                [
                    'ა' => '10%',
                    'ბ' => '12%',
                    'გ' => '14%',
                    'დ' => '16%',
                    'ე' => '18%',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 56,

            'introduction' => 'ქვემოთ ჩამოთვლილი წილადებიდან რომელია უდიდესი?',

            'answers' => json_encode(
                [
                    'ა' => '2/3',
                    'ბ' => '3/4',
                    'გ' => '4/5',
                    'დ' => '5/6',
                    'ე' => '7/8',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 57,

            'introduction' => 'თუ (𝑎 + 𝑏)2 = 𝑎2 + 𝑏2, მაშინ:',

            'answers' => json_encode(
                [
                    'ა' => '𝑎 + 𝑏 = 0',
                    'ბ' => '𝑎 − 𝑏 = 0',
                    'გ' => '𝑎𝑏 = 0',
                    'დ' => '𝑎 = 0',
                    'ე' => '𝑏 = 0',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 58,

            'introduction' => 'მართკუთხა საკოორდინატო სიბრტყეზე მოცემულია 𝑂𝑀𝑁 მართკუთხა სამკუთხედი,
            რომლის 𝑂 წვერო კოორდინატთა სათავეს ემთხვევა, 𝑂𝑀 კათეტი 𝑥-ღერძზე მდებარეობს,
            ხოლო 𝑁 წვეროს კოორდინატებია (4; 4).',
            'question' => '𝐴(3; 2), 𝐵(2; 3) და 𝐶(5; 1) წერტილებიდან რომელი ეკუთვნის მოცემულ
            სამკუთხედს?',
            'image' => env('IMAGE_URL') . '/images/general-version-1-58.png',

            'answers' => json_encode(
                [
                    'ა' => 'მხოლოდ 𝐴',
                    'ბ' => 'მხოლოდ 𝐵',
                    'გ' => 'მხოლოდ 𝐶',
                    'დ' => 'მხოლოდ 𝐴 და 𝐵',
                    'ე' => 'არც ერთი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 59,

            'introduction' => 'n ისეთი ნატურალური რიცხვია, რომ 2𝑛 − (70 − 0,4): 10,07 გამოსახულების მნიშვნელობა დადებითია. მინიმუმ
            რის ტოლი შეიძლება იყოს n?',

            'answers' => json_encode(
                [
                    'ა' => '2',
                    'ბ' => '3',
                    'გ' => '4',
                    'დ' => '5',
                    'ე' => '6',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 60,

            'introduction' => 'მიმდევრობის პირველი წევრი 1-ის ტოლია, ხოლო ყოველი მომდევნო წევრი წინა წევრზე მეტია 2-ჯერ ან მეტია 8-ით.
            ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს ამ მიმდევრობის მე-4 წევრი?',

            'answers' => json_encode(
                [
                    'ა' => '22',
                    'ბ' => '24',
                    'გ' => '26',
                    'დ' => '28',
                    'ე' => '30',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 61,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 62,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 63,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 64,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 65,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 66,

            'introduction' => '𝑎 = 27 ∙ 612. რომელი ციფრით ბოლოვდება 𝑎 რიცხვის ციფრული ჩანაწერი?',

            'answers' => json_encode(
                [
                    'ა' => '0-ით',
                    'ბ' => '2-ით',
                    'გ' => '4-ით',
                    'დ' => '6-ით',
                    'ე' => '8-ით',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 67,

            'introduction' => 'm
            -ის რამდენი მთელი მნიშვნელობისთვისაა 4m + 3 გამოსახულების მნიშვნელობა 2-ზე მეტი, მაგრამ 20-ზე ნაკლები?',

            'answers' => json_encode(
                [
                    'ა' => '4',
                    'ბ' => '5',
                    'გ' => '6',
                    'დ' => '13',
                    'ე' => '17',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 68,

            'introduction' => 'ABCD ოთხკუთხედი BK მონაკვეთით დაყოფილია სამკუთხედად და კვადრატად
            (იხ. ნახაზი). ოთხკუთხედის AB გვერდის სიგრძეა 10 სმ, ხოლო CD გვერდისა – 8 სმ.
            რამდენი სანტიმეტრის ტოლია AD გვერდის სიგრძე?',

            'answers' => json_encode(
                [
                    'ა' => '11-ის',
                    'ბ' => '12-ის',
                    'გ' => '13-ის',
                    'დ' => '14-ის',
                    'ე' => '15-ის',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 69,

            'introduction' => 'კომპანიას 30 ტელევიზორი ერთნაირ ფასად უნდა გაეყიდა და ყველა მათგანის გაყიდვის შემთხვევაში მის
            ანგარიშზე სულ
            b ლარი უნდა შემოსულიყო, მაგრამ კომპანიამ თითოეული ტელევიზორი 10%-იანი ფასდაკლებით
            გაყიდა. რამდენ ლარად გაყიდულა თითოეული ტელევიზორი?',

            'answers' => json_encode(
                [
                    'ა' => '𝑏−10/30',
                    'ბ' => '𝑏/30',
                    'გ' => '𝑏/40',
                    'დ' => '3𝑏/100',
                    'ე' => '11𝑏/300',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 70,

            'introduction' => 'MNKC მართკუთხედის MN და MC გვერდები E და F წერტილებით შუაზე იყოფა
            (იხ. ნახაზი). ENKF ოთხკუთხედის ფართობი 20 სმ2-ის ტოლია. რამდენი
            კვადრატული სანტიმეტრია MNKC მართკუთხედის ფართობი?',
            'image' => env('IMAGE_URL') . '/images/general-version-1-70.png',


            'answers' => json_encode(
                [
                    'ა' => '28',
                    'ბ' => '30',
                    'გ' => '32',
                    'დ' => '34',
                    'ე' => '36',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 71,

            'introduction' => 'm ნულისგან განსხვავებული მთელი რიცხვია.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. m რომელიღაც მთელი რიცხვის მესამე ხარისხის ტოლია.',
                'II. m რომელიღაც მთელი რიცხვის მეხუთე ხარისხის ტოლია.',
            ]),
            'question' => 'იმის გასარკვევად, რიცხვი m დადებითია თუ უარყოფითი:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 72,

            'introduction' => 'ლია 3 წლით უფროსია ნინოზე, მაგრამ 5 წლით უმცროსია ვაჟაზე. თორნიკე 4 წლითაა უმცროსი ვაჟაზე.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. ნინო 6 წლისაა',
                'II. თორნიკე 10 წლისაა',
            ]),
            'question' => 'იმის გასარკვევად, თუ რამდენი წლისაა ლია:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 73,

            'introduction' => 'მოცემულია მართკუთხედი, რომელიც მისი ერთ-ერთი გვერდის პარალელური მონაკვეთებით დაყოფილია სამ
            მართკუთხედად, რომელთაგან ორი კვადრატია, მესამე კი - არა.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. დაყოფის შედეგად მიღებული თითოეული კვადრატის პერიმეტრი 8 სმ-ის ტოლია',
                'II. დაყოფის შედეგად მიღებული მესამე მართკუთხედის პერიმეტრი 6 სმ-ის ტოლია',
            ]),
            'question' => 'იმის გასარკვევად, თუ რის ტოლია მოცემული მართკუთხედის პერიმეტრი:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 74,

            'introduction' => 'x, y და z ისეთი რიცხვებია, რომ 𝑥 − 𝑦 = 2𝑧 .
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. 𝑧 = 12',
                'II. 2𝑧 − 𝑥 = 12',
            ]),
            'question' => 'იმის გასარკვევად, თუ რის ტოლია y:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 75,

            'introduction' => 'ანსამბლის წევრთა შესახებ მოცემულია შემდეგი ორი პირობა:',
            'conditions' => json_encode([
                'I. ანსამბლის წევრთა რაოდენობა მეტია 15-ზე',
                'II. ანსამბლის წევრთა რაოდენობა ნაკლებია 20-ზე',
            ]),
            'question' => 'იმის გასარკვევად, არის თუ არა ანსამბლის რომელიმე ორი წევრი დაბადებული ერთსა და იმავე თვეში:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 76,

            'introduction' => 'საახალწლოდ მაღაზიაში საქონელი 20-40% ფასდაკლებით იყიდებოდა. გარდა ამისა, ზოგიერთი საქონლის
            შეძენისას მყიდველს უკვე გადახდილი თანხის 25%-ს უკან უბრუნებდნენ. დიტომ ამ მაღაზიაში შეიძინა მაცივარი,
            რომელიც ფასდაკლებამდე 400 ლარი ღირდა. მაქსიმუმ რამდენი ლარი შეიძლებოდა დაეზოგა დიტოს?',


            'answers' => json_encode(
                [
                    'ა' => '140',
                    'ბ' => '160',
                    'გ' => '180',
                    'დ' => '200',
                    'ე' => '220',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 77,

            'introduction' => 'მანდარინებსა და ფორთოხლებს, რომელთა რაოდენობა ერთმანეთის ტოლია, კოლოფებში აწყობენ ისე, რომ
            თითოეულ კოლოფში ან 3 ფორთოხალია, ან 5 მანდარინი. ჩაწყობის შემდეგ დარჩა 1 ფორთოხალი და 2 მანდარინი.
            ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს მანდარინების და ფორთოხლების საერთო რაოდენობა?',


            'answers' => json_encode(
                [
                    'ა' => '12-ის',
                    'ბ' => '14-ის',
                    'გ' => '16-ის',
                    'დ' => '18-ის',
                    'ე' => '20-ის',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 78,

            'introduction' => 'ერთი ველოსიპედისტი 15 კმ/სთ სიჩქარით მოძრაობს. რის ტოლია მეორე ველოსიპედისტის სიჩქარე, თუ ის ყოველი
            კილომეტრის გავლას ერთი წუთით ნაკლებს ანდომებს, ვიდრე პირველი ველოსიპედისტი?',


            'answers' => json_encode(
                [
                    'ა' => '16 კმ/სთ-ის',
                    'ბ' => '17 კმ/სთ-ის',
                    'გ' => '18 კმ/სთ-ის',
                    'დ' => '19 კმ/სთ-ის',
                    'ე' => '20 კმ/სთ-ის',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 79,

            'introduction' => 'საკლასო ოთახში მყოფი მოსწავლეებიდან სამი გოგონაა და ერთი ბიჭი. რის ტოლია იმის ალბათობა, რომ
            ოთახიდან შემთხვევით გამოსული სამი მოსწავლიდან სამივე გოგონა იქნება?',


            'answers' => json_encode(
                [
                    'ა' => '1/4-ის',
                    'ბ' => '1/3-ის',
                    'გ' => '1/2-ის',
                    'დ' => '2/3-ის',
                    'ე' => '3/4-ის',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 80,

            'introduction' => '𝑂 და 𝑂1 ცენტრების მქონე წრეწირებს მხოლოდ ერთი საერთო წერტილი
            აქვთ (იხ. ნახაზი). |𝑂𝑂1| = 8 სმ. პატარა წრის ფართობი დიდი წრის ფართობის
            1
            9 ნაწილია. რის ტოლია დიდი წრის გამუქებული ნაწილის ფართობი?',


            'answers' => json_encode(
                [
                    'ა' => '128𝜋 სმ2-ის',
                    'ბ' => '136𝜋 სმ2-ის',
                    'გ' => '148𝜋 სმ2-ის',
                    'დ' => '160𝜋 სმ2-ის',
                    'ე' => '164𝜋 სმ2-ის',
                ]
            ),
            'correct' => 'ა',

        ]);
    }
}
