<?php

namespace Database\Seeders;

use App\Models\TestType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;


class TestSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 1,
            'introduction' => 'კინოფესტივალზე სხვადასხვა ჟანრის – კომედიურ, დეტექტიურ, სათავგადასავლო და ანიმაციურ – ფილმებს
            აჩვენებენ. ამასთან, კინოფესტივალი ოთხ დღეს (ხუთშაბათი-კვირა) გრძელდება და თითოეულ ჟანრს თითო დღე ეთმობა.
            ფესტივალის პროგრამის შედგენისას ორგანიზატორებმა შემდეგი პირობები უნდა დაიცვან:',

            'conditions' => json_encode([
                'კომედიური ფილმები უნდა აჩვენონ ხუთშაბათს ან პარასკევს.',
                'დეტექტიური ფილმები უნდა აჩვენონ პარასკევს ან შაბათს.',
                'სათავგადასავლო ფილმები უნდა აჩვენონ შაბათს ან კვირას.',
                'ანიმაციური ფილმები უნდა აჩვენონ ხუთშაბათს ან კვირას.',
            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განაწილება აკმაყოფილებს ოთხივე პირობას?',
            'answers' => json_encode(
                [
                    'ა' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ბ' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – დეტექტიური, კვირას – სათავგადასავლო',
                    'გ' => 'ხუთშაბათს – კომედიური, პარასკევს – დეტექტიური, შაბათს – ანიმაციური, კვირას – სათავგადასავლო',
                    'დ' => 'ხუთშაბათს – კომედიური, პარასკევს – ანიმაციური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ე' => 'ხუთშაბათს – კომედიური, პარასკევს – სათავგადასავლო, შაბათს – დეტექტიური, კვირას – ანიმაციური',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 2,

            'introduction' => 'მოცემულია გამონათქვამი:',

            'conditions' => json_encode([
                'არავინაა უნაკლო.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი დებულება ვერ იქნება ჭეშმარიტი, თუ მოცემული გამონათქვამი ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'უნაკლო ადამიანი არ არსებობს',
                    'ბ' => 'ზოგიერთ ადამიანს ბევრი ნაკლი აქვს',
                    'გ' => 'ყოველ ადამიანს ერთი ნაკლი მაინც აქვს',
                    'დ' => 'ზოგიერთ ადამიანს არც ერთი ნაკლი არ აქვს',
                    'ე' => 'ზოგიერთ ადამიანს ზოგიერთი ნაკლი არ აქვს',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 3,

            'introduction' => 'მოცემულია:',

            'conditions' => json_encode([
                'არც ერთი სტუდენტი არ არის არასრულწლოვანი.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად ჭეშმარიტი, თუ მოცემული დებულება ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'ყველა სტუდენტი არასრულწლოვანია',
                    'ბ' => 'ყველა სრულწლოვანი ადამიანი სტუდენტია',
                    'გ' => 'არც ერთი არასრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'დ' => 'არც ერთი სრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'ე' => 'არავინ, ვინც სტუდენტი არ არის, არ არის სრულწლოვანი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 4,

            'introduction' => 'მდინარის სანაპიროზე ოთხი კარავია ჩამწკრივებული: წითელი, ყვითელი, მწვანე და ლურჯი. თითოეული მათგანი
            თითო ტურისტს ეკუთვნის: ერთი – ინგლისელს, ერთი – ფრანგს, ერთი – დანიელს და ერთიც – გერმანელს.
            ცნობილია',

            'conditions' => json_encode([
                'დანიელი ტურისტის კარავი ყვითელ და ლურჯ კარვებზე უფრო დიდია.',
                'გერმანელი ტურისტის კარვის უშუალოდ მარცხნივ ლურჯი კარავი დგას, ხოლო უშუალოდ მარჯვნივ – ყვითელი.',
                'ინგლისელ ტურისტს არ ეკუთვნის არც ლურჯი კარავი და არც წითელი.',
                'წითელი კარავი და ინგლისელი ტურისტის კარავი გვერდიგვერდ არ დგას.',

            ]),
            'extra' => json_encode(['წითელი', 'ყვითელი', 'მწვანე', 'ლურჯი']),
            'question' => 'რომელი კარავი რომელ ტურისტს ეკუთვნის?',
            'answers' => json_encode(
                [
                    'ა' => 'გერმანელი ინგლისელს დანიელს ფრანგს',
                    'ბ' => 'დანიელს ფრანგს ინგლისელს გერმანელს',
                    'გ' => 'ფრანგს გერმანელს დანიელს ინგლისელს',
                    'დ' => 'გერმანელს ინგლისელს ფრანგს დანიელს',
                    'ე' => 'დანიელს ინგლისელს გერმანელს ფრანგს',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 5,

            'introduction' => 'თანამედროვე კვლევების მიხედვით, მცენარეების გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - აუმჯობესებს
            მოსწავლეთა შემეცნებით უნარებს. ვარაუდობენ, რომ მცენარეები ამცირებს ეკოლოგიური სტრესორების (მაგალითად,
            ხმაური, სიცხე) ნეგატიურ გავლენას შემეცნებით უნარებზე.',
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი ვითარება დააყენებს ეჭვქვეშ აღნიშნულ ახსნას?',
            'answers' => json_encode(
                [
                    'ა' => 'ერთ-ერთი ფართომასშტაბიანი კვლევის მიხედვით, სხვა თანატოლებთან შედარებით, იმ ბავშვების შემეცნებითი
                    უნარების განვითარების დონე, რომელთა საცხოვრებელი ადგილი გამწვანებული იყო, უფრო მაღალი აღმოჩნდა,
                    თუმცა მათი აბსოლუტური უმრავლესობა მაღალი სოციალურ-ეკონომიკური სტატუსის მქონე ოჯახებს
                    წარმოადგენდა',
                    'ბ' => 'ერთ-ერთი გრძელვადიანი კვლევის მიხედვით, სოციალურ თუ აკადემიურ სფეროში იმ ადამიანების მიღწევები,
                    რომლებმაც ბავშვობა გამწვანებულ გარემოში გაატარეს, მნიშვნელოვნად მაღალი აღმოჩნდა იმ ადამიანების
                    მიღწევებთან შედარებით, რომლებსაც ამგვარ გარემოში არ უცხოვრიათ',
                    'გ' => 'კვლევებით დადასტურებულია, რომ ბუნებაში ჩატარებული გაკვეთილები აუმჯობესებს მოსწავლეთა ყურადღების
                    კონცენტრაციის უნარს, თუმცა ნაკლებად არის შესწავლილი, რამდენად გრძელვადიანია ეს ეფექტი',
                    'დ' => 'ნეიროფსიქოლოგიური კვლევების მიხედვით, მწვანე გარემოს გრძელვადიანი ზემოქმედების შედეგად
                    უმჯობესდება თავის ტვინის იმ უბნების ფუნქციონირების დონე, რომლებიც პასუხისმგებელია ყურადღებისა თუ
                    მეხსიერების პროცესებზე',
                    'ე' => 'კვლევებით დადასტურებულია, რომ მწვანე გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - ფიზიკური აქტივობის
                    მაპროვოცირებელია და მოსწავლეების სპორტით დაინტერესებას უწყობს ხელს',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 6,

            'introduction' => 'გმირთა ცხოვრებამ ------- ისტორია, ------- ისტორიამ ------- გმირთა მამაცობა. ------- იმის გარკვევა, თუ ვინ ვისგან
            არის დავალებული: მემატიანე მათგან, ვინც უხვი მასალით უზრუნველყო იგი, თუ მემატიანეს უნდა უმადლოდნენ
            დიდი პიროვნებანი?',
            'answers' => json_encode(
                [
                    'ა' => 'ვერაფრით გაამდიდრა / ხოლო / არ შეამკო / მიუხედავად ამისა, ადვილი არაა',
                    'ბ' => 'ვერაფრით გაამდიდრა / თუმცა / დააფასა / მიუხედავად ამისა, ადვილია',
                    'გ' => 'გაამდიდრა / თუმცა / ვერ დააფასა / ამიტომ ძნელია',
                    'დ' => 'გაამდიდრა / ხოლო / შეამკო / ამიტომ ძნელია',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 7,

            'introduction' => '------- , რაც ასე ------- სკოლისთვის, არათუ ------- ახალგაზრდების ინტელექტუალურ და მორალურ
            განვითარებას. ამ ------- აღმოჩენა და აღიარება ახალ შეკითხვას წამოჭრის: რას ნიშნავს თავისუფლება და რა ადგილი
            ------- განათლებაში?',
            'answers' => json_encode(
                [
                    'ა' => 'ვსრული თავისუფლება / უცხოა თანამედროვე / ხელს უწყობს, არამედ, პირიქით, ზღუდავს / მნიშვნელოვანი ფაქტის
                    / ჰქონდა ძალდატანებას ტრადიციულ',
                    'ბ' => 'ძალდატანება / დამახასიათებელი იყო ტრადიციული / ხელს უწყობდა, არამედ, პირიქით, ზღუდავდა /
                    სერიოზული ხარვეზის / უნდა ჰქონდეს მას თანამედროვე',
                    'გ' => 'სრული თავისუფლება / დამახასიათებელი იყო ტრადიციული / ზღუდავდა, არამედ, პირიქით, ხელს უწყობდა /
                    სერიოზული ხარვეზის / უნდა ჰქონდეს მას თანამედროვე',
                    'დ' => 'ძალდატანება / დამახასიათებელია თანამედროვე / ზღუდავს, არამედ, პირიქით, ხელს უწყობს / მნიშვნელოვანი
                    ფაქტის / ჰქონდა მას ტრადიციულ',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 8,

            'introduction' => '------- შემოქმედებითი ადამიანი. პედანტურობა ------- ხელსაყრელია, რადგან ------- ერგები ბიუროკრატიულ და
            ტექნოკრატიულ კულტურას',
            'answers' => json_encode(
                [
                    'ა' => 'არ არის ძნელი, იყო / ნაკლებად / არ გაქვს პასუხები და ვერ',
                    'ბ' => 'არ არის ძნელი, იყო / ნაკლებად / გაქვს პასუხები და ადვილად',
                    'გ' => 'არ არის ადვილი, იყო / ბევრად უფრო / არ გაქვს პასუხები და ვერ',
                    'დ' => 'არ არის ადვილი, იყო / ბევრად უფრო / გაქვს პასუხები და ადვილად',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 9,

            'introduction' => 'გადაჭარბებული აქცენტი ------- ნაცვლად, სხვა არაფერია, თუ არა თავისუფლების ------- იმპულსებისა და
            სურვილების ------- . ამგვარ შეცდომას ვუშვებთ მაშინ, როდესაც -------, რადგან არ არსებობს მიზანი, თუკი ის ------- არ
            ეფუძნება.',
            'answers' => json_encode(
                [
                    'ა' => 'მიზანმიმართულ გონიერ მოქმედებაზე, სპონტანური აქტივობის / დაპირისპირება / დაუფიქრებელ
                    შესრულებასთან / იმპულსი მიზანში გვერევა / იმპულსურ სწრაფვას',
                    'ბ' => 'სპონტანურობაზე, მიზანმიმართული გონიერი მოქმედების / დაპირისპირება / გონებით კონტროლთან / მიზანს
                    იმპულსისგან გავმიჯნავთ / იმპულსურ სწრაფვას',
                    'გ' => 'სპონტანურობაზე, მიზანმიმართული გონიერი მოქმედების / გაიგივება / დაუფიქრებელ შესრულებასთან /
                    იმპულსი მიზანში გვერევა / გააზრებულ გადაწყვეტილებას',
                    'დ' => 'მიზანმიმართულ გონიერ მოქმედებაზე, სპონტანური აქტივობის / გაიგივება / გონებით კონტროლთან / მიზანს
                    იმპულსისგან გავმიჯნავთ / გააზრებულ გადაწყვეტილებას',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 10,
            'introduction' => 'რა გახდა აფრიკიდან ჩრდილოეთ ნახევარსფეროში მოსული ადრეული ადამიანისთვის განვითარების სტიმული?
            (უპასუხეთ I აბზაცის მიხედვით.)',
            'answers' => json_encode(
                [
                    'ა' => 'ადრეული ადამიანისა და მგლის ეკოლოგიურ ნიშათა მსგავსება და მკაცრი კლიმატის შეცვლა სეზონურით;',
                    'ბ' => 'ჩრდილოეთ ნახევარსფეროში პოტენციური მსხვერპლით სავსე ტყე-ველის არსებობა და ადრეული ადამიანის მიერ
                    ამ ტერიტორიების ათვისება',
                    'გ' => 'ჩრდილოეთ ნახევარსფეროში გაბატონებულ მთავარ მტაცებელთან კონკურენცია, რასაც მოჰყვა ამავე მტაცებლის
                    ადაპტირება ადამიანის გარემოსთან',
                    'დ' => 'აფრიკიდან მოსული ადამიანისთვის უფრო რთული პირობების არსებობა ახალ გარემოში და სხვადასხვა სახეობის
                    გარეული ცხოველების მოშინაურება',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 11,
            'introduction' => 'კონრად ლორენცმა თავისი წიგნის ერთ-ერთ თავს „შეთანხმება“ დაარქვა. ქვემოთ ჩამოთვლილთაგან რომელში
            ჩანს სწორად ამ „შეთანხმების“ არსი',
            'answers' => json_encode(
                [
                    'ა' => ' მრავალი წლის განმავლობაში ადრეული ადამიანი და მგელი იძულებულნი იყვნენ, ერთსა და იმავე მსხვერპლზე
                    ენადირათ',
                    'ბ' => 'ზომიერ სარტყელში ნადირობისთვის ადამიანიც ისევე იყო ადაპტირებული, როგორც მთავარი მტაცებელი – მგელი',
                    'გ' => 'სანამ ადამიანი სელექციურ სამუშაოებს დაიწყებდა, მანამდე ძაღლებში მიმდინარე ცვლილებები, დიდი
                    ალბათობით, ბუნებრივად ხდებოდა',
                    'დ' => 'ადრეულმა ადამიანმა ნადირობისას თავის პარტნიორად აქცია მგელი (შემდგომში ძაღლი), მას კი ადაპტირებისას
                    აგრესიული თვისებები შეუსუსტდა',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 12,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი მოსაზრება არ არის მართებული?',
            'answers' => json_encode(
                [
                    'ა' => 'ძაღლებს სახის მიმიკური კუნთები მგლებისგან გამოყოფის შემდეგ, მოშინაურების პროცესში განუვითარდათ ერთი
                    კონკრეტული მიზნით',
                    'ბ' => 'ძაღლები მუდმივად ითხოვენ ადამიანებთან თვალებით კონტაქტს და ამ მიზნით განუვითარდათ თვალის ზედა
                    კუნთები',
                    'გ' => 'თვალების გარშემო არსებული წყვილი კუნთი ბიოლოგიური მტკიცებულებაა იმისა, რომ ძაღლებს ის
                    მემკვიდრეობით გადმოეცათ მგლებისგან',
                    'დ' => 'ძაღლის თვალების უგულებელყოფა თავს დამნაშავედ გვაგრძნობინებს, რადგან ვხვდებით, რომ მას უნდა ჩვენთან
                    კომუნიკაცია',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 13,
            'introduction' => 'როგორც ცნობილია, ციმბირული ჰასკი მომთაბარე ჩუქჩებმა მარხილში შესაბმელად და ტვირთის გადასაზიდად
            მოიშინაურეს. ამ ჯიშის ძაღლები უფრო ყმუიან, ვიდრე ყეფენ და მათ მოდარაჯე ძაღლებად ვერ იყენებენ, თუმცა,
            ჰასკების მგლური გარეგნობა მაინც აშინებს უცხო ადამიანს. ხროვის ინსტინქტი მათში ერთობ ძლიერია, მეთაური
            ძაღლი ყოველთვის წინ მიუძღვის მარხილში შებმულ თანამოძმეებს. ისინი ადამიანთან თანამშრომლობენ, თუმცა მას
            არ ემორჩილებიან (მაგალითად, „დაჯექი“, „ის ჯოხი მომიტანე“ და სხვ.).',
            'question' => 'ციმბირულ ჰასკის არ განუვითარდა თვალის ზედა კუნთები. ამის მიზეზად შესაძლებელია, ვივარაუდოთ:',
            'answers' => json_encode(
                [
                    'ა' => 'მისი ძირითადი დანიშნულება ტვირთის გადაზიდვაა და მას ნაკლებად სჭირდება ადამიანთან თვალებით
                    კომუნიკაცია',
                    'ბ' => 'მათში უფრო მეტია მგლური თვისებები, მაგალითად, ისინი უფრო ყმუიან, ვიდრე ყეფენ, გარეგნულადაც მგელს
                    ძალიან ჰგვანან',
                    'გ' => 'მეთაური ძაღლი ყოველთვის ავლენს სხვა თანამოძმეებთან დომინანტურობას - ჰასკებში ძლიერია ხროვის
                    ინსტინქტი',
                    'დ' => 'ისინი მოდარაჯე ძაღლებად ვერ გამოდგებიან; ადამიანთან თანამშრომლობენ, მაგრამ მას არ ემორჩილებიან',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 14,
            'introduction' => 'რატომ მიჰყავთ თავშესაფრებიდან უფრო ხშირად ის ძაღლები, რომლებსაც კარგად აქვთ განვითარებული სახის
            მიმიკური კუნთები?',
            'answers' => json_encode(
                [
                    'ა' => 'უფრო ადვილად იწვრთნებიან ის ძაღლები, რომლებსაც შეუძლიათ, ადამიანის ყურადღება მიიქციონ',
                    'ბ' => 'ძაღლებს ეს მახასიათებელი რეალურ უპირატესობას ანიჭებს – ისინი წარმატებით ახერხებენ ადამიანების
                    მიმიკების მიბაძვის გზით ჩვენით მანიპულირებას',
                    'გ' => 'ამ მახასიათებლის მქონე ძაღლებს განსაკუთრებით ესაჭიროებათ ადამიანებთან კონტაქტი; ამ ვითარებაში მათ
                    უყალიბდებათ ჩვენთვის სასურველი თვისებები',
                    'დ' => 'ძაღლები, რომლებიც წარბების მოძრაობით უნებლიეთ ჰბაძავენ ადამიანს, როგორც წესი, უფრო თვინიერები არიან',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 15,
            'introduction' => 'გაეცანით რამდენიმე ინფორმაციას:
            I. გენეტიკოსებმა ძაღლის დნმ-ის შესწავლის შედეგად დაადგინეს, რომ ის არსებობდა 150 000 წლის წინაც ჩვენს
            წელთაღრიცხვამდე;
            II. ძაღლის ზოგიერთ თვისებას, მაგალითად, ჩამოყრილ ყურებს, დიდი ალბათობით, იმავე უჯრედებთან აქვს
            კავშირი, რომლებიც ძაღლის ხასიათს განაპირობებს, მაგალითად, დამჯერობას – თვისებას, რომელიც
            სასურველია, შინაურ ცხოველს ჰქონდეს;
            III. ერთმა ქართველმა ბიოლოგმა, მგლების ქცევის შესწავლის მიზნით, ბორჯომის ნაკრძალში რამდენიმე ინდივიდი
            შეიჩვია. როდესაც მეცნიერი მუშაობისას მოულოდნელად უზარმაზარი დათვის წინ აღმოჩნდა, ორმა მგელმა
            დათვს შეუტია და გააქცია. არადა, როგორც წესი, მგლები დათვის ნაკვალევსაც კი ერიდებიან;
            IV. როდესაც ძაღლი ოჯახის წევრებს ხედავს, ის წარბებს ზევით სწევს, მაგრამ როცა უცხო ადამიანს ხედავს, მისი
            სახის მიმიკა უცვლელი რჩება და სხეულით გამოხატავს აგრესიას.',
            'question' => 'ქვემოთ ჩამოთვლილია წინადადებები, რომლებშიც ასახულია მიმართება ცალკეულ ინფორმაციასა და ტექსტის
            კონკრეტულ აბზაცს შორის. მათგან რომელი არ არის მართებული?',
            'answers' => json_encode(
                [
                    'ა' => 'I ინფორმაცია უპირისპირდება ტექსტის II აბზაცში გამოთქმულ მოსაზრებას ძაღლის მოშინაურების პერიოდთან
                    დაკავშირებით',
                    'ბ' => 'II ინფორმაცია განამტკიცებს II აბზაცში გამოთქმულ მოსაზრებას ადამიანის გარემოსთან ძაღლის ადაპტირების
                    შესახებ',
                    'გ' => 'III ინფორმაცია ეჭვქვეშ აყენებს II აბზაცში წარმოდგენილ კონრად ლორენცის კონცეფციას „შეთანხმებაზე“ მგელსა
                    და ადამიანს შორის',
                    'დ' => 'IV ინფორმაცია ადასტურებს III, IV და V აბზაცებში წარმოდგენილ მსჯელობას ადამიანთან ძაღლის კომუნიკაციის
                    უნარზე, რომელიც ძაღლებს ადამიანის მიმიკების მიბაძვით გამოუმუშავდათ',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 16,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „ნახევარსფერო : ტვინის ნახევარსფერო“? (I აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ბურთი : საჰაერო ბურთი',
                    'ბ' => 'წერტილი : ათვლის წერტილი',
                    'გ' => 'წრე : მოჯადოებული წრე',
                    'დ' => 'ხაზი : ტელეფონის ხაზი',
                    'ე' => 'რადიუსი : გავრცელების რადიუსი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 17,
            'introduction' => 'წყვილში „ადაპტირებული : არსებობა“ ისეთივე მიმართებაა, როგორიც – წყვილში ორატორული: (II აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'მუყაითობა',
                    'ბ' => 'ემპათიურობა',
                    'გ' => 'სიტყვაძუნწობა',
                    'დ' => 'დამაჯერებლობა',
                    'ე' => 'ანალიტიკურობა',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 18,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „გამომეტყველება : განწყობილება“? (III აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'მანერა : ნიუანსი',
                    'ბ' => 'იერი : გარეგნობა',
                    'გ' => 'ტონი : დამოკიდებულება',
                    'დ' => 'აქცენტი : ყურადღების გამახვილება',
                    'ე' => 'დიქცია : წარმოთქმის თავისებურება',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 19,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „უპირატესობა : შედარება“? (V აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ალტერნატივა : არჩევანი',
                    'ბ' => 'კონტაქტი : ინტერესი',
                    'გ' => 'უნარიანობა : კონკურენცია',
                    'დ' => 'ევოლუცია : სელექცია',
                    'ე' => 'ცენზურა : კონტროლი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 20,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი ნათქვამი არ არის მეტაფორული?',
            'answers' => json_encode(
                [
                    'ა' => 'ახალი ტერიტორიების ათვისება',
                    'ბ' => 'ადამიანი და მგელი შეთანხმდნენ',
                    'გ' => 'მგლის ზოგიერთი თანამოძმის დამეგობრება',
                    'დ' => 'ძაღლის მოშინაურება იყო უზარმაზარი ნახტომი',
                    'ე' => 'მგელი ჩრდილოეთ ნახევარსფეროში ბატონობდა',
                ]
            ),
            'correct' => 'ა',

        ]);


        ///////////////////////////
        //////////////////////////
        ////////////////////////







        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 21,
            'introduction' => 'სამი მეგობარი გამოთქვამს ვარაუდებს შაბათ-კვირას მოსალოდნელი ამინდის შესახებ:',

            'conditions' => json_encode([
                'ელენე: შაბათს იწვიმებს, ხოლო კვირას ქარი იქნება.',
                'დავითი: ელენეს პროგნოზებიდან მხოლოდ ერთი გამართლდება',
                'ანა: დავითი ცდება',
            ]),
            'question' => 'აღმოჩნდა, რომ მხოლოდ ერთი მათგანი იყო მართალი. მაშინ ქვემოთ ჩამოთვლილთაგან რომელია შეუძლებელი?',
            'answers' => json_encode(
                [
                    'ა' => 'შაბათს არ იწვიმა და კვირას ქარი იყო',
                    'ბ' => 'შაბათს იწვიმა და კვირას ქარი არ იყო',
                    'გ' => 'შაბათს იწვიმა და კვირას ქარი იყო',
                    'დ' => 'არც შაბათს იწვიმა და არც კვირას იყო ქარი',
                    'ე' => 'შაბათს არ იწვიმა ან კვირას არ იყო ქარი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 22,

            'introduction' => 'უნივერსიტეტების I და II-კურსელ სტუდენტებს შორის მათი წილი, ვინც რომელიმე ჰუმანიტარულ დარგს
            ირჩევს სპეციალობად, მნიშვნელოვნად აღემატება სკოლის დამამთავრებელი კლასის მოსწავლეებსა და
            აბიტურიენტებს შორის მათს წილს, ვისაც უნივერსიტეტში შესვლამდე აქვს გადაწყვეტილი ჰუმანიტარული განხრით
            სპეციალიზება. ამ განსხვავებას ზოგიერთი მეცნიერი იმით ხსნის, რომ სკოლებში, განსხვავებით უნივერსიტეტებისგან,
            ჰუმანიტარული დარგების სწავლება სტანდარტიზებული და გამოცდებზე მორგებულია.',

            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განამტკიცებს აღნიშნულ ახსნას?',
            'answers' => json_encode(
                [
                    'ა' => 'კვლევებმა გამოავლინა, რომ სულ უფრო მეტი აბიტურიენტი და I და II-კურსელი სტუდენტი ირჩევს მომავალ
                    სპეციალობას იმის მიხედვით, თუ როგორია შესაბამის სფეროში სტაბილური და მაღალანაზღაურებადი
                    დასაქმების პერსპექტივა',
                    'ბ' => 'ბოლო ათწლეულებში განუწყვეტლივ იზრდება უნივერსიტეტებში საბუნებისმეტყველო და ტექნიკური დარგების
                    შემსწავლელი სტუდენტების წილი',
                    'გ' => 'სკოლის დამამთავრებელი კლასის მოსწავლეთა და აბიტურიენტთა უმრავლესობას უნივერსიტეტში შესვლამდე არ
                    აქვს გადაწყვეტილი, თუ რა სპეციალობას აირჩევს',
                    'დ' => 'სკოლის დამამთავრებელი კლასის მოსწავლეთა და აბიტურიენტთა უმრავლესობას მედიცინის შესწავლა სურს,
                    მაგრამ მედიცინის ფაკულტეტებზე ადგილები შეზღუდულია და მსურველთა ძალიან მცირე ნაწილს ეძლევა ამ
                    მიმართულებით სწავლის შესაძლებლობა',
                    'ე' => 'კვლევები აჩვენებს, რომ სწავლებაში შემოქმედებითი მიდგომების გამოყენება განსაკუთრებით მნიშვნელოვანია
                    ჰუმანიტარული დარგების მიმართ ინტერესის გასაღვიძებლად',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 23,

            'introduction' => 'მოცემულია სამი დებულება:',

            'conditions' => json_encode([
                'I. ყველა მცენარე, რომლებიც დიდი რაოდენობით შეიცავს ცილებს, სასარგებლოა.',
                'II. ყველა პარკოსანი მცენარე სასარგებლოა.',
                'III. ყველა პარკოსანი მცენარე დიდი რაოდენობით შეიცავს ცილებს.',

            ]),
            'question' => 'ამ დებულებათა შესახებ ქვემოთ წარმოდგენილი მტკიცებებიდან რომელი არ არის მართებული?',
            'answers' => json_encode(
                [
                    'ა' => 'შესაძლებელია, I და II ჭეშმარიტი იყოს, ხოლო III – მცდარი',
                    'ბ' => 'შესაძლებელია, II და III ჭეშმარიტი იყოს, ხოლო I – მცდარი',
                    'გ' => 'თუ II და III ჭეშმარიტია, მაშინ I შეიძლება იყოს ჭეშმარიტი',
                    'დ' => 'თუ I და II ჭეშმარიტია, მაშინ III შეიძლება იყოს ჭეშმარიტი',
                    'ე' => 'შესაძლებელია, I და III ჭეშმარიტი იყოს, ხოლო II – მცდარი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 24,

            'introduction' => 'მოცემულია:',

            'conditions' => json_encode([
                'თუ მატარებელი დაიგვიანებს, მენეჯერი შეხვედრას გადადებს.',
                'თუ მატარებელი არ დაიგვიანებს, მენეჯერი საღამოს სავარჯიშოდ წავა.',
                'მენეჯერი საღამოს სავარჯიშოდ არ წავა ან შინ გვიან დაბრუნდება.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად ჭეშმარიტი, თუ ეს დებულებები ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'მატარებელი არ დაიგვიანებს ან მენეჯერი საღამოს შინ გვიან დაბრუნდება',
                    'ბ' => 'მატარებელი დაიგვიანებს ან მენეჯერი საღამოს შინ გვიან არ დაბრუნდება',
                    'გ' => 'მენეჯერი შეხვედრას არ გადადებს ან საღამოს შინ გვიან არ დაბრუნდება',
                    'დ' => 'საღამოს მენეჯერი სავარჯიშოდ არ წავა ან შეხვედრას გადადებს',
                    'ე' => 'მენეჯერი შეხვედრას გადადებს ან შინ გვიან დაბრუნდება',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 25,

            'introduction' => 'მეგობრები – ნინო, მარი, თინა – და მათი ძმები – ანდრო, ვანო, ლევანი – წყვილებად თამაშობენ ბადმინტონს.
            თითოეულ წყვილში ერთი ბიჭი და ერთი გოგონაა, ამასთან, არც ერთ წყვილში არ არის და-ძმა. ცნობილია:',


            'conditions' => json_encode([
                'ერთ-ერთ წყვილში თამაშობენ ანდრო და ლევანის და.',
                'ერთ-ერთ წყვილში თამაშობენ ნინოს ძმა და ვანოს და.',
                'ერთ-ერთ წყვილში თამაშობენ მარის ძმა და ანდროს და.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებელი, თუ ეს ცნობები სწორია?',
            'answers' => json_encode(
                [
                    'ა' => 'ნინოს მეწყვილეა ვანო',
                    'ბ' => 'მარის მეწყვილეა ვანო',
                    'გ' => 'თინას მეწყვილეა ანდრო',
                    'დ' => 'მარის მეწყვილეა ლევანი',
                    'ე' => 'ნინოს მეწყვილეა ლევანი.',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 26,

            'introduction' => 'შეიძლება მოგვეჩვენოს, რომ ციყვი, რომელიც საკვების ნაწილს ხელუხლებლად ტოვებს და საზამთროდ
            გადაინახავს, ------- . მაგრამ ეს აზრი რომ მცდარია და ციყვს სინამდვილეში ------- ამოძრავებს, აქედანაც ნათლად ჩანს:
            ოთახში დატყვევებული ------- აკეთებს, ------- ასეთ სიტუაციაში ამ ქცევას ------- აქვს.',
            'answers' => json_encode(
                [
                    'ა' => 'ინსტინქტურად მოქმედებს / მომავალი საჭიროების წარმოდგენა / ციყვი იმავეს არ / მიუხედავად იმისა, რომ /
                    კიდევ უფრო დიდი მნიშვნელობა',
                    'ბ' => 'მომავალი საჭიროების იდეით ხელმძღვანელობს / მხოლოდ ინსტინქტი / ციყვი იმავეს არ / ვინაიდან / კიდევ უფრო
                    დიდი მნიშვნელობა',
                    'გ' => 'ინსტინქტურად მოქმედებს / მომავალი საჭიროების წარმოდგენა / ციყვიც ზუსტად იმავეს / მიუხედავად იმისა, რომ
                    / არავითარი აზრი არ',
                    'დ' => 'მომავალი საჭიროების იდეით ხელმძღვანელობს / მხოლოდ ინსტინქტი / ციყვიც ზუსტად იმავეს / მიუხედავად
                    იმისა, რომ / არავითარი აზრი არ',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 27,

            'introduction' => 'არსებობს ორი საპირისპირო დამოკიდებულება კულტურისადმი. რუსო და ტოლსტოი ------- აფასებენ კულტურას.
            ამ მოაზროვნეთა რწმენით, კულტურულ ცხოვრებას ------- ადამიანთა მოდგმის განვითარება და გაუმჯობესება –
            კულტურა კაცობრიობისათვის ------- . ამიტომ ისინი კულტურული ცხოვრების ------- მოგვიწოდებენ. მეორე ბანაკი კი
            კულტურის ------- სწამს მისი განვითარების შესაძლებლობა.',
            'answers' => json_encode(
                [
                    'ა' => 'დადებითად / მოაქვს სწორედ / წინსვლის ერთადერთი გზაა / სულ უფრო განვითარებისკენ / დიდ მნიშვნელობაშია
                    დარწმუნებული და, ამასთან',
                    'ბ' => 'უარყოფითად / არ მოაქვს / უფრო უკან დახევაა, ვიდრე წინსვლა / პირველყოფილ საფეხურთან დაბრუნებისკენ /
                    დიდ მნიშვნელობაშია დარწმუნებული და, ამასთან',
                    'გ' => 'დადებითად / მოაქვს სწორედ / წინსვლის ერთადერთი გზაა / პირველყოფილ საფეხურთან დაბრუნებისკენ /
                    მნიშვნელობაშია დარწმუნებული, თუმცა არც მას',
                    'დ' => 'უარყოფითად / არ მოაქვს / წინსვლის ერთადერთი გზაა / სულ უფრო განვითარებისკენ / მნიშვნელობაში სულ არ
                    არის დარწმუნებული, თუმცა',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 28,

            'introduction' => 'ჰეგელისთვის ისტორია ერთიანი პროცესია, რომელსაც თავისი ლოგიკა აქვს და -------. ისტორიული პროცესი
            დანახულია, როგორც პროგრესი, წინსვლა, რომელიც ------- ცალკეული ადამიანის ნებასა და მოქმედებაზე. -------
            ისტორიით დადგენილი როლი და ------- მოერგოს მას.',
            'answers' => json_encode(
                [
                    'ა' => 'წინასწარ განსაზღვრავს ცალკეული ინდივიდების ადგილსა და როლს სამყაროში / დამოკიდებულია / შესაბამისად,
                    ინდივიდი ვალდებულია, არ მიიღოს / არ სცადოს',
                    'ბ' => 'განსაზღვრულია ცალკეული ინდივიდების გადაწყვეტილებებითა და მოქმედებებით / ნაკლებად არის
                    დამოკიდებული / პირიქით, ინდივიდი ვალდებულია, არ მიიღოს / სცადოს',
                    'გ' => 'წინასწარ განსაზღვრავს ცალკეული ინდივიდების ადგილსა და როლს სამყაროში / ნაკლებად არის დამოკიდებული
                    / პირიქით, ინდივიდი ვალდებულია, მიიღოს / მაქსიმალურად კარგად',
                    'დ' => 'განსაზღვრულია ცალკეული ინდივიდების გადაწყვეტილებებითა და მოქმედებებით / დამოკიდებულია /
                    შესაბამისად, ინდივიდი ვალდებულია, მიიღოს / მაქსიმალურად კარგად',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 29,

            'introduction' => 'ზოგიერთი მოაზროვნის შეხედულებით, კულტურა ------- მდიდრდება და ფართოვდება დროის მსვლელობასთან
            ერთად. ძველ ელინთა კულტურა ხომ გაცილებით უფრო ადრე არსებობდა, ვიდრე შუა საუკუნეების, ------- შეედრება
            ------- სიღრმესა და სიმაღლეს ------- კულტურა?!',
            'answers' => json_encode(
                [
                    'ა' => 'აშკარად / მაგრამ განა / შუა საუკუნეების კულტურის / ძველ ელინთა',
                    'ბ' => 'სრულებით არ / განა ამიტომ ვერ / ელინთა კულტურის / შუა საუკუნეების',
                    'გ' => 'აშკარად / განა ამიტომ ვერ / შუა საუკუნეების / ელინთა',
                    'დ' => 'სრულებით არ / მაგრამ განა / ელინთა კულტურის / შუა საუკუნეების',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 30,
            'introduction' => 'I აბზაცში ვეცნობით ნახატი ფილმების 2 ლათინური სახელწოდების მნიშვნელობებს („გამრავლება“ და
            „გაცოცხლება-გასულიერება“). რა მიმართებაა ამ ტერმინების მნიშვნელობებსა და ამ ტერმინებით აღნიშნულ
            მოვლენებს შორის?',
            'answers' => json_encode(
                [
                    'ა' => 'ორივე ტერმინის მნიშვნელობები ნახატი ფილმების შექმნის პროცესის სპეციფიკას ახასიათებს',
                    'ბ' => 'ორივე ტერმინის მნიშვნელობები ნახატი ფილმების აღქმის თანმდევ ეფექტს ასახავს',
                    'გ' => 'პირველი ტერმინის მნიშვნელობა ნახატი ფილმების შექმნის პროცესის სპეციფიკას გულისხმობს, მეორე კი
                    მეტაფორულად ასახავს ამ ფილმების აღქმის თანმდევ ეფექტს',
                    'დ' => 'პირველი ტერმინის მნიშვნელობა ნახატი ფილმების აღქმის თანმდევ ეფექტს გულისხმობს, მეორე კი
                    მეტაფორულად ასახავს ამ ფილმების შექმნის უშუალო პროცესს',
                ]
            ),
            'correct' => 'გ',

        ]);



        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 31,
            'introduction' => 'მარკ აზემამ გამოქვაბულის მხატვრებს პირველი ანიმატორები უწოდა, რადგან:',
            'answers' => json_encode(
                [
                    'ა' => 'გამოქვაბულის მხატვრებსაც და ანიმატორებსაც ერთი და იგივე მიზანი აქვთ – ზედმიწევნით ნატურალისტურად
                    გამოსახონ ცხოველები',
                    'ბ' => 'გამოქვაბულის კედლებზე შექმნილი გამოსახულებების თანამედროვე ვერსია წარმოადგენდა უძველესი სიუჟეტების
                    ილუსტრირების მცდელობას',
                    'გ' => 'ანიმატორებიც და გამოქვაბულის მხატვრებიც ცხოველების გასაცოცხლებლად ერთ გზას მიმართავენ – კიდურების
                    ჭარბ რაოდენობას ხატავენ',
                    'დ' => 'მხატვარ-მულტიპლიკატორებიც და გამოქვაბულის მხატვრებიც რამდენიმე გამოსახულების თანმიმდევრული
                    ჩვენებით ქმნიან მოძრაობის ილუზიას',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 32,
            'introduction' => 'თუ ორ მხედველობით შთაბეჭდილებას შორის ინტერვალი 0,3 წამს არ აღემატება, მაშინ:',
            'answers' => json_encode(
                [
                    'ა' => 'ორივე მხედველობითი შთაბეჭდილება დამოუკიდებელ გამოსახულებებად აღიქმება და იქმნება ამ
                    გამოსახულებათა მოძრაობის ილუზია',
                    'ბ' => 'პირველი ასეთი შთაბეჭდილება ვერ ასწრებს თვალის ბადურაზე გაქრობას და მეორე შთაბეჭდილებას ერწყმის,
                    ჩვენი თვალი კი გამოსახულებას შეცვლილი სახით აღიქვამს',
                    'გ' => 'ჩვენ აღვიქვამთ გამოსახულების ზუსტ სურათს, რადგან ადამიანის თვალი მხედველობით შთაბეჭდილებას
                    მოვლენის გაქრობის შემდეგ 0,1 წამის განმავლობაში ინარჩუნებს',
                    'დ' => 'ადამიანის თვალი ვერ ასწრებს გამოსახულების აღქმას და ყოველი ჩვენგანი თავისებურად წარმოვიდგენთ იმ
                    სურათს, ზოგი მხოლოდ პირველ შთაბეჭდილებას აღიქვამს, ზოგი – მეორეს',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 33,
            'introduction' => 'ცნობილია ირანში ნაპოვნი 5000 წლის წინ დამზადებული ლარნაკი, რომელზეც შესრულებულია ირმის
            გამოსახულებები. ქვემოთ მოცემულია ამ ლარნაკის მხატვრობის დეტალი. ალბათ ლარნაკის მხატვარსაც ირმების „გაცოცხლების“ სურვილი ამოძრავებდა. მოცემულ ტექსტში ვეცნობით ნახატის
            „გაცოცხლების“ რამდენიმე შემთხვევას:',

            'conditions' => json_encode([
                'I – მულტიპლიკაციურ ფილმში – ნახატი გამოსახულების მოძრაობის ცალკეული ფაზების თანმიმდევრულ
                დაფიქსირებას.',
                'II – პალეოლითის ხანის გამოქვაბულის მხატვრობის ნიმუშებზე – ცხოველების კიდურების ჭარბ რაოდენობას.',
                'ერთ-ერთ წყვილში თამაშობენ მარის ძმა და ანდროს და.',
                'III – ზედა პალეოლითის ხანის გამოქვაბულის მხატვრობას – მარტორქის თავისა და რქის გამეორებას.',

            ]),
            'image' => 'http://2.bp.blogspot.com/_kSyDiiYY9PI/TAeoz-3VBjI/AAAAAAAAAC4/z7uWHoS1VQ8/s1600/300px-Vase_animation.svg.png',
            'question' => 'ზემოთ ჩამოთვლილთაგან რომელი შემთხვევის ანალოგად შეიძლება მივიჩნიოთ ძველი ირანელი მხატვრის
            ნამუშევარი მიზნის მისაღწევად გამოყენებული სტრატეგიის მსგავსების თვალსაზრისით?',
            'answers' => json_encode(
                [
                    'ა' => 'მხოლოდ I-ის',
                    'ბ' => 'მხოლოდ II-ის',
                    'გ' => 'I-ისა და II-ის',
                    'დ' => 'II-ისა და III -ის',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 34,
            'introduction' => 'ჩამოთვლილთაგან რომელში უფრო ზუსტად არის ასახული ზოოტროპისა და ტაუმატროპის ფუნქციონირების
            საერთო მექანიზმი?',
            'answers' => json_encode(
                [
                    'ა' => 'ორივე სათამაშო დისკოს სწრაფი ბრუნვით ქმნის ეფექტს, ორივეზე მრავალი გამოსახულება ამოძრავდება და იქმნება
                    ოპტიკური ილუზია',
                    'ბ' => 'ორივე სათამაშოს სწრაფი მოძრაობით ჩვენი მხედველობითი შთაბეჭდილებები ერწყმის ერთმანეთს და ორივე
                    შემთხვევაში იქმნება ეფექტი, რომ გამოსახულებები მოძრაობს',
                    'გ' => 'ორივე სათამაშო ეფექტს ქმნის დისკოსა და ფირფიტის სხვადასხვა მხარეს ერთნაირი ნახატების განთავსებით',
                    'დ' => 'ორივე სათამაშოს შემთხვევაში ნახატები განცალკევებულ გამოსახულებებად აღიქმება და იქმნება მოძრაობის
                    ილუზია',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 35,
            'introduction' => 'რა არის ამ ტექსტის ძირითადი სათქმელი?',
            'answers' => json_encode(
                [
                    'ა' => 'უამრავი ოპტიკური სათამაშო იქმნება იმის გათვალისწინებით, რომ ადამიანის თვალი მხედველობით
                    შთაბეჭდილებას მოვლენის გაქრობის შემდეგ 0,1 წამის განმავლობაში ინარჩუნებს',
                    'ბ' => 'მულტიპლიკაციური ფილმი იქმნება ასე: მსგავსი კადრების დროში სწრაფად მონაცვლეობა ქმნის ოპტიკურ
                    ილუზიას, თვალი კი სწრაფად მონაცვლე კადრებს ერთ ცვლად გამოსახულებად, მოძრავ ფიგურად აღიქვამს',
                    'გ' => 'საკუთარი ნახატების „გაცოცხლების“ სურვილმა ადამიანს უბიძგა ჯერ ოპტიკური სათამაშოების, შემდეგ კი
                    სპეციალური ტექნიკის შექმნისკენ, რაც კინოხელოვნების დაბადებით დაგვირგვინდა',
                    'დ' => 'თანამედროვე მხატვარ-მულტიპლიკატორები, ისევე, როგორც პალეოლითის ხანის კედლის მხატვრები, ნახატი
                    ფიგურების „გასულიერების“ მიზნით, ეფექტს აღწევენ მოძრაობის ცალკეული ფაზების თანმიმდევრული
                    გამეორებით',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 36,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „მულტიპლიკაცია : კადრების მონაცვლეობა“? (I აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'უვერტიურა : განწყობის შექმნა',
                    'ბ' => 'აქცენტი : ორატორის ხელოვნება',
                    'გ' => 'კულმინაცია : მოქმედების განვითარება',
                    'დ' => 'ეპიზოდი : ცალკეული შემთხვევა',
                    'ე' => 'სიუჟეტი : მოვლენათა თანმიმდევრობა',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 37,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „მოძრაობის ფაზა : მოქმედება“? (I აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ფირი : გამჟღავნება',
                    'ბ' => 'ილეთი : ცეკვა',
                    'გ' => 'წერტილი : დასრულება',
                    'დ' => 'ინტერვალი : ანტრაქტი',
                    'ე' => 'მომენტი : შთაბეჭდილება',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 38,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში „გალია : ფრენა“?
            (V აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'კოლბა : კვლევა',
                    'ბ' => 'აკვარიუმი : ცურვა',
                    'გ' => 'სტადიონი : თამაში',
                    'დ' => 'ორანჟერეა : გამრავლება',
                    'ე' => 'ოლიერი : დათვალიერება',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 39,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელ წყვილშია იმგვარივე მიმართება, როგორიც – წყვილში
            „პრაქსინოსკოპი : პროექტორი“? (V აბზაცი)',
            'answers' => json_encode(
                [
                    'ა' => 'ჭოგრიტი : ლუპა',
                    'ბ' => 'სახნისი : გუთანი',
                    'გ' => 'წამმზომი : საათი',
                    'დ' => 'მარხილი : ყინულმჭრელი',
                    'ე' => 'გრამოფონი : მაგნიტოფონი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'analogy',
            'number' => 40,
            'introduction' => 'ქვემოთ ჩამოთვლილთაგან რომელი გამოთქმა არის მეტაფორული?',
            'answers' => json_encode(
                [
                    'ა' => 'ოპტიკური ილუზია',
                    'ბ' => 'კინოს დაბადება',
                    'გ' => 'საპროექციო აპარატი',
                    'დ' => 'ცეცხლმოკიდებული ჯოხი',
                    'ე' => 'გამოქანდაკებული ფიგურა',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 41,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',
            'image' => env('IMAGE_URL') . '/images/general-version-1-41.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 42,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-42.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 43,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-43.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 44,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-44.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 45,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-45.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 46,
            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები',
            'image' => env('IMAGE_URL') . '/images/general-version-1-46.png',
            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 47,

            'introduction' => 'a ნებისმიერი ნატურალური რიცხვია, b – მისი მომდევნო ნატურალური რიცხვია, c კი b-ს მომდევნო
            ნატურალური რიცხვია. მოცემულია სამი წინადადება:',


            'conditions' => json_encode([
                'I. a, b და c რიცხვებიდან რომელიმე ორის ჯამი ლუწია.',
                'II. a, b და c რიცხვებიდან რომელიმე ორი ლუწია.',
                'III. a, b და c რიცხვებიდან რომელიმე ორი კენტია.',

            ]),
            'question' => 'ამ წინადადებებიდან მართებულია:',
            'answers' => json_encode(
                [
                    'ა' => 'მხოლოდ I',
                    'ბ' => 'მხოლოდ II',
                    'გ' => 'მხოლოდ III',
                    'დ' => 'I და II',
                    'ე' => 'II და III',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 48,

            'introduction' => 'უჯრედებიან ბადეზე, რომლის თითოეული უჯრედი კვადრატია,
            მონიშნულია A და B წერტილები. ეს წერტილები ერთმანეთთან შეერთებულია
            ორი ტეხილით, რომელთა წვეროები ბადის კვანძებს ემთხვევა (იხ. ნახაზი). A და B
            წერტილების შემაერთებელი გრძელი ტეხილის სიგრძეა 180 მ. რამდენი მეტრია ამ
            წერტილების შემაერთებელი მოკლე ტეხილის სიგრძე?',

            'image' => env('IMAGE_URL') . '/images/general-version-1-48.png',
            'answers' => json_encode(
                [
                    'ა' => '80',
                    'ბ' => '90',
                    'გ' => '100',
                    'დ' => '110',
                    'ე' => '120',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 49,

            'introduction' => 'სულ რამდენი განსხვავებულციფრებიანი კენტი სამნიშნა რიცხვი შეიძლება ჩავწეროთ ციფრებით 2, 4, 7 და 8?',

            'answers' => json_encode(
                [
                    'ა' => '6',
                    'ბ' => '8',
                    'გ' => '12',
                    'დ' => '16',
                    'ე' => '24',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 50,

            'introduction' => 'კუბი დაყოფილია 8 ტოლ მართკუთხა პარალელეპიპედად, რომელთაგან
            თითოეულის უმცირესი წიბოს სიგრძე 2 სმ-ია',
            'question' => 'რამდენი კუბური სანტიმეტრია დაყოფის შედეგად მიღებული თითოეული
            მართკუთხა პარალელეპიპედის მოცულობა?',

            'image' => env('IMAGE_URL') . '/images/general-version-1-50.png',
            'answers' => json_encode(
                [
                    'ა' => '16',
                    'ბ' => '32',
                    'გ' => '48',
                    'დ' => '64',
                    'ე' => '96',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 51,

            'introduction' => 'ორნიშნა რიცხვი 2-ჯერ მეტია მისი ციფრების ჯამზე. რის ტოლია ამ ციფრების ნამრავლი?',

            'answers' => json_encode(
                [
                    'ა' => '2-ის',
                    'ბ' => '4-ის',
                    'გ' => '6-ის',
                    'დ' => '8-ის',
                    'ე' => '10',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 52,

            'introduction' => 'სულ რამდენმა სტუდენტმა აირჩია უმაღლეს საგანმანათლებლო დაწესებულებებში ჯანდაცვისა და სოციალური
            უზრუნველყოფის პროგრამები?',

            'answers' => json_encode(
                [
                    'ა' => '5 ათასმა',
                    'ბ' => '10 ათასმა',
                    'გ' => '15 ათასმა',
                    'დ' => '20 ათასმა',
                    'ე' => '25 ათასმა',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 53,

            'introduction' => 'მდედრობითი სქესის რამდენმა სტუდენტმა აირჩია უმაღლეს საგანმანათლებლო დაწესებულებებში განათლების,
            ჰუმანიტარული მეცნიერებებისა და ხელოვნების პროგრამები?',

            'answers' => json_encode(
                [
                    'ა' => '5 ათასმა',
                    'ბ' => '6 ათასმა',
                    'გ' => '7 ათასმა',
                    'დ' => '8 ათასმა',
                    'ე' => '9 ათასმა',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 54,

            'introduction' => 'რომელი საგანმანათლებლო პროგრამის შემთხვევაში იყო მდედრობითი სქესის სტუდენტთა რაოდენობა 1,5-ჯერ
            ნაკლები მამრობითი სქესის სტუდენტთა რაოდენობაზე?',

            'answers' => json_encode(
                [
                    'ა' => 'განათლების, ჰუმანიტარული მეცნიერებებისა და ხელოვნების',
                    'ბ' => 'ჯანდაცვისა და სოციალური უზრუნველყოფის',
                    'გ' => 'სოციალური მეცნიერებების, ბიზნესისა და სამართლის',
                    'დ' => 'სოფლის მეურნეობის',
                    'ე' => 'ზუსტი და საბუნებისმეტყველო მეცნიერებების',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'analysis',
            'number' => 55,

            'introduction' => 'სტუდენტთა საერთო რაოდენობის რამდენი პროცენტია მამრობითი სქესის იმ სტუდენტთა რაოდენობა,
            რომლებმაც აირჩიეს საგანმანათლებლო პროგრამა „საინჟინრო, დამამუშავებელი და სამშენებლო დარგები“?',

            'answers' => json_encode(
                [
                    'ა' => '10%',
                    'ბ' => '12%',
                    'გ' => '14%',
                    'დ' => '16%',
                    'ე' => '18%',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 56,

            'introduction' => 'ქვემოთ ჩამოთვლილი წილადებიდან რომელია უდიდესი?',

            'answers' => json_encode(
                [
                    'ა' => '2/3',
                    'ბ' => '3/4',
                    'გ' => '4/5',
                    'დ' => '5/6',
                    'ე' => '7/8',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 57,

            'introduction' => 'თუ (𝑎 + 𝑏)2 = 𝑎2 + 𝑏2, მაშინ:',

            'answers' => json_encode(
                [
                    'ა' => '𝑎 + 𝑏 = 0',
                    'ბ' => '𝑎 − 𝑏 = 0',
                    'გ' => '𝑎𝑏 = 0',
                    'დ' => '𝑎 = 0',
                    'ე' => '𝑏 = 0',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 58,

            'introduction' => 'მართკუთხა საკოორდინატო სიბრტყეზე მოცემულია 𝑂𝑀𝑁 მართკუთხა სამკუთხედი,
            რომლის 𝑂 წვერო კოორდინატთა სათავეს ემთხვევა, 𝑂𝑀 კათეტი 𝑥-ღერძზე მდებარეობს,
            ხოლო 𝑁 წვეროს კოორდინატებია (4; 4).',
            'question' => '𝐴(3; 2), 𝐵(2; 3) და 𝐶(5; 1) წერტილებიდან რომელი ეკუთვნის მოცემულ
            სამკუთხედს?',
            'image' => env('IMAGE_URL') . '/images/general-version-1-58.png',

            'answers' => json_encode(
                [
                    'ა' => 'მხოლოდ 𝐴',
                    'ბ' => 'მხოლოდ 𝐵',
                    'გ' => 'მხოლოდ 𝐶',
                    'დ' => 'მხოლოდ 𝐴 და 𝐵',
                    'ე' => 'არც ერთი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 59,

            'introduction' => 'n ისეთი ნატურალური რიცხვია, რომ 2𝑛 − (70 − 0,4): 10,07 გამოსახულების მნიშვნელობა დადებითია. მინიმუმ
            რის ტოლი შეიძლება იყოს n?',

            'answers' => json_encode(
                [
                    'ა' => '2',
                    'ბ' => '3',
                    'გ' => '4',
                    'დ' => '5',
                    'ე' => '6',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 60,

            'introduction' => 'მიმდევრობის პირველი წევრი 1-ის ტოლია, ხოლო ყოველი მომდევნო წევრი წინა წევრზე მეტია 2-ჯერ ან მეტია 8-ით.
            ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს ამ მიმდევრობის მე-4 წევრი?',

            'answers' => json_encode(
                [
                    'ა' => '22',
                    'ბ' => '24',
                    'გ' => '26',
                    'დ' => '28',
                    'ე' => '30',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 61,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'A სვეტის უჯრაში მოცემული რაოდენობა B სვეტის უჯრაში მოცემული რაოდენობის ტოლია',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 62,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 63,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 64,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'compare',
            'number' => 65,

            'introduction' => 'შეადარეთ ერთმანეთს
            A და
            B სვეტების უჯრებში მოცემული რაოდენობები.',

            'answers' => json_encode(
                [
                    'ა' => 'A სვეტის უჯრაში მოცემული რაოდენობა მეტია B სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'ბ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'გ' => 'B სვეტის უჯრაში მოცემული რაოდენობა მეტია A სვეტის უჯრაში მოცემულ რაოდენობაზე',
                    'დ' => 'მოცემული ინფორმაცია საკმარისი არაა იმის დასადგენად, რომელი რაოდენობაა მეტი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 66,

            'introduction' => '𝑎 = 27 ∙ 612. რომელი ციფრით ბოლოვდება 𝑎 რიცხვის ციფრული ჩანაწერი?',

            'answers' => json_encode(
                [
                    'ა' => '0-ით',
                    'ბ' => '2-ით',
                    'გ' => '4-ით',
                    'დ' => '6-ით',
                    'ე' => '8-ით',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 67,

            'introduction' => 'm
            -ის რამდენი მთელი მნიშვნელობისთვისაა 4m + 3 გამოსახულების მნიშვნელობა 2-ზე მეტი, მაგრამ 20-ზე ნაკლები?',

            'answers' => json_encode(
                [
                    'ა' => '4',
                    'ბ' => '5',
                    'გ' => '6',
                    'დ' => '13',
                    'ე' => '17',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 68,

            'introduction' => 'ABCD ოთხკუთხედი BK მონაკვეთით დაყოფილია სამკუთხედად და კვადრატად
            (იხ. ნახაზი). ოთხკუთხედის AB გვერდის სიგრძეა 10 სმ, ხოლო CD გვერდისა – 8 სმ.
            რამდენი სანტიმეტრის ტოლია AD გვერდის სიგრძე?',

            'answers' => json_encode(
                [
                    'ა' => '11-ის',
                    'ბ' => '12-ის',
                    'გ' => '13-ის',
                    'დ' => '14-ის',
                    'ე' => '15-ის',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 69,

            'introduction' => 'კომპანიას 30 ტელევიზორი ერთნაირ ფასად უნდა გაეყიდა და ყველა მათგანის გაყიდვის შემთხვევაში მის
            ანგარიშზე სულ
            b ლარი უნდა შემოსულიყო, მაგრამ კომპანიამ თითოეული ტელევიზორი 10%-იანი ფასდაკლებით
            გაყიდა. რამდენ ლარად გაყიდულა თითოეული ტელევიზორი?',

            'answers' => json_encode(
                [
                    'ა' => '𝑏−10/30',
                    'ბ' => '𝑏/30',
                    'გ' => '𝑏/40',
                    'დ' => '3𝑏/100',
                    'ე' => '11𝑏/300',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 70,

            'introduction' => 'MNKC მართკუთხედის MN და MC გვერდები E და F წერტილებით შუაზე იყოფა
            (იხ. ნახაზი). ENKF ოთხკუთხედის ფართობი 20 სმ2-ის ტოლია. რამდენი
            კვადრატული სანტიმეტრია MNKC მართკუთხედის ფართობი?',
            'image' => env('IMAGE_URL') . '/images/general-version-1-70.png',


            'answers' => json_encode(
                [
                    'ა' => '28',
                    'ბ' => '30',
                    'გ' => '32',
                    'დ' => '34',
                    'ე' => '36',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 71,

            'introduction' => 'm ნულისგან განსხვავებული მთელი რიცხვია.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. m რომელიღაც მთელი რიცხვის მესამე ხარისხის ტოლია.',
                'II. m რომელიღაც მთელი რიცხვის მეხუთე ხარისხის ტოლია.',
            ]),
            'question' => 'იმის გასარკვევად, რიცხვი m დადებითია თუ უარყოფითი:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 72,

            'introduction' => 'ლია 3 წლით უფროსია ნინოზე, მაგრამ 5 წლით უმცროსია ვაჟაზე. თორნიკე 4 წლითაა უმცროსი ვაჟაზე.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. ნინო 6 წლისაა',
                'II. თორნიკე 10 წლისაა',
            ]),
            'question' => 'იმის გასარკვევად, თუ რამდენი წლისაა ლია:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 73,

            'introduction' => 'მოცემულია მართკუთხედი, რომელიც მისი ერთ-ერთი გვერდის პარალელური მონაკვეთებით დაყოფილია სამ
            მართკუთხედად, რომელთაგან ორი კვადრატია, მესამე კი - არა.
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. დაყოფის შედეგად მიღებული თითოეული კვადრატის პერიმეტრი 8 სმ-ის ტოლია',
                'II. დაყოფის შედეგად მიღებული მესამე მართკუთხედის პერიმეტრი 6 სმ-ის ტოლია',
            ]),
            'question' => 'იმის გასარკვევად, თუ რის ტოლია მოცემული მართკუთხედის პერიმეტრი:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 74,

            'introduction' => 'x, y და z ისეთი რიცხვებია, რომ 𝑥 − 𝑦 = 2𝑧 .
            მოცემულია ორი პირობა:',
            'conditions' => json_encode([
                'I. 𝑧 = 12',
                'II. 2𝑧 − 𝑥 = 12',
            ]),
            'question' => 'იმის გასარკვევად, თუ რის ტოლია y:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 75,

            'introduction' => 'ანსამბლის წევრთა შესახებ მოცემულია შემდეგი ორი პირობა:',
            'conditions' => json_encode([
                'I. ანსამბლის წევრთა რაოდენობა მეტია 15-ზე',
                'II. ანსამბლის წევრთა რაოდენობა ნაკლებია 20-ზე',
            ]),
            'question' => 'იმის გასარკვევად, არის თუ არა ანსამბლის რომელიმე ორი წევრი დაბადებული ერთსა და იმავე თვეში:',


            'answers' => json_encode(
                [
                    'ა' => 'I პირობა საკმარისია, II კი – არა',
                    'ბ' => 'II პირობა საკმარისია, I კი – არა',
                    'გ' => 'I და II პირობა ერთად საკმარისია, ცალ-ცალკე არც ერთი არ არის საკმარისი',
                    'დ' => 'საკმარისია ცალ-ცალკე როგორც I, ასევე, II პირობა',
                    'ე' => 'მოცემული პირობები არ არის საკმარისი',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 76,

            'introduction' => 'საახალწლოდ მაღაზიაში საქონელი 20-40% ფასდაკლებით იყიდებოდა. გარდა ამისა, ზოგიერთი საქონლის
            შეძენისას მყიდველს უკვე გადახდილი თანხის 25%-ს უკან უბრუნებდნენ. დიტომ ამ მაღაზიაში შეიძინა მაცივარი,
            რომელიც ფასდაკლებამდე 400 ლარი ღირდა. მაქსიმუმ რამდენი ლარი შეიძლებოდა დაეზოგა დიტოს?',


            'answers' => json_encode(
                [
                    'ა' => '140',
                    'ბ' => '160',
                    'გ' => '180',
                    'დ' => '200',
                    'ე' => '220',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 77,

            'introduction' => 'მანდარინებსა და ფორთოხლებს, რომელთა რაოდენობა ერთმანეთის ტოლია, კოლოფებში აწყობენ ისე, რომ
            თითოეულ კოლოფში ან 3 ფორთოხალია, ან 5 მანდარინი. ჩაწყობის შემდეგ დარჩა 1 ფორთოხალი და 2 მანდარინი.
            ჩამოთვლილთაგან რომლის ტოლი შეიძლება იყოს მანდარინების და ფორთოხლების საერთო რაოდენობა?',


            'answers' => json_encode(
                [
                    'ა' => '12-ის',
                    'ბ' => '14-ის',
                    'გ' => '16-ის',
                    'დ' => '18-ის',
                    'ე' => '20-ის',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 78,

            'introduction' => 'ერთი ველოსიპედისტი 15 კმ/სთ სიჩქარით მოძრაობს. რის ტოლია მეორე ველოსიპედისტის სიჩქარე, თუ ის ყოველი
            კილომეტრის გავლას ერთი წუთით ნაკლებს ანდომებს, ვიდრე პირველი ველოსიპედისტი?',


            'answers' => json_encode(
                [
                    'ა' => '16 კმ/სთ-ის',
                    'ბ' => '17 კმ/სთ-ის',
                    'გ' => '18 კმ/სთ-ის',
                    'დ' => '19 კმ/სთ-ის',
                    'ე' => '20 კმ/სთ-ის',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 79,

            'introduction' => 'საკლასო ოთახში მყოფი მოსწავლეებიდან სამი გოგონაა და ერთი ბიჭი. რის ტოლია იმის ალბათობა, რომ
            ოთახიდან შემთხვევით გამოსული სამი მოსწავლიდან სამივე გოგონა იქნება?',


            'answers' => json_encode(
                [
                    'ა' => '1/4-ის',
                    'ბ' => '1/3-ის',
                    'გ' => '1/2-ის',
                    'დ' => '2/3-ის',
                    'ე' => '3/4-ის',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'mathematical',
            'category' => 'tasks',
            'number' => 80,

            'introduction' => '𝑂 და 𝑂1 ცენტრების მქონე წრეწირებს მხოლოდ ერთი საერთო წერტილი
            აქვთ (იხ. ნახაზი). |𝑂𝑂1| = 8 სმ. პატარა წრის ფართობი დიდი წრის ფართობის
            1
            9 ნაწილია. რის ტოლია დიდი წრის გამუქებული ნაწილის ფართობი?',


            'answers' => json_encode(
                [
                    'ა' => '128𝜋 სმ2-ის',
                    'ბ' => '136𝜋 სმ2-ის',
                    'გ' => '148𝜋 სმ2-ის',
                    'დ' => '160𝜋 სმ2-ის',
                    'ე' => '164𝜋 სმ2-ის',
                ]
            ),
            'correct' => 'ა',

        ]);
    }
}
