<?php

namespace Database\Seeders;

use App\Models\TestType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;


class TestSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        // DB::table('tests')->insert([
        //     'test_types_id' => TestType::first()->id,
        //     'type' => 'verbal',
        //     'category' => 'logic',
        //     'number' => 1,
        //     'introduction' => '1',
        //     'conditions' => ['first_coondition', 'second_condition'],
        //     'question' => 'Why cant we not be sober?',
        //     'answers' => [
        //         'ა' => 'lets get redy to rumble',
        //         'ბ' => 'lets get redy to rumble',
        //         'გ' => 'lets get redy to rumble',
        //     ],
        //     'correct' => 'ბ',
        //     'image' => 'image',

        // ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 1,
            'introduction' => 'კინოფესტივალზე სხვადასხვა ჟანრის – კომედიურ, დეტექტიურ, სათავგადასავლო და ანიმაციურ – ფილმებს
            აჩვენებენ. ამასთან, კინოფესტივალი ოთხ დღეს (ხუთშაბათი-კვირა) გრძელდება და თითოეულ ჟანრს თითო დღე ეთმობა.
            ფესტივალის პროგრამის შედგენისას ორგანიზატორებმა შემდეგი პირობები უნდა დაიცვან:',

            'conditions' => json_encode([
                'კომედიური ფილმები უნდა აჩვენონ ხუთშაბათს ან პარასკევს.',
                'დეტექტიური ფილმები უნდა აჩვენონ პარასკევს ან შაბათს.',
                'სათავგადასავლო ფილმები უნდა აჩვენონ შაბათს ან კვირას.',
                'ანიმაციური ფილმები უნდა აჩვენონ ხუთშაბათს ან კვირას.',
            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განაწილება აკმაყოფილებს ოთხივე პირობას?',
            'answers' => json_encode(
                [
                    'ა' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ბ' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – დეტექტიური, კვირას – სათავგადასავლო',
                    'გ' => 'ხუთშაბათს – კომედიური, პარასკევს – დეტექტიური, შაბათს – ანიმაციური, კვირას – სათავგადასავლო',
                    'დ' => 'ხუთშაბათს – კომედიური, პარასკევს – ანიმაციური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ე' => 'ხუთშაბათს – კომედიური, პარასკევს – სათავგადასავლო, შაბათს – დეტექტიური, კვირას – ანიმაციური',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 2,

            'introduction' => 'მოცემულია გამონათქვამი:',

            'conditions' => json_encode([
                'არავინაა უნაკლო.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი დებულება ვერ იქნება ჭეშმარიტი, თუ მოცემული გამონათქვამი ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'უნაკლო ადამიანი არ არსებობს',
                    'ბ' => 'ზოგიერთ ადამიანს ბევრი ნაკლი აქვს',
                    'გ' => 'ყოველ ადამიანს ერთი ნაკლი მაინც აქვს',
                    'დ' => 'ზოგიერთ ადამიანს არც ერთი ნაკლი არ აქვს',
                    'ე' => 'ზოგიერთ ადამიანს ზოგიერთი ნაკლი არ აქვს',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 3,

            'introduction' => 'მოცემულია:',

            'conditions' => json_encode([
                'არც ერთი სტუდენტი არ არის არასრულწლოვანი.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად ჭეშმარიტი, თუ მოცემული დებულება ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'ყველა სტუდენტი არასრულწლოვანია',
                    'ბ' => 'ყველა სრულწლოვანი ადამიანი სტუდენტია',
                    'გ' => 'არც ერთი არასრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'დ' => 'არც ერთი სრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'ე' => 'არავინ, ვინც სტუდენტი არ არის, არ არის სრულწლოვანი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 4,

            'introduction' => 'მდინარის სანაპიროზე ოთხი კარავია ჩამწკრივებული: წითელი, ყვითელი, მწვანე და ლურჯი. თითოეული მათგანი
            თითო ტურისტს ეკუთვნის: ერთი – ინგლისელს, ერთი – ფრანგს, ერთი – დანიელს და ერთიც – გერმანელს.
            ცნობილია',

            'conditions' => json_encode([
                'დანიელი ტურისტის კარავი ყვითელ და ლურჯ კარვებზე უფრო დიდია.',
                'გერმანელი ტურისტის კარვის უშუალოდ მარცხნივ ლურჯი კარავი დგას, ხოლო უშუალოდ მარჯვნივ – ყვითელი.',
                'ინგლისელ ტურისტს არ ეკუთვნის არც ლურჯი კარავი და არც წითელი.',
                'წითელი კარავი და ინგლისელი ტურისტის კარავი გვერდიგვერდ არ დგას.',

            ]),
            'extra' => json_encode(['წითელი', 'ყვითელი', 'მწვანე', 'ლურჯი']),
            'question' => 'რომელი კარავი რომელ ტურისტს ეკუთვნის?',
            'answers' => json_encode(
                [
                    'ა' => 'გერმანელი ინგლისელს დანიელს ფრანგს',
                    'ბ' => 'დანიელს ფრანგს ინგლისელს გერმანელს',
                    'გ' => 'ფრანგს გერმანელს დანიელს ინგლისელს',
                    'დ' => 'გერმანელს ინგლისელს ფრანგს დანიელს',
                    'ე' => 'დანიელს ინგლისელს გერმანელს ფრანგს',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 5,

            'introduction' => 'თანამედროვე კვლევების მიხედვით, მცენარეების გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - აუმჯობესებს
            მოსწავლეთა შემეცნებით უნარებს. ვარაუდობენ, რომ მცენარეები ამცირებს ეკოლოგიური სტრესორების (მაგალითად,
            ხმაური, სიცხე) ნეგატიურ გავლენას შემეცნებით უნარებზე.',

            // 'conditions' => json_encode([
            //     'დანიელი ტურისტის კარავი ყვითელ და ლურჯ კარვებზე უფრო დიდია.',
            //     'გერმანელი ტურისტის კარვის უშუალოდ მარცხნივ ლურჯი კარავი დგას, ხოლო უშუალოდ მარჯვნივ – ყვითელი.',
            //     'ინგლისელ ტურისტს არ ეკუთვნის არც ლურჯი კარავი და არც წითელი.',
            //     'წითელი კარავი და ინგლისელი ტურისტის კარავი გვერდიგვერდ არ დგას.',

            // ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი ვითარება დააყენებს ეჭვქვეშ აღნიშნულ ახსნას?',
            'answers' => json_encode(
                [
                    'ა' => 'ერთ-ერთი ფართომასშტაბიანი კვლევის მიხედვით, სხვა თანატოლებთან შედარებით, იმ ბავშვების შემეცნებითი
                    უნარების განვითარების დონე, რომელთა საცხოვრებელი ადგილი გამწვანებული იყო, უფრო მაღალი აღმოჩნდა,
                    თუმცა მათი აბსოლუტური უმრავლესობა მაღალი სოციალურ-ეკონომიკური სტატუსის მქონე ოჯახებს
                    წარმოადგენდა',
                    'ბ' => 'ერთ-ერთი გრძელვადიანი კვლევის მიხედვით, სოციალურ თუ აკადემიურ სფეროში იმ ადამიანების მიღწევები,
                    რომლებმაც ბავშვობა გამწვანებულ გარემოში გაატარეს, მნიშვნელოვნად მაღალი აღმოჩნდა იმ ადამიანების
                    მიღწევებთან შედარებით, რომლებსაც ამგვარ გარემოში არ უცხოვრიათ',
                    'გ' => 'კვლევებით დადასტურებულია, რომ ბუნებაში ჩატარებული გაკვეთილები აუმჯობესებს მოსწავლეთა ყურადღების
                    კონცენტრაციის უნარს, თუმცა ნაკლებად არის შესწავლილი, რამდენად გრძელვადიანია ეს ეფექტი',
                    'დ' => 'ნეიროფსიქოლოგიური კვლევების მიხედვით, მწვანე გარემოს გრძელვადიანი ზემოქმედების შედეგად
                    უმჯობესდება თავის ტვინის იმ უბნების ფუნქციონირების დონე, რომლებიც პასუხისმგებელია ყურადღებისა თუ
                    მეხსიერების პროცესებზე',
                    'ე' => 'კვლევებით დადასტურებულია, რომ მწვანე გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - ფიზიკური აქტივობის
                    მაპროვოცირებელია და მოსწავლეების სპორტით დაინტერესებას უწყობს ხელს',
                ]
            ),
            'correct' => 'ა',

        ]);
    }
}
