<?php

namespace Database\Seeders;

use App\Models\TestType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;
use Illuminate\Support\Facades\Hash;
use Illuminate\Support\Str;


class TestSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */

    public function run(): void
    {
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 1,
            'introduction' => 'კინოფესტივალზე სხვადასხვა ჟანრის – კომედიურ, დეტექტიურ, სათავგადასავლო და ანიმაციურ – ფილმებს
            აჩვენებენ. ამასთან, კინოფესტივალი ოთხ დღეს (ხუთშაბათი-კვირა) გრძელდება და თითოეულ ჟანრს თითო დღე ეთმობა.
            ფესტივალის პროგრამის შედგენისას ორგანიზატორებმა შემდეგი პირობები უნდა დაიცვან:',

            'conditions' => json_encode([
                'კომედიური ფილმები უნდა აჩვენონ ხუთშაბათს ან პარასკევს.',
                'დეტექტიური ფილმები უნდა აჩვენონ პარასკევს ან შაბათს.',
                'სათავგადასავლო ფილმები უნდა აჩვენონ შაბათს ან კვირას.',
                'ანიმაციური ფილმები უნდა აჩვენონ ხუთშაბათს ან კვირას.',
            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი განაწილება აკმაყოფილებს ოთხივე პირობას?',
            'answers' => json_encode(
                [
                    'ა' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ბ' => 'ხუთშაბათს – ანიმაციური, პარასკევს – კომედიური, შაბათს – დეტექტიური, კვირას – სათავგადასავლო',
                    'გ' => 'ხუთშაბათს – კომედიური, პარასკევს – დეტექტიური, შაბათს – ანიმაციური, კვირას – სათავგადასავლო',
                    'დ' => 'ხუთშაბათს – კომედიური, პარასკევს – ანიმაციური, შაბათს – სათავგადასავლო, კვირას – დეტექტიური',
                    'ე' => 'ხუთშაბათს – კომედიური, პარასკევს – სათავგადასავლო, შაბათს – დეტექტიური, კვირას – ანიმაციური',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 2,

            'introduction' => 'მოცემულია გამონათქვამი:',

            'conditions' => json_encode([
                'არავინაა უნაკლო.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი დებულება ვერ იქნება ჭეშმარიტი, თუ მოცემული გამონათქვამი ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'უნაკლო ადამიანი არ არსებობს',
                    'ბ' => 'ზოგიერთ ადამიანს ბევრი ნაკლი აქვს',
                    'გ' => 'ყოველ ადამიანს ერთი ნაკლი მაინც აქვს',
                    'დ' => 'ზოგიერთ ადამიანს არც ერთი ნაკლი არ აქვს',
                    'ე' => 'ზოგიერთ ადამიანს ზოგიერთი ნაკლი არ აქვს',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 3,

            'introduction' => 'მოცემულია:',

            'conditions' => json_encode([
                'არც ერთი სტუდენტი არ არის არასრულწლოვანი.',

            ]),
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელია აუცილებლად ჭეშმარიტი, თუ მოცემული დებულება ჭეშმარიტია?',
            'answers' => json_encode(
                [
                    'ა' => 'ყველა სტუდენტი არასრულწლოვანია',
                    'ბ' => 'ყველა სრულწლოვანი ადამიანი სტუდენტია',
                    'გ' => 'არც ერთი არასრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'დ' => 'არც ერთი სრულწლოვანი ადამიანი არ არის სტუდენტი',
                    'ე' => 'არავინ, ვინც სტუდენტი არ არის, არ არის სრულწლოვანი',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 4,

            'introduction' => 'მდინარის სანაპიროზე ოთხი კარავია ჩამწკრივებული: წითელი, ყვითელი, მწვანე და ლურჯი. თითოეული მათგანი
            თითო ტურისტს ეკუთვნის: ერთი – ინგლისელს, ერთი – ფრანგს, ერთი – დანიელს და ერთიც – გერმანელს.
            ცნობილია',

            'conditions' => json_encode([
                'დანიელი ტურისტის კარავი ყვითელ და ლურჯ კარვებზე უფრო დიდია.',
                'გერმანელი ტურისტის კარვის უშუალოდ მარცხნივ ლურჯი კარავი დგას, ხოლო უშუალოდ მარჯვნივ – ყვითელი.',
                'ინგლისელ ტურისტს არ ეკუთვნის არც ლურჯი კარავი და არც წითელი.',
                'წითელი კარავი და ინგლისელი ტურისტის კარავი გვერდიგვერდ არ დგას.',

            ]),
            'extra' => json_encode(['წითელი', 'ყვითელი', 'მწვანე', 'ლურჯი']),
            'question' => 'რომელი კარავი რომელ ტურისტს ეკუთვნის?',
            'answers' => json_encode(
                [
                    'ა' => 'გერმანელი ინგლისელს დანიელს ფრანგს',
                    'ბ' => 'დანიელს ფრანგს ინგლისელს გერმანელს',
                    'გ' => 'ფრანგს გერმანელს დანიელს ინგლისელს',
                    'დ' => 'გერმანელს ინგლისელს ფრანგს დანიელს',
                    'ე' => 'დანიელს ინგლისელს გერმანელს ფრანგს',
                ]
            ),
            'correct' => 'ე',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'logic',
            'number' => 5,

            'introduction' => 'თანამედროვე კვლევების მიხედვით, მცენარეების გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - აუმჯობესებს
            მოსწავლეთა შემეცნებით უნარებს. ვარაუდობენ, რომ მცენარეები ამცირებს ეკოლოგიური სტრესორების (მაგალითად,
            ხმაური, სიცხე) ნეგატიურ გავლენას შემეცნებით უნარებზე.',
            'question' => 'ქვემოთ ჩამოთვლილთაგან რომელი ვითარება დააყენებს ეჭვქვეშ აღნიშნულ ახსნას?',
            'answers' => json_encode(
                [
                    'ა' => 'ერთ-ერთი ფართომასშტაბიანი კვლევის მიხედვით, სხვა თანატოლებთან შედარებით, იმ ბავშვების შემეცნებითი
                    უნარების განვითარების დონე, რომელთა საცხოვრებელი ადგილი გამწვანებული იყო, უფრო მაღალი აღმოჩნდა,
                    თუმცა მათი აბსოლუტური უმრავლესობა მაღალი სოციალურ-ეკონომიკური სტატუსის მქონე ოჯახებს
                    წარმოადგენდა',
                    'ბ' => 'ერთ-ერთი გრძელვადიანი კვლევის მიხედვით, სოციალურ თუ აკადემიურ სფეროში იმ ადამიანების მიღწევები,
                    რომლებმაც ბავშვობა გამწვანებულ გარემოში გაატარეს, მნიშვნელოვნად მაღალი აღმოჩნდა იმ ადამიანების
                    მიღწევებთან შედარებით, რომლებსაც ამგვარ გარემოში არ უცხოვრიათ',
                    'გ' => 'კვლევებით დადასტურებულია, რომ ბუნებაში ჩატარებული გაკვეთილები აუმჯობესებს მოსწავლეთა ყურადღების
                    კონცენტრაციის უნარს, თუმცა ნაკლებად არის შესწავლილი, რამდენად გრძელვადიანია ეს ეფექტი',
                    'დ' => 'ნეიროფსიქოლოგიური კვლევების მიხედვით, მწვანე გარემოს გრძელვადიანი ზემოქმედების შედეგად
                    უმჯობესდება თავის ტვინის იმ უბნების ფუნქციონირების დონე, რომლებიც პასუხისმგებელია ყურადღებისა თუ
                    მეხსიერების პროცესებზე',
                    'ე' => 'კვლევებით დადასტურებულია, რომ მწვანე გარემო - საცხოვრებელ ადგილსა თუ სკოლაში - ფიზიკური აქტივობის
                    მაპროვოცირებელია და მოსწავლეების სპორტით დაინტერესებას უწყობს ხელს',
                ]
            ),
            'correct' => 'ა',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 6,

            'introduction' => 'გმირთა ცხოვრებამ ------- ისტორია, ------- ისტორიამ ------- გმირთა მამაცობა. ------- იმის გარკვევა, თუ ვინ ვისგან
            არის დავალებული: მემატიანე მათგან, ვინც უხვი მასალით უზრუნველყო იგი, თუ მემატიანეს უნდა უმადლოდნენ
            დიდი პიროვნებანი?',
            'answers' => json_encode(
                [
                    'ა' => 'ვერაფრით გაამდიდრა / ხოლო / არ შეამკო / მიუხედავად ამისა, ადვილი არაა',
                    'ბ' => 'ვერაფრით გაამდიდრა / თუმცა / დააფასა / მიუხედავად ამისა, ადვილია',
                    'გ' => 'გაამდიდრა / თუმცა / ვერ დააფასა / ამიტომ ძნელია',
                    'დ' => 'გაამდიდრა / ხოლო / შეამკო / ამიტომ ძნელია',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 7,

            'introduction' => '------- , რაც ასე ------- სკოლისთვის, არათუ ------- ახალგაზრდების ინტელექტუალურ და მორალურ
            განვითარებას. ამ ------- აღმოჩენა და აღიარება ახალ შეკითხვას წამოჭრის: რას ნიშნავს თავისუფლება და რა ადგილი
            ------- განათლებაში?',
            'answers' => json_encode(
                [
                    'ა' => 'ვსრული თავისუფლება / უცხოა თანამედროვე / ხელს უწყობს, არამედ, პირიქით, ზღუდავს / მნიშვნელოვანი ფაქტის
                    / ჰქონდა ძალდატანებას ტრადიციულ',
                    'ბ' => 'ძალდატანება / დამახასიათებელი იყო ტრადიციული / ხელს უწყობდა, არამედ, პირიქით, ზღუდავდა /
                    სერიოზული ხარვეზის / უნდა ჰქონდეს მას თანამედროვე',
                    'გ' => 'სრული თავისუფლება / დამახასიათებელი იყო ტრადიციული / ზღუდავდა, არამედ, პირიქით, ხელს უწყობდა /
                    სერიოზული ხარვეზის / უნდა ჰქონდეს მას თანამედროვე',
                    'დ' => 'ძალდატანება / დამახასიათებელია თანამედროვე / ზღუდავს, არამედ, პირიქით, ხელს უწყობს / მნიშვნელოვანი
                    ფაქტის / ჰქონდა მას ტრადიციულ',
                ]
            ),
            'correct' => 'ბ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 8,

            'introduction' => '------- შემოქმედებითი ადამიანი. პედანტურობა ------- ხელსაყრელია, რადგან ------- ერგები ბიუროკრატიულ და
            ტექნოკრატიულ კულტურას',
            'answers' => json_encode(
                [
                    'ა' => 'არ არის ძნელი, იყო / ნაკლებად / არ გაქვს პასუხები და ვერ',
                    'ბ' => 'არ არის ძნელი, იყო / ნაკლებად / გაქვს პასუხები და ადვილად',
                    'გ' => 'არ არის ადვილი, იყო / ბევრად უფრო / არ გაქვს პასუხები და ვერ',
                    'დ' => 'არ არის ადვილი, იყო / ბევრად უფრო / გაქვს პასუხები და ადვილად',
                ]
            ),
            'correct' => 'დ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'fill',
            'number' => 9,

            'introduction' => 'გადაჭარბებული აქცენტი ------- ნაცვლად, სხვა არაფერია, თუ არა თავისუფლების ------- იმპულსებისა და
            სურვილების ------- . ამგვარ შეცდომას ვუშვებთ მაშინ, როდესაც -------, რადგან არ არსებობს მიზანი, თუკი ის ------- არ
            ეფუძნება.',
            'answers' => json_encode(
                [
                    'ა' => 'მიზანმიმართულ გონიერ მოქმედებაზე, სპონტანური აქტივობის / დაპირისპირება / დაუფიქრებელ
                    შესრულებასთან / იმპულსი მიზანში გვერევა / იმპულსურ სწრაფვას',
                    'ბ' => 'სპონტანურობაზე, მიზანმიმართული გონიერი მოქმედების / დაპირისპირება / გონებით კონტროლთან / მიზანს
                    იმპულსისგან გავმიჯნავთ / იმპულსურ სწრაფვას',
                    'გ' => 'სპონტანურობაზე, მიზანმიმართული გონიერი მოქმედების / გაიგივება / დაუფიქრებელ შესრულებასთან /
                    იმპულსი მიზანში გვერევა / გააზრებულ გადაწყვეტილებას',
                    'დ' => 'მიზანმიმართულ გონიერ მოქმედებაზე, სპონტანური აქტივობის / გაიგივება / გონებით კონტროლთან / მიზანს
                    იმპულსისგან გავმიჯნავთ / გააზრებულ გადაწყვეტილებას',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 10,
            'introduction' => 'რა გახდა აფრიკიდან ჩრდილოეთ ნახევარსფეროში მოსული ადრეული ადამიანისთვის განვითარების სტიმული?
            (უპასუხეთ I აბზაცის მიხედვით.)',
            'answers' => json_encode(
                [
                    'ა' => 'ადრეული ადამიანისა და მგლის ეკოლოგიურ ნიშათა მსგავსება და მკაცრი კლიმატის შეცვლა სეზონურით;',
                    'ბ' => 'ჩრდილოეთ ნახევარსფეროში პოტენციური მსხვერპლით სავსე ტყე-ველის არსებობა და ადრეული ადამიანის მიერ
                    ამ ტერიტორიების ათვისება',
                    'გ' => 'ჩრდილოეთ ნახევარსფეროში გაბატონებულ მთავარ მტაცებელთან კონკურენცია, რასაც მოჰყვა ამავე მტაცებლის
                    ადაპტირება ადამიანის გარემოსთან',
                    'დ' => 'აფრიკიდან მოსული ადამიანისთვის უფრო რთული პირობების არსებობა ახალ გარემოში და სხვადასხვა სახეობის
                    გარეული ცხოველების მოშინაურება',
                ]
            ),
            'correct' => 'გ',

        ]);
        DB::table('tests')->insert([
            'test_type_id' => TestType::find(1)['id'],
            'type' => 'verbal',
            'category' => 'text',
            'number' => 11,
            'introduction' => 'კონრად ლორენცმა თავისი წიგნის ერთ-ერთ თავს „შეთანხმება“ დაარქვა. ქვემოთ ჩამოთვლილთაგან რომელში
            ჩანს სწორად ამ „შეთანხმების“ არსი',
            'answers' => json_encode(
                [
                    'ა' => ' მრავალი წლის განმავლობაში ადრეული ადამიანი და მგელი იძულებულნი იყვნენ, ერთსა და იმავე მსხვერპლზე
                    ენადირათ',
                    'ბ' => 'ზომიერ სარტყელში ნადირობისთვის ადამიანიც ისევე იყო ადაპტირებული, როგორც მთავარი მტაცებელი – მგელი',
                    'გ' => 'სანამ ადამიანი სელექციურ სამუშაოებს დაიწყებდა, მანამდე ძაღლებში მიმდინარე ცვლილებები, დიდი
                    ალბათობით, ბუნებრივად ხდებოდა',
                    'დ' => 'ადრეულმა ადამიანმა ნადირობისას თავის პარტნიორად აქცია მგელი (შემდგომში ძაღლი), მას კი ადაპტირებისას
                    აგრესიული თვისებები შეუსუსტდა',
                ]
            ),
            'correct' => 'დ',

        ]);
    }
}
