<?php

namespace Database\Seeders;

use App\Models\TestType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TextSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('texts')->insert([
            'test_type_id' => TestType::find(1)->value('id'),
            'texts' => json_encode(
                [
                    'I' => 'მგელსა და პრეისტორიულ ადამიანს მსგავსი ეკოლოგიური ნიშები ეკავათ, თუმცა, სხვადასხვა კონტინენტზე:
                    პირველი ჩრდილოეთ ნახევარსფეროში ბატონობდა, მეორე კი – სამხრეთში (აფრიკაში). ადრეული ადამიანი ახალი
                    ტერიტორიების ასათვისებლად ჩრდილოეთისკენ წამოვიდა. იქ მას დახვდა შედარებით მკაცრი და, მოგვიანებით უკვე,
                    სეზონური კლიმატი, პოტენციური მსხვერპლით სავსე ტყე-ველი და მთავარი მტაცებელი მგელი. ახალმა გარემომ ახალი
                    პირობები წაუყენა ადამიანს და, შესაძლოა, ის ფაქტი, რომ მგელი უკვე მყარად ბატონობდა მოცემულ ეკოლოგიურ
                    ნიშაში, ადამიანისთვის შემდგომი განვითარების სტიმულად იქცა. ამის ერთ-ერთ მაგალითად, შეიძლება, მგლის
                    მოშინაურება მივიჩნიოთ',
                    'II' => 'მრავალი წლის განმავლობაში ადრეული ადამიანი და მგელი იძულებულნი იყვნენ, ერთსა და იმავე მსხვერპლზე
                    ენადირათ. ზომიერ სარტყელში ნადირობისთვის, ალბათ, მგელი უფრო ადაპტირებული იყო, ვიდრე ადამიანი. ადამიანმა
                    მგელს „მიმართა“ დასახმარებლად და ზოგიერთი მისი თანამოძმე „დაიმეგობრა“. სწორედ ძაღლი გახდა მას შემდეგ ჩვენი
                    დამცველიც და შეუცვლელი პარტნიორიც ნადირობისას. გარდა ამისა, ძაღლის მოშინაურება უზარმაზარი ნახტომი იყო
                    ადამიანის შემდგომ განვითარებაში. ჯერ კიდევ კონრად ლორენცმა, ავსტრიელმა ზოოფსიქოლოგმა, საკუთარი წიგნის
                    („ადამიანი პოულობს ძაღლს“) ერთ-ერთ თავს „შეთანხმება“ დაარქვა. ამ თავში აღწერილია, თუ როგორ „შეთანხმდნენ“
                    ადამიანი და მგელი (შემდგომში ძაღლი), რომ ერთად გაეგრძელებინათ ცხოვრება. გავრცელებული მოსაზრებით,
                    ადამიანმა ძაღლი 15 000 წლის წინ მოიშინაურა. ზოგადად, სელექციური სამუშაოები დაახლოებით XVIII საუკუნიდან
                    იწყება და მანამდე მიმდინარე ცვლილებები ძაღლებში, დიდი ალბათობით, ბუნებრივად ხდებოდა. შესაძლოა, თავად
                    ძაღლი ადაპტირდა ადამიანის გარემოსთან, რადგან აგრესიული ცხოველის მოკვლის შანსი გაცილებით მაღალი
                    იქნებოდა. მოშინაურებულმა ძაღლმა სხვადასხვა ახალი თვისება შეიძინა',
                    'III' => 'ცხოველების სხვა სახეობებისგან განსხვავებით, ძაღლები მუდმივად ითხოვენ ადამიანებთან თვალებით კონტაქტს.
                    ასეთი გამომეტყველების მიღება ძაღლებს სწორედ იმიტომ შეუძლიათ, რომ ჩვენ მათი თვალების უგულებელყოფა თავს
                    დამნაშავედ გვაგრძნობინებს. ძაღლის სახეზე არსებული მიმიკური კუნთები ისეთი გამომეტყველების მიღების
                    საშუალებას იძლევა, როგორის მიღებაც მგლებს არ შეუძლიათ. წარბების აწევასა და ჩვენთვის თავის შეცოდებას ძაღლები
                    თვალების გარშემო არსებული სპეციალური წყვილი კუნთის საშუალებით ახერხებენ. ეს პირველი ბიოლოგიური
                    მტკიცებულებაა იმისა, რომ ძაღლებს მოშინაურების პროცესში ეს კუნთები ერთი კონკრეტული მიზნით, ადამიანებთან
                    კომუნიკაციისთვის ჩამოუყალიბდათ. ეს ორი კუნთი თვალებს უფრო დიდსა და მეტყველს აჩენს. ცნობილია, რომ
                    თავშესაფრებიდან უფრო ხშირად მიჰყავთ ის ძაღლები, რომლებსაც მიმიკური კუნთები კარგად აქვთ განვითარებული.',
                    'IV' => 'ძაღლები წარბებს ამოძრავებენ ადამიანის ყურადღების მისაქცევად, მასთან ურთიერთობისას. ეს უნარი მათ
                    ათასობით წლის განმავლობაში ადამიანთან ერთად ცხოვრების კვალდაკვალ ჩამოუყალიბდათ. ამის გადამოწმება კი
                    მგლების შესწავლით შეგვიძლია. მეცნიერებმა თვალის ირგვლივ კუნთის პოვნა ოთხი ჯიშის მგელში სცადეს, მაგრამ
                    უშედეგოდ. ხოლო ძაღლების შერჩეული ექვსი ჯიშიდან წარბის კუნთები ხუთში იპოვეს. გამონაკლისი იყო ციმბირული
                    ჰასკი, რომელიც ჯგუფში ყველაზე ძველ ჯიშს წარმოადგენდა',
                    'V' => 'როგორც ჩანს, ძაღლებს აქვთ იმის უნარი, რომ ადამიანებს მოგვბაძონ და ჩვენგან გარკვეული ქცევები დაისწავლონ.
                    ასეთი ქცევა მათ რეალურ უპირატესობას ანიჭებს. ფაქტია, რომ ძაღლებს ადამიანების მიმიკების მიბაძვით ჩვენით
                    მანიპულირება მშვენივრად გამოსდით და ჩვენც მათ ამის საშუალებას სიამოვნებით ვაძლევთ.',
                ]
            ),
            'part' => 1,
        ]);
    }
}
