<?php

namespace Database\Seeders;

use App\Models\TestType;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class TextSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('texts')->insert([
            'test_type_id' => TestType::find(1)->value('id'),
            'texts' => json_encode(
                [
                    'I' => 'მგელსა და პრეისტორიულ ადამიანს მსგავსი ეკოლოგიური ნიშები ეკავათ, თუმცა, სხვადასხვა კონტინენტზე:
                    პირველი ჩრდილოეთ ნახევარსფეროში ბატონობდა, მეორე კი – სამხრეთში (აფრიკაში). ადრეული ადამიანი ახალი
                    ტერიტორიების ასათვისებლად ჩრდილოეთისკენ წამოვიდა. იქ მას დახვდა შედარებით მკაცრი და, მოგვიანებით უკვე,
                    სეზონური კლიმატი, პოტენციური მსხვერპლით სავსე ტყე-ველი და მთავარი მტაცებელი მგელი. ახალმა გარემომ ახალი
                    პირობები წაუყენა ადამიანს და, შესაძლოა, ის ფაქტი, რომ მგელი უკვე მყარად ბატონობდა მოცემულ ეკოლოგიურ
                    ნიშაში, ადამიანისთვის შემდგომი განვითარების სტიმულად იქცა. ამის ერთ-ერთ მაგალითად, შეიძლება, მგლის
                    მოშინაურება მივიჩნიოთ',
                    'II' => 'მრავალი წლის განმავლობაში ადრეული ადამიანი და მგელი იძულებულნი იყვნენ, ერთსა და იმავე მსხვერპლზე
                    ენადირათ. ზომიერ სარტყელში ნადირობისთვის, ალბათ, მგელი უფრო ადაპტირებული იყო, ვიდრე ადამიანი. ადამიანმა
                    მგელს „მიმართა“ დასახმარებლად და ზოგიერთი მისი თანამოძმე „დაიმეგობრა“. სწორედ ძაღლი გახდა მას შემდეგ ჩვენი
                    დამცველიც და შეუცვლელი პარტნიორიც ნადირობისას. გარდა ამისა, ძაღლის მოშინაურება უზარმაზარი ნახტომი იყო
                    ადამიანის შემდგომ განვითარებაში. ჯერ კიდევ კონრად ლორენცმა, ავსტრიელმა ზოოფსიქოლოგმა, საკუთარი წიგნის
                    („ადამიანი პოულობს ძაღლს“) ერთ-ერთ თავს „შეთანხმება“ დაარქვა. ამ თავში აღწერილია, თუ როგორ „შეთანხმდნენ“
                    ადამიანი და მგელი (შემდგომში ძაღლი), რომ ერთად გაეგრძელებინათ ცხოვრება. გავრცელებული მოსაზრებით,
                    ადამიანმა ძაღლი 15 000 წლის წინ მოიშინაურა. ზოგადად, სელექციური სამუშაოები დაახლოებით XVIII საუკუნიდან
                    იწყება და მანამდე მიმდინარე ცვლილებები ძაღლებში, დიდი ალბათობით, ბუნებრივად ხდებოდა. შესაძლოა, თავად
                    ძაღლი ადაპტირდა ადამიანის გარემოსთან, რადგან აგრესიული ცხოველის მოკვლის შანსი გაცილებით მაღალი
                    იქნებოდა. მოშინაურებულმა ძაღლმა სხვადასხვა ახალი თვისება შეიძინა',
                    'III' => 'ცხოველების სხვა სახეობებისგან განსხვავებით, ძაღლები მუდმივად ითხოვენ ადამიანებთან თვალებით კონტაქტს.
                    ასეთი გამომეტყველების მიღება ძაღლებს სწორედ იმიტომ შეუძლიათ, რომ ჩვენ მათი თვალების უგულებელყოფა თავს
                    დამნაშავედ გვაგრძნობინებს. ძაღლის სახეზე არსებული მიმიკური კუნთები ისეთი გამომეტყველების მიღების
                    საშუალებას იძლევა, როგორის მიღებაც მგლებს არ შეუძლიათ. წარბების აწევასა და ჩვენთვის თავის შეცოდებას ძაღლები
                    თვალების გარშემო არსებული სპეციალური წყვილი კუნთის საშუალებით ახერხებენ. ეს პირველი ბიოლოგიური
                    მტკიცებულებაა იმისა, რომ ძაღლებს მოშინაურების პროცესში ეს კუნთები ერთი კონკრეტული მიზნით, ადამიანებთან
                    კომუნიკაციისთვის ჩამოუყალიბდათ. ეს ორი კუნთი თვალებს უფრო დიდსა და მეტყველს აჩენს. ცნობილია, რომ
                    თავშესაფრებიდან უფრო ხშირად მიჰყავთ ის ძაღლები, რომლებსაც მიმიკური კუნთები კარგად აქვთ განვითარებული.',
                    'IV' => 'ძაღლები წარბებს ამოძრავებენ ადამიანის ყურადღების მისაქცევად, მასთან ურთიერთობისას. ეს უნარი მათ
                    ათასობით წლის განმავლობაში ადამიანთან ერთად ცხოვრების კვალდაკვალ ჩამოუყალიბდათ. ამის გადამოწმება კი
                    მგლების შესწავლით შეგვიძლია. მეცნიერებმა თვალის ირგვლივ კუნთის პოვნა ოთხი ჯიშის მგელში სცადეს, მაგრამ
                    უშედეგოდ. ხოლო ძაღლების შერჩეული ექვსი ჯიშიდან წარბის კუნთები ხუთში იპოვეს. გამონაკლისი იყო ციმბირული
                    ჰასკი, რომელიც ჯგუფში ყველაზე ძველ ჯიშს წარმოადგენდა',
                    'V' => 'როგორც ჩანს, ძაღლებს აქვთ იმის უნარი, რომ ადამიანებს მოგვბაძონ და ჩვენგან გარკვეული ქცევები დაისწავლონ.
                    ასეთი ქცევა მათ რეალურ უპირატესობას ანიჭებს. ფაქტია, რომ ძაღლებს ადამიანების მიმიკების მიბაძვით ჩვენით
                    მანიპულირება მშვენივრად გამოსდით და ჩვენც მათ ამის საშუალებას სიამოვნებით ვაძლევთ.',
                ]
            ),
            'part' => 1,
        ]);
        DB::table('texts')->insert([
            'test_type_id' => TestType::find(1)->value('id'),
            'texts' => json_encode(
                [
                    'I' => 'პირველი მულტიპლიკაციური ფილმი მე-20 საუკუნის დასაწყისში შეიქმნა. სიტყვა „მულტიპლიკაცია“ ლათინური
                    წარმოშობისაა და გამრავლებას ნიშნავს. მართლაც, ეკრანზე ნახატი რომ ამოძრავდეს, ამისათვის ერთი გამოსახულება
                    უამრავი სახეცვლილებით უნდა დაიხატოს, შემდეგ საპროექციო აპარატში მას სწრაფად გაატარებენ და ნახატიც
                    ამოძრავდება. მულტიპლიკაციური ნაწარმოები იქმნება სპეციალურად მოწყობილ დანადგარზე ნახატი ფიგურის
                    მოძრაობის ცალკეული ფაზების თანმიმდევრული გადაღებით. ნახატ ფილმებს ანიმაციურსაც უწოდებენ. „ანიმაცია“
                    ლათინური სიტყვაა და „გასულიერებას“, „გაცოცხლებას“ ნიშნავს.',
                    'II' => 'ადამიანი უხსოვარი დროიდან ცდილობს თავისი ნაკეთობების – ნახატებისა თუ გამოქანდაკებული ფიგურების –
                    გაცოცხლებას. ამის ნიმუშებს ვხვდებით პალეოლითის ხანის კედლის მხატვრობაშიც. ნახატებზე ცხოველების
                    კიდურების ჭარბი რაოდენობა ამ გამოსახულებების ამოძრავების მცდელობა უნდა იყოს. რეჟისორი მარკ აზემა
                    მსოფლიოს პირველ ანიმატორებად გამოქვაბულის მხატვრებს ასახელებს. ბნელ მღვიმეში მოციმციმე ცეცხლის შუქზე
                    შექმნილი კომპოზიციები მართლაც ბადებდა მოძრაობის ილუზიას. აზემამ გააკეთა გამოქვაბულის რამდენიმე ნახატის
                    ციფრული ვერსია, რომელიც ამ ეფექტის ილუსტრაციას წარმოადგენს. შოვე პონ-დ’არკის გამოქვაბულის (საფრანგეთი,
                    ზედა პალეოლითი) კედელზე დახატულია ათი ლომი, ყველა თითქოს ნადავლს დაეძებს. თუმცა ჩირაღდნის შუქზე ეს
                    ათივე ლომი, შესაძლოა, მხოლოდ ერთი ან ორი ლომის თანმიმდევრულ გამოსახულებად გაერთიანდეს, ამ
                    კომპოზიციაში კადრებივით რომ მოძრაობენ. ლომების გვერდით მარტორქები დგანან. ერთი მარტორქის თავი და რქა
                    ექვსჯერ მეორდება ერთიმეორის ზემოთ – იქმნება თავის აქნევის ეფექტი.',
                    'III' => 'კადრების სწრაფი მონაცვლეობა ქმნის ოპტიკურ ილუზიას. ჩვენ შეგვიძლია მარტივი ცდა ჩავატაროთ:
                    ცეცხლმოკიდებული ჯოხი წრიულად სწრაფად დავატრიალოთ ჰაერში. მალე ჩვენ დავინახავთ მანათობელ წრეს,
                    სინამდვილეში კი მანათობელი წრე არ არსებობს. ჩვენ იმიტომ ვხედავთ ასეთ წრეს, რომ ჯოხს ვატრიალებთ უფრო
                    სწრაფად, ვიდრე მას თვალი აღიქვამს. მანათობელი წერტილის ერთი მდგომარეობის გამოსახულება ვერ ასწრებს
                    თვალის ბადურაზე გაქრობას, რომ მის გვერდით ჩნდება უკვე მეორე ასეთივე გამოსახულება. ორი მსგავსი გამოსახულება
                    უერთდება ერთმანეთს, შემდეგ მას ემატება მესამე, მეოთხე... და ასე წარმოიქმნება ერთი მთლიანი ცეცხლის წრე.',
                    'IV' => 'პირველად 1824 წელს ინგლისელი ექიმის პეტერ მარკ როჯეტის გამოკვლევებმა დაამტკიცა, რომ ადამიანის თვალი
                    მხედველობით შთაბეჭდილებას მოვლენის გაქრობის შემდეგ 0,1 წამის განმავლობაში ინარჩუნებს. თუ ორ მხედველობით
                    შთაბეჭდილებას შორის ინტერვალი 0,3 წამს არ აღემატება, მაშინ ეს ორი შთაბეჭდილება ერთმანეთს ერწყმის და ერთი
                    სახეშეცვლილი საგანი მიიღება. ამ თვისების გამოყენების პრინციპს ეფუძნება არაერთი ოპტიკური სათამაშო.',
                    'V' => 'ოპტიკურ ილუზიაზე გათვლილი სათამაშო ჯერ კიდევ ჩვენი წელთაღრიცხვით 180 წელს შეიქმნა ჩინეთში. ამ
                    ხელსაწყოს ზოოტროპი ეწოდება. იგი წარმოადგენს თავღია დისკოს, რომლის შიდა კედლებზე გამოსახულია
                    ცხოველები განსხვავებულ პოზიციებში. დისკოს ბრუნვა ქმნის შთაბეჭდილებას, რომ შიგ ჩახატული ცხოველები
                    მოძრაობენ. XIX საუკუნის დასაწყისში კი ასტროფიზიკოსმა ჯონ ჰერშელმა შექმნა ოპტიკური სათამაშო ნახატების
                    გამოყენებით. მან მუყაოზე დახატა წრე და გამოჭრა. შემდეგ ერთ მხარეს დახატა 2 ჩიტი, მეორე მხარეს კი – გალია.
                    მუყაოს ორივე მხარეს მიამაგრა ძაფები და მუყაო დაატრიალა. სწრაფი ტრიალის დროს სხვადასხვა მხარეს გამოსახული
                    ჩიტები და გალია ერთ ნახატად ერთდებოდა. ადამიანს ისეთი შთაბეჭდილება რჩებოდა, თითქოს ფრინველები გალიაში
                    ისხდნენ და გამოფრინდნენ. ჰერშელმა ამ სათამაშოს ტაუმატროპი უწოდა. ამას მოჰყვა პრაქსინოსკოპი, რომელიც
                    თანამედროვე პროექტორის „წინაპარია“. XIX საუკუნეში შექმნილი აპარატები საბოლოოდ კინოკამერის შექმნით
                    დასრულდა, რასაც მოჰყვა კინოს დაბადება.',
                ]
            ),
            'part' => 2,
        ]);
        DB::table('texts')->insert([
            'test_type_id' => TestType::find(1)->value('id'),
            'image' => env('IMAGE_URL') . '/images/general-version-1-data-1.png',

            'texts' => json_encode(
                [
                    '' => 'დიაგრამაზე მოცემულია უმაღლეს საგანმანათლებლო დაწესებულებებში სტუდენტთა განაწილება პროგრამების
                    მიხედვით და თითოეული პროგრამისთვის სტუდენტთა განაწილება სქესის მიხედვით. თითოეულ საგანმანათლებლო
                    პროგრამას შეესაბამება საერთო გვერდის
                    მქონე მუქი და ღია ფერის
                    მართკუთხედები, რომელთა სიმაღლე
                    გვიჩვენებს იმ სტუდენტების
                    რაოდენობას, რომლებმაც ეს პროგრამა
                    აირჩიეს, ხოლო სიგრძე – ამ
                    სტუდენტების პროცენტულ განაწილებას
                    სქესის მიხედვით (მუქი მართკუთხედები
                    შეესაბამება ქალების პროცენტულ
                    მაჩვენებლებს, ხოლო ღია ფერის
                    მართკუთხედები – კაცების პროცენტულ
                    მაჩვენებლებს).
                    დიაგრამის მიხედვით უპასუხეთ
                    შემდეგ 4 შეკითხვას:',
                ]
            ),
            'part' => 3,
        ]);
    }
}
